Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __PMD2bits_t PMD2bits __asm__ ("PMD2") __attribute__((section("sfrs"), address(0xBF8000A0)));
#define PMD3 PMD3
extern volatile uint32_t   PMD3 __attribute__((section("sfrs"), address(0xBF8000B0)));
typedef struct {
  uint32_t U1MD:1;
  uint32_t U2MD:1;
  uint32_t U3MD:1;
  uint32_t :1;
  uint32_t ETH1MD:1;
  uint32_t :3;
  uint32_t SPI1MD:1;
  uint32_t SPI2MD:1;
  uint32_t :2;
  uint32_t W24GMD:1;
  uint32_t :3;
  uint32_t I2C1MD:1;
  uint32_t I2C2MD:1;
  uint32_t :6;
  uint32_t USB1MD:1;
  uint32_t :2;
  uint32_t CAN1MD:1;
  uint32_t CAN2MD:1;
} __PMD3bits_t;
extern volatile __PMD3bits_t PMD3bits __asm__ ("PMD3") __attribute__((section("sfrs"), address(0xBF8000B0)));
#define BCFG0 BCFG0
extern volatile uint32_t   BCFG0 __attribute__((section("sfrs"), address(0xBF800100)));
typedef struct {
  uint32_t BUHSW:1;
  uint32_t PCSCMODE:1;
  uint32_t :1;
  uint32_t BOOTISA:1;
  uint32_t :24;
  uint32_t CP:1;
  uint32_t SIGN:1;
  uint32_t :1;
  uint32_t BINFOVALID0:1;
} __BCFG0bits_t;
extern volatile __BCFG0bits_t BCFG0bits __asm__ ("BCFG0") __attribute__((section("sfrs"), address(0xBF800100)));
#define NVMCON NVMCON
extern volatile uint32_t   NVMCON __attribute__((section("sfrs"), address(0xBF800600)));
typedef struct {
  uint32_t NVMOP:4;
  uint32_t :4;
  uint32_t HTDPGM:1;
  uint32_t :3;
  uint32_t LVDERR:1;
  uint32_t WRERR:1;
  uint32_t WREN:1;
  uint32_t WR:1;
} __NVMCONbits_t;
extern volatile __NVMCONbits_t NVMCONbits __asm__ ("NVMCON") __attribute__((section("sfrs"), address(0xBF800600)));
extern volatile uint32_t        NVMCONCLR __attribute__((section("sfrs"),address(0xBF800604)));
extern volatile uint32_t        NVMCONSET __attribute__((section("sfrs"),address(0xBF800608)));
extern volatile uint32_t        NVMCONINV __attribute__((section("sfrs"),address(0xBF80060C)));
#define NVMCON2 NVMCON2
extern volatile uint32_t   NVMCON2 __attribute__((section("sfrs"), address(0xBF800610)));
typedef struct {
  uint32_t PREPG:1;
  uint32_t :5;
  uint32_t SWAPLK:2;
  uint32_t RETRY:2;
  uint32_t :2;
  uint32_t VREAD1:1;
  uint32_t CREAD1:1;
  uint32_t TEMP:1;
  uint32_t :1;
  uint32_t WS:5;
  uint32_t :3;
  uint32_t SLEEP:1;
  uint32_t :3;
  uint32_t ERS:4;
} __NVMCON2bits_t;
extern volatile __NVMCON2bits_t NVMCON2bits __asm__ ("NVMCON2") __attribute__((section("sfrs"), address(0xBF800610)));
extern volatile uint32_t        NVMCON2CLR __attribute__((section("sfrs"),address(0xBF800614)));
extern volatile uint32_t        NVMCON2SET __attribute__((section("sfrs"),address(0xBF800618)));
extern volatile uint32_t        NVMCON2INV __attribute__((section("sfrs"),address(0xBF80061C)));
#define NVMKEY NVMKEY
extern volatile uint32_t   NVMKEY __attribute__((section("sfrs"), address(0xBF800620)));
extern volatile uint32_t        NVMKEYCLR __attribute__((section("sfrs"),address(0xBF800624)));
extern volatile uint32_t        NVMKEYSET __attribute__((section("sfrs"),address(0xBF800628)));
extern volatile uint32_t        NVMKEYINV __attribute__((section("sfrs"),address(0xBF80062C)));
#define NVMADDR NVMADDR
extern volatile uint32_t   NVMADDR __attribute__((section("sfrs"), address(0xBF800630)));
extern volatile uint32_t        NVMADDRCLR __attribute__((section("sfrs"),address(0xBF800634)));
extern volatile uint32_t        NVMADDRSET __attribute__((section("sfrs"),address(0xBF800638)));
extern volatile uint32_t        NVMADDRINV __attribute__((section("sfrs"),address(0xBF80063C)));
#define NVMDATA0 NVMDATA0
extern volatile uint32_t   NVMDATA0 __attribute__((section("sfrs"), address(0xBF800640)));
extern volatile uint32_t        NVMDATA0CLR __attribute__((section("sfrs"),address(0xBF800644)));
extern volatile uint32_t        NVMDATA0SET __attribute__((section("sfrs"),address(0xBF800648)));
extern volatile uint32_t        NVMDATA0INV __attribute__((section("sfrs"),address(0xBF80064C)));
#define NVMDATA1 NVMDATA1
extern volatile uint32_t   NVMDATA1 __attribute__((section("sfrs"), address(0xBF800650)));
extern volatile uint32_t        NVMDATA1CLR __attribute__((section("sfrs"),address(0xBF800654)));
extern volatile uint32_t        NVMDATA1SET __attribute__((section("sfrs"),address(0xBF800658)));
extern volatile uint32_t        NVMDATA1INV __attribute__((section("sfrs"),address(0xBF80065C)));
#define NVMDATA2 NVMDATA2
extern volatile uint32_t   NVMDATA2 __attribute__((section("sfrs"), address(0xBF800660)));
extern volatile uint32_t        NVMDATA2CLR __attribute__((section("sfrs"),address(0xBF800664)));
extern volatile uint32_t        NVMDATA2SET __attribute__((section("sfrs"),address(0xBF800668)));
extern volatile uint32_t        NVMDATA2INV __attribute__((section("sfrs"),address(0xBF80066C)));
#define NVMDATA3 NVMDATA3
extern volatile uint32_t   NVMDATA3 __attribute__((section("sfrs"), address(0xBF800670)));
extern volatile uint32_t        NVMDATA3CLR __attribute__((section("sfrs"),address(0xBF800674)));
extern volatile uint32_t        NVMDATA3SET __attribute__((section("sfrs"),address(0xBF800678)));
extern volatile uint32_t        NVMDATA3INV __attribute__((section("sfrs"),address(0xBF80067C)));
#define NVMDATA4 NVMDATA4
extern volatile uint32_t   NVMDATA4 __attribute__((section("sfrs"), address(0xBF800680)));
extern volatile uint32_t        NVMDATA4CLR __attribute__((section("sfrs"),address(0xBF800684)));
extern volatile uint32_t        NVMDATA4SET __attribute__((section("sfrs"),address(0xBF800688)));
extern volatile uint32_t        NVMDATA4INV __attribute__((section("sfrs"),address(0xBF80068C)));
#define NVMDATA5 NVMDATA5
extern volatile uint32_t   NVMDATA5 __attribute__((section("sfrs"), address(0xBF800690)));
extern volatile uint32_t        NVMDATA5CLR __attribute__((section("sfrs"),address(0xBF800694)));
extern volatile uint32_t        NVMDATA5SET __attribute__((section("sfrs"),address(0xBF800698)));
extern volatile uint32_t        NVMDATA5INV __attribute__((section("sfrs"),address(0xBF80069C)));
#define NVMDATA6 NVMDATA6
extern volatile uint32_t   NVMDATA6 __attribute__((section("sfrs"), address(0xBF8006A0)));
extern volatile uint32_t        NVMDATA6CLR __attribute__((section("sfrs"),address(0xBF8006A4)));
extern volatile uint32_t        NVMDATA6SET __attribute__((section("sfrs"),address(0xBF8006A8)));
extern volatile uint32_t        NVMDATA6INV __attribute__((section("sfrs"),address(0xBF8006AC)));
#define NVMDATA7 NVMDATA7
extern volatile uint32_t   NVMDATA7 __attribute__((section("sfrs"), address(0xBF8006B0)));
extern volatile uint32_t        NVMDATA7CLR __attribute__((section("sfrs"),address(0xBF8006B4)));
extern volatile uint32_t        NVMDATA7SET __attribute__((section("sfrs"),address(0xBF8006B8)));
extern volatile uint32_t        NVMDATA7INV __attribute__((section("sfrs"),address(0xBF8006BC)));
#define NVMSRCADDR NVMSRCADDR
extern volatile uint32_t   NVMSRCADDR __attribute__((section("sfrs"), address(0xBF8006C0)));
extern volatile uint32_t        NVMSRCADDRCLR __attribute__((section("sfrs"),address(0xBF8006C4)));
extern volatile uint32_t        NVMSRCADDRSET __attribute__((section("sfrs"),address(0xBF8006C8)));
extern volatile uint32_t        NVMSRCADDRINV __attribute__((section("sfrs"),address(0xBF8006CC)));
#define NVMPWPLT NVMPWPLT
extern volatile uint32_t   NVMPWPLT __attribute__((section("sfrs"), address(0xBF8006D0)));
typedef struct {
  uint32_t PWPLT:24;
  uint32_t :7;
  uint32_t ULOCK:1;
} __NVMPWPLTbits_t;
extern volatile __NVMPWPLTbits_t NVMPWPLTbits __asm__ ("NVMPWPLT") __attribute__((section("sfrs"), address(0xBF8006D0)));
extern volatile uint32_t        NVMPWPLTCLR __attribute__((section("sfrs"),address(0xBF8006D4)));
extern volatile uint32_t        NVMPWPLTSET __attribute__((section("sfrs"),address(0xBF8006D8)));
extern volatile uint32_t        NVMPWPLTINV __attribute__((section("sfrs"),address(0xBF8006DC)));
#define NVMPWPGTE NVMPWPGTE
extern volatile uint32_t   NVMPWPGTE __attribute__((section("sfrs"), address(0xBF8006E0)));
typedef struct {
  uint32_t PWPGTE:24;
  uint32_t :7;
  uint32_t ULOCK:1;
} __NVMPWPGTEbits_t;
extern volatile __NVMPWPGTEbits_t NVMPWPGTEbits __asm__ ("NVMPWPGTE") __attribute__((section("sfrs"), address(0xBF8006E0)));
extern volatile uint32_t        NVMPWPGTECLR __attribute__((section("sfrs"),address(0xBF8006E4)));
extern volatile uint32_t        NVMPWPGTESET __attribute__((section("sfrs"),address(0xBF8006E8)));
extern volatile uint32_t        NVMPWPGTEINV __attribute__((section("sfrs"),address(0xBF8006EC)));
#define NVMLBWP NVMLBWP
extern volatile uint32_t   NVMLBWP __attribute__((section("sfrs"), address(0xBF8006F0)));
typedef struct {
  uint32_t LBWP0:1;
  uint32_t LBWP1:1;
  uint32_t LBWP2:1;
  uint32_t LBWP3:1;
  uint32_t LBWP4:1;
  uint32_t LBWP5:1;
  uint32_t LBWP6:1;
  uint32_t LBWP7:1;
  uint32_t LBWP8:1;
  uint32_t LBWP9:1;
  uint32_t LBWP10:1;
  uint32_t LBWP11:1;
  uint32_t LBWP12:1;
  uint32_t LBWP13:1;
  uint32_t LBWP14:1;
  uint32_t LBWP15:1;
  uint32_t LBWP16:1;
  uint32_t LBWP17:1;
  uint32_t LBWP18:1;
  uint32_t LBWP19:1;
  uint32_t LBWP20:1;
  uint32_t LBWP21:1;
  uint32_t LBWP22:1;
  uint32_t LBWP23:1;
  uint32_t :7;
  uint32_t ULOCK:1;
} __NVMLBWPbits_t;
extern volatile __NVMLBWPbits_t NVMLBWPbits __asm__ ("NVMLBWP") __attribute__((section("sfrs"), address(0xBF8006F0)));
extern volatile uint32_t        NVMLBWPCLR __attribute__((section("sfrs"),address(0xBF8006F4)));
extern volatile uint32_t        NVMLBWPSET __attribute__((section("sfrs"),address(0xBF8006F8)));
extern volatile uint32_t        NVMLBWPINV __attribute__((section("sfrs"),address(0xBF8006FC)));
#define NVMUBWP NVMUBWP
extern volatile uint32_t   NVMUBWP __attribute__((section("sfrs"), address(0xBF800700)));
typedef struct {
  uint32_t UBWP0:1;
  uint32_t UBWP1:1;
  uint32_t UBWP2:1;
  uint32_t UBWP3:1;
  uint32_t UBWP4:1;
  uint32_t UBWP5:1;
  uint32_t UBWP6:1;
  uint32_t UBWP7:1;
  uint32_t UBWP8:1;
  uint32_t UBWP9:1;
  uint32_t UBWP10:1;
  uint32_t UBWP11:1;
  uint32_t UBWP12:1;
  uint32_t UBWP13:1;
  uint32_t UBWP14:1;
  uint32_t UBWP15:1;
  uint32_t UBWP16:1;
  uint32_t UBWP17:1;
  uint32_t UBWP18:1;
  uint32_t UBWP19:1;
  uint32_t UBWP20:1;
  uint32_t UBWP21:1;
  uint32_t UBWP22:1;
  uint32_t UBWP23:1;
  uint32_t :7;
  uint32_t ULOCK:1;
} __NVMUBWPbits_t;
extern volatile __NVMUBWPbits_t NVMUBWPbits __asm__ ("NVMUBWP") __attribute__((section("sfrs"), address(0xBF800700)));
extern volatile uint32_t        NVMUBWPCLR __attribute__((section("sfrs"),address(0xBF800704)));
extern volatile uint32_t        NVMUBWPSET __attribute__((section("sfrs"),address(0xBF800708)));
extern volatile uint32_t        NVMUBWPINV __attribute__((section("sfrs"),address(0xBF80070C)));
#define WDTCON WDTCON
extern volatile uint32_t   WDTCON __attribute__((section("sfrs"), address(0xBF800800)));
typedef struct {
  uint32_t WDTWINEN:1;
  uint32_t SLPDIV:5;
  uint32_t CLKSEL:2;
  uint32_t RUNDIV:5;
  uint32_t :2;
  uint32_t ON:1;
  uint32_t WDTCLRKEY:16;
} __WDTCONbits_t;
extern volatile __WDTCONbits_t WDTCONbits __asm__ ("WDTCON") __attribute__((section("sfrs"), address(0xBF800800)));
extern volatile uint32_t        WDTCONCLR __attribute__((section("sfrs"),address(0xBF800804)));
extern volatile uint32_t        WDTCONSET __attribute__((section("sfrs"),address(0xBF800808)));
extern volatile uint32_t        WDTCONINV __attribute__((section("sfrs"),address(0xBF80080C)));
#define DMTCON DMTCON
extern volatile uint32_t   DMTCON __attribute__((section("sfrs"), address(0xBF800A00)));
typedef struct {
  uint32_t :15;
  uint32_t ON:1;
} __DMTCONbits_t;
extern volatile __DMTCONbits_t DMTCONbits __asm__ ("DMTCON") __attribute__((section("sfrs"), address(0xBF800A00)));
#define DMTPRECLR DMTPRECLR
extern volatile uint32_t   DMTPRECLR __attribute__((section("sfrs"), address(0xBF800A10)));
typedef struct {
  uint32_t :8;
  uint32_t STEP1:8;
} __DMTPRECLRbits_t;
