Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __CLKSTATbits_t CLKSTATbits __asm__ ("CLKSTAT") __attribute__((section("sfrs"), address(0xBF801390)));
extern volatile uint32_t        CLKSTATCLR __attribute__((section("sfrs"),address(0xBF801394)));
extern volatile uint32_t        CLKSTATSET __attribute__((section("sfrs"),address(0xBF801398)));
extern volatile uint32_t        CLKSTATINV __attribute__((section("sfrs"),address(0xBF80139C)));
#define OSCCONBAR OSCCONBAR
extern volatile uint32_t   OSCCONBAR __attribute__((section("sfrs"), address(0xBF8013A0)));
extern volatile uint32_t        OSCCONBARCLR __attribute__((section("sfrs"),address(0xBF8013A4)));
extern volatile uint32_t        OSCCONBARSET __attribute__((section("sfrs"),address(0xBF8013A8)));
extern volatile uint32_t        OSCCONBARINV __attribute__((section("sfrs"),address(0xBF8013AC)));
#define CLKDIAG CLKDIAG
extern volatile uint32_t   CLKDIAG __attribute__((section("sfrs"), address(0xBF8013B0)));
typedef struct {
  uint32_t POSCSTOP:1;
  uint32_t SOSCSTOP:1;
  uint32_t FRCSTOP:1;
  uint32_t LPRCSTOP:1;
  uint32_t SPLLSTOP:1;
  uint32_t UPLLSTOP:1;
  uint32_t ETHPLLSTOP:1;
} __CLKDIAGbits_t;
extern volatile __CLKDIAGbits_t CLKDIAGbits __asm__ ("CLKDIAG") __attribute__((section("sfrs"), address(0xBF8013B0)));
extern volatile uint32_t        CLKDIAGCLR __attribute__((section("sfrs"),address(0xBF8013B4)));
extern volatile uint32_t        CLKDIAGSET __attribute__((section("sfrs"),address(0xBF8013B8)));
extern volatile uint32_t        CLKDIAGINV __attribute__((section("sfrs"),address(0xBF8013BC)));
#define LVDCON LVDCON
extern volatile uint32_t   LVDCON __attribute__((section("sfrs"), address(0xBF801400)));
typedef struct {
  uint32_t LVDL:4;
  uint32_t :3;
  uint32_t DISOUT:1;
  uint32_t EVENT:1;
  uint32_t IRVST:1;
  uint32_t BGVST:1;
  uint32_t VDIR:1;
  uint32_t :1;
  uint32_t SIDL:1;
  uint32_t FRZ:1;
  uint32_t ON:1;
} __LVDCONbits_t;
extern volatile __LVDCONbits_t LVDCONbits __asm__ ("LVDCON") __attribute__((section("sfrs"), address(0xBF801400)));
#define U3MODE U3MODE
extern volatile uint32_t   U3MODE __attribute__((section("sfrs"), address(0xBF801600)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U3MODEbits_t;
extern volatile __U3MODEbits_t U3MODEbits __asm__ ("U3MODE") __attribute__((section("sfrs"), address(0xBF801600)));
extern volatile uint32_t        U3MODECLR __attribute__((section("sfrs"),address(0xBF801604)));
extern volatile uint32_t        U3MODESET __attribute__((section("sfrs"),address(0xBF801608)));
extern volatile uint32_t        U3MODEINV __attribute__((section("sfrs"),address(0xBF80160C)));
#define U3STA U3STA
extern volatile uint32_t   U3STA __attribute__((section("sfrs"), address(0xBF801610)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U3STAbits_t;
extern volatile __U3STAbits_t U3STAbits __asm__ ("U3STA") __attribute__((section("sfrs"), address(0xBF801610)));
extern volatile uint32_t        U3STACLR __attribute__((section("sfrs"),address(0xBF801614)));
extern volatile uint32_t        U3STASET __attribute__((section("sfrs"),address(0xBF801618)));
extern volatile uint32_t        U3STAINV __attribute__((section("sfrs"),address(0xBF80161C)));
#define U3TXREG U3TXREG
extern volatile uint32_t   U3TXREG __attribute__((section("sfrs"), address(0xBF801620)));
#define U3RXREG U3RXREG
extern volatile uint32_t   U3RXREG __attribute__((section("sfrs"), address(0xBF801630)));
#define U3BRG U3BRG
extern volatile uint32_t   U3BRG __attribute__((section("sfrs"), address(0xBF801640)));
typedef struct {
  uint32_t BRG:20;
} __U3BRGbits_t;
extern volatile __U3BRGbits_t U3BRGbits __asm__ ("U3BRG") __attribute__((section("sfrs"), address(0xBF801640)));
extern volatile uint32_t        U3BRGCLR __attribute__((section("sfrs"),address(0xBF801644)));
extern volatile uint32_t        U3BRGSET __attribute__((section("sfrs"),address(0xBF801648)));
extern volatile uint32_t        U3BRGINV __attribute__((section("sfrs"),address(0xBF80164C)));
#define INT0R INT0R
extern volatile uint32_t   INT0R __attribute__((section("sfrs"), address(0xBF801800)));
typedef struct {
  uint32_t INT0R:4;
} __INT0Rbits_t;
extern volatile __INT0Rbits_t INT0Rbits __asm__ ("INT0R") __attribute__((section("sfrs"), address(0xBF801800)));
#define INT1R INT1R
extern volatile uint32_t   INT1R __attribute__((section("sfrs"), address(0xBF801804)));
typedef struct {
  uint32_t INT1R:4;
} __INT1Rbits_t;
extern volatile __INT1Rbits_t INT1Rbits __asm__ ("INT1R") __attribute__((section("sfrs"), address(0xBF801804)));
#define INT2R INT2R
extern volatile uint32_t   INT2R __attribute__((section("sfrs"), address(0xBF801808)));
typedef struct {
  uint32_t INT2R:4;
} __INT2Rbits_t;
extern volatile __INT2Rbits_t INT2Rbits __asm__ ("INT2R") __attribute__((section("sfrs"), address(0xBF801808)));
#define INT3R INT3R
extern volatile uint32_t   INT3R __attribute__((section("sfrs"), address(0xBF80180C)));
typedef struct {
  uint32_t INT3R:4;
} __INT3Rbits_t;
extern volatile __INT3Rbits_t INT3Rbits __asm__ ("INT3R") __attribute__((section("sfrs"), address(0xBF80180C)));
#define INT4R INT4R
extern volatile uint32_t   INT4R __attribute__((section("sfrs"), address(0xBF801810)));
typedef struct {
  uint32_t INT4R:4;
} __INT4Rbits_t;
extern volatile __INT4Rbits_t INT4Rbits __asm__ ("INT4R") __attribute__((section("sfrs"), address(0xBF801810)));
#define T1CKR T1CKR
extern volatile uint32_t   T1CKR __attribute__((section("sfrs"), address(0xBF801814)));
typedef struct {
  uint32_t T1CKR:4;
} __T1CKRbits_t;
extern volatile __T1CKRbits_t T1CKRbits __asm__ ("T1CKR") __attribute__((section("sfrs"), address(0xBF801814)));
#define T2CKR T2CKR
extern volatile uint32_t   T2CKR __attribute__((section("sfrs"), address(0xBF801818)));
typedef struct {
  uint32_t T2CKR:4;
} __T2CKRbits_t;
extern volatile __T2CKRbits_t T2CKRbits __asm__ ("T2CKR") __attribute__((section("sfrs"), address(0xBF801818)));
#define T3CKR T3CKR
extern volatile uint32_t   T3CKR __attribute__((section("sfrs"), address(0xBF80181C)));
typedef struct {
  uint32_t T3CKR:4;
} __T3CKRbits_t;
extern volatile __T3CKRbits_t T3CKRbits __asm__ ("T3CKR") __attribute__((section("sfrs"), address(0xBF80181C)));
#define T4CKR T4CKR
extern volatile uint32_t   T4CKR __attribute__((section("sfrs"), address(0xBF801820)));
typedef struct {
  uint32_t T4CKR:4;
} __T4CKRbits_t;
extern volatile __T4CKRbits_t T4CKRbits __asm__ ("T4CKR") __attribute__((section("sfrs"), address(0xBF801820)));
#define T5CKR T5CKR
extern volatile uint32_t   T5CKR __attribute__((section("sfrs"), address(0xBF801824)));
typedef struct {
  uint32_t T5CKR:4;
} __T5CKRbits_t;
