Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __C2RXRbits_t C2RXRbits __asm__ ("C2RXR") __attribute__((section("sfrs"), address(0xBF8018C8)));
#define REFIR REFIR
extern volatile uint32_t   REFIR __attribute__((section("sfrs"), address(0xBF8018CC)));
typedef struct {
  uint32_t REFIR:4;
} __REFIRbits_t;
extern volatile __REFIRbits_t REFIRbits __asm__ ("REFIR") __attribute__((section("sfrs"), address(0xBF8018CC)));
#define ECOLR ECOLR
extern volatile uint32_t   ECOLR __attribute__((section("sfrs"), address(0xBF801974)));
typedef struct {
  uint32_t ECOLR:4;
} __ECOLRbits_t;
extern volatile __ECOLRbits_t ECOLRbits __asm__ ("ECOLR") __attribute__((section("sfrs"), address(0xBF801974)));
#define ECRSR ECRSR
extern volatile uint32_t   ECRSR __attribute__((section("sfrs"), address(0xBF801978)));
typedef struct {
  uint32_t ECRSR:4;
} __ECRSRbits_t;
extern volatile __ECRSRbits_t ECRSRbits __asm__ ("ECRSR") __attribute__((section("sfrs"), address(0xBF801978)));
#define ETXCLKR ETXCLKR
extern volatile uint32_t   ETXCLKR __attribute__((section("sfrs"), address(0xBF80197C)));
typedef struct {
  uint32_t ETXCLKR:4;
} __ETXCLKRbits_t;
extern volatile __ETXCLKRbits_t ETXCLKRbits __asm__ ("ETXCLKR") __attribute__((section("sfrs"), address(0xBF80197C)));
#define ERXD3R ERXD3R
extern volatile uint32_t   ERXD3R __attribute__((section("sfrs"), address(0xBF801980)));
typedef struct {
  uint32_t ERXD3R:4;
} __ERXD3Rbits_t;
extern volatile __ERXD3Rbits_t ERXD3Rbits __asm__ ("ERXD3R") __attribute__((section("sfrs"), address(0xBF801980)));
#define ERXD2R ERXD2R
extern volatile uint32_t   ERXD2R __attribute__((section("sfrs"), address(0xBF801984)));
typedef struct {
  uint32_t ERXD2R:4;
} __ERXD2Rbits_t;
extern volatile __ERXD2Rbits_t ERXD2Rbits __asm__ ("ERXD2R") __attribute__((section("sfrs"), address(0xBF801984)));
#define RPA0R RPA0R
extern volatile uint32_t   RPA0R __attribute__((section("sfrs"), address(0xBF801A00)));
typedef struct {
  uint32_t RPA0R:5;
} __RPA0Rbits_t;
extern volatile __RPA0Rbits_t RPA0Rbits __asm__ ("RPA0R") __attribute__((section("sfrs"), address(0xBF801A00)));
#define RPA1R RPA1R
extern volatile uint32_t   RPA1R __attribute__((section("sfrs"), address(0xBF801A04)));
typedef struct {
  uint32_t RPA1R:5;
} __RPA1Rbits_t;
extern volatile __RPA1Rbits_t RPA1Rbits __asm__ ("RPA1R") __attribute__((section("sfrs"), address(0xBF801A04)));
#define RPA2R RPA2R
extern volatile uint32_t   RPA2R __attribute__((section("sfrs"), address(0xBF801A08)));
typedef struct {
  uint32_t RPA2R:5;
} __RPA2Rbits_t;
extern volatile __RPA2Rbits_t RPA2Rbits __asm__ ("RPA2R") __attribute__((section("sfrs"), address(0xBF801A08)));
#define RPA3R RPA3R
extern volatile uint32_t   RPA3R __attribute__((section("sfrs"), address(0xBF801A0C)));
typedef struct {
  uint32_t RPA3R:5;
} __RPA3Rbits_t;
extern volatile __RPA3Rbits_t RPA3Rbits __asm__ ("RPA3R") __attribute__((section("sfrs"), address(0xBF801A0C)));
#define RPA4R RPA4R
extern volatile uint32_t   RPA4R __attribute__((section("sfrs"), address(0xBF801A10)));
typedef struct {
  uint32_t RPA4R:5;
} __RPA4Rbits_t;
extern volatile __RPA4Rbits_t RPA4Rbits __asm__ ("RPA4R") __attribute__((section("sfrs"), address(0xBF801A10)));
#define RPA5R RPA5R
extern volatile uint32_t   RPA5R __attribute__((section("sfrs"), address(0xBF801A14)));
typedef struct {
  uint32_t RPA5R:5;
} __RPA5Rbits_t;
extern volatile __RPA5Rbits_t RPA5Rbits __asm__ ("RPA5R") __attribute__((section("sfrs"), address(0xBF801A14)));
#define RPA10R RPA10R
extern volatile uint32_t   RPA10R __attribute__((section("sfrs"), address(0xBF801A28)));
typedef struct {
  uint32_t RPA10R:5;
} __RPA10Rbits_t;
extern volatile __RPA10Rbits_t RPA10Rbits __asm__ ("RPA10R") __attribute__((section("sfrs"), address(0xBF801A28)));
#define RPA11R RPA11R
extern volatile uint32_t   RPA11R __attribute__((section("sfrs"), address(0xBF801A2C)));
typedef struct {
  uint32_t RPA11R:5;
} __RPA11Rbits_t;
extern volatile __RPA11Rbits_t RPA11Rbits __asm__ ("RPA11R") __attribute__((section("sfrs"), address(0xBF801A2C)));
#define RPA12R RPA12R
extern volatile uint32_t   RPA12R __attribute__((section("sfrs"), address(0xBF801A30)));
typedef struct {
  uint32_t RPA12R:5;
} __RPA12Rbits_t;
extern volatile __RPA12Rbits_t RPA12Rbits __asm__ ("RPA12R") __attribute__((section("sfrs"), address(0xBF801A30)));
#define RPA13R RPA13R
extern volatile uint32_t   RPA13R __attribute__((section("sfrs"), address(0xBF801A34)));
typedef struct {
  uint32_t RPA13R:5;
} __RPA13Rbits_t;
extern volatile __RPA13Rbits_t RPA13Rbits __asm__ ("RPA13R") __attribute__((section("sfrs"), address(0xBF801A34)));
#define RPA14R RPA14R
extern volatile uint32_t   RPA14R __attribute__((section("sfrs"), address(0xBF801A38)));
typedef struct {
  uint32_t RPA14R:5;
} __RPA14Rbits_t;
extern volatile __RPA14Rbits_t RPA14Rbits __asm__ ("RPA14R") __attribute__((section("sfrs"), address(0xBF801A38)));
#define RPA15R RPA15R
extern volatile uint32_t   RPA15R __attribute__((section("sfrs"), address(0xBF801A3C)));
typedef struct {
  uint32_t RPA15R:5;
} __RPA15Rbits_t;
extern volatile __RPA15Rbits_t RPA15Rbits __asm__ ("RPA15R") __attribute__((section("sfrs"), address(0xBF801A3C)));
#define RPB0R RPB0R
extern volatile uint32_t   RPB0R __attribute__((section("sfrs"), address(0xBF801A40)));
typedef struct {
  uint32_t RPB0R:5;
} __RPB0Rbits_t;
extern volatile __RPB0Rbits_t RPB0Rbits __asm__ ("RPB0R") __attribute__((section("sfrs"), address(0xBF801A40)));
#define RPB1R RPB1R
extern volatile uint32_t   RPB1R __attribute__((section("sfrs"), address(0xBF801A44)));
typedef struct {
  uint32_t RPB1R:5;
} __RPB1Rbits_t;
extern volatile __RPB1Rbits_t RPB1Rbits __asm__ ("RPB1R") __attribute__((section("sfrs"), address(0xBF801A44)));
#define RPB2R RPB2R
extern volatile uint32_t   RPB2R __attribute__((section("sfrs"), address(0xBF801A48)));
typedef struct {
  uint32_t RPB2R:5;
} __RPB2Rbits_t;
extern volatile __RPB2Rbits_t RPB2Rbits __asm__ ("RPB2R") __attribute__((section("sfrs"), address(0xBF801A48)));
#define RPB3R RPB3R
extern volatile uint32_t   RPB3R __attribute__((section("sfrs"), address(0xBF801A4C)));
typedef struct {
  uint32_t RPB3R:5;
} __RPB3Rbits_t;
extern volatile __RPB3Rbits_t RPB3Rbits __asm__ ("RPB3R") __attribute__((section("sfrs"), address(0xBF801A4C)));
#define RPB4R RPB4R
extern volatile uint32_t   RPB4R __attribute__((section("sfrs"), address(0xBF801A50)));
typedef struct {
  uint32_t RPB4R:5;
} __RPB4Rbits_t;
