Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __RPB4Rbits_t RPB4Rbits __asm__ ("RPB4R") __attribute__((section("sfrs"), address(0xBF801A50)));
#define RPB5R RPB5R
extern volatile uint32_t   RPB5R __attribute__((section("sfrs"), address(0xBF801A54)));
typedef struct {
  uint32_t RPB5R:5;
} __RPB5Rbits_t;
extern volatile __RPB5Rbits_t RPB5Rbits __asm__ ("RPB5R") __attribute__((section("sfrs"), address(0xBF801A54)));
#define RPB6R RPB6R
extern volatile uint32_t   RPB6R __attribute__((section("sfrs"), address(0xBF801A58)));
typedef struct {
  uint32_t RPB6R:5;
} __RPB6Rbits_t;
extern volatile __RPB6Rbits_t RPB6Rbits __asm__ ("RPB6R") __attribute__((section("sfrs"), address(0xBF801A58)));
#define RPB7R RPB7R
extern volatile uint32_t   RPB7R __attribute__((section("sfrs"), address(0xBF801A5C)));
typedef struct {
  uint32_t RPB7R:5;
} __RPB7Rbits_t;
extern volatile __RPB7Rbits_t RPB7Rbits __asm__ ("RPB7R") __attribute__((section("sfrs"), address(0xBF801A5C)));
#define RPB8R RPB8R
extern volatile uint32_t   RPB8R __attribute__((section("sfrs"), address(0xBF801A60)));
typedef struct {
  uint32_t RPB8R:5;
} __RPB8Rbits_t;
extern volatile __RPB8Rbits_t RPB8Rbits __asm__ ("RPB8R") __attribute__((section("sfrs"), address(0xBF801A60)));
#define RPB9R RPB9R
extern volatile uint32_t   RPB9R __attribute__((section("sfrs"), address(0xBF801A64)));
typedef struct {
  uint32_t RPB9R:5;
} __RPB9Rbits_t;
extern volatile __RPB9Rbits_t RPB9Rbits __asm__ ("RPB9R") __attribute__((section("sfrs"), address(0xBF801A64)));
#define RPB10R RPB10R
extern volatile uint32_t   RPB10R __attribute__((section("sfrs"), address(0xBF801A68)));
typedef struct {
  uint32_t RPB10R:5;
} __RPB10Rbits_t;
extern volatile __RPB10Rbits_t RPB10Rbits __asm__ ("RPB10R") __attribute__((section("sfrs"), address(0xBF801A68)));
#define RPB11R RPB11R
extern volatile uint32_t   RPB11R __attribute__((section("sfrs"), address(0xBF801A6C)));
typedef struct {
  uint32_t RPB11R:5;
} __RPB11Rbits_t;
extern volatile __RPB11Rbits_t RPB11Rbits __asm__ ("RPB11R") __attribute__((section("sfrs"), address(0xBF801A6C)));
#define RPB12R RPB12R
extern volatile uint32_t   RPB12R __attribute__((section("sfrs"), address(0xBF801A70)));
typedef struct {
  uint32_t RPB12R:5;
} __RPB12Rbits_t;
extern volatile __RPB12Rbits_t RPB12Rbits __asm__ ("RPB12R") __attribute__((section("sfrs"), address(0xBF801A70)));
#define RPB13R RPB13R
extern volatile uint32_t   RPB13R __attribute__((section("sfrs"), address(0xBF801A74)));
typedef struct {
  uint32_t RPB13R:5;
} __RPB13Rbits_t;
extern volatile __RPB13Rbits_t RPB13Rbits __asm__ ("RPB13R") __attribute__((section("sfrs"), address(0xBF801A74)));
#define RPB14R RPB14R
extern volatile uint32_t   RPB14R __attribute__((section("sfrs"), address(0xBF801A78)));
typedef struct {
  uint32_t RPB14R:5;
} __RPB14Rbits_t;
extern volatile __RPB14Rbits_t RPB14Rbits __asm__ ("RPB14R") __attribute__((section("sfrs"), address(0xBF801A78)));
#define RPC0R RPC0R
extern volatile uint32_t   RPC0R __attribute__((section("sfrs"), address(0xBF801A80)));
typedef struct {
  uint32_t RPC0R:5;
} __RPC0Rbits_t;
extern volatile __RPC0Rbits_t RPC0Rbits __asm__ ("RPC0R") __attribute__((section("sfrs"), address(0xBF801A80)));
#define RPC1R RPC1R
extern volatile uint32_t   RPC1R __attribute__((section("sfrs"), address(0xBF801A84)));
typedef struct {
  uint32_t RPC1R:5;
} __RPC1Rbits_t;
extern volatile __RPC1Rbits_t RPC1Rbits __asm__ ("RPC1R") __attribute__((section("sfrs"), address(0xBF801A84)));
#define RPC2R RPC2R
extern volatile uint32_t   RPC2R __attribute__((section("sfrs"), address(0xBF801A88)));
typedef struct {
  uint32_t RPC2R:5;
} __RPC2Rbits_t;
extern volatile __RPC2Rbits_t RPC2Rbits __asm__ ("RPC2R") __attribute__((section("sfrs"), address(0xBF801A88)));
#define RPC3R RPC3R
extern volatile uint32_t   RPC3R __attribute__((section("sfrs"), address(0xBF801A8C)));
typedef struct {
  uint32_t RPC3R:5;
} __RPC3Rbits_t;
extern volatile __RPC3Rbits_t RPC3Rbits __asm__ ("RPC3R") __attribute__((section("sfrs"), address(0xBF801A8C)));
#define RPC4R RPC4R
extern volatile uint32_t   RPC4R __attribute__((section("sfrs"), address(0xBF801A90)));
typedef struct {
  uint32_t RPC4R:5;
} __RPC4Rbits_t;
extern volatile __RPC4Rbits_t RPC4Rbits __asm__ ("RPC4R") __attribute__((section("sfrs"), address(0xBF801A90)));
#define RPC5R RPC5R
extern volatile uint32_t   RPC5R __attribute__((section("sfrs"), address(0xBF801A94)));
typedef struct {
  uint32_t RPC5R:5;
} __RPC5Rbits_t;
extern volatile __RPC5Rbits_t RPC5Rbits __asm__ ("RPC5R") __attribute__((section("sfrs"), address(0xBF801A94)));
#define RPC6R RPC6R
extern volatile uint32_t   RPC6R __attribute__((section("sfrs"), address(0xBF801A98)));
typedef struct {
  uint32_t RPC6R:5;
} __RPC6Rbits_t;
extern volatile __RPC6Rbits_t RPC6Rbits __asm__ ("RPC6R") __attribute__((section("sfrs"), address(0xBF801A98)));
#define RPC7R RPC7R
extern volatile uint32_t   RPC7R __attribute__((section("sfrs"), address(0xBF801A9C)));
typedef struct {
  uint32_t RPC7R:5;
} __RPC7Rbits_t;
extern volatile __RPC7Rbits_t RPC7Rbits __asm__ ("RPC7R") __attribute__((section("sfrs"), address(0xBF801A9C)));
#define RPC8R RPC8R
extern volatile uint32_t   RPC8R __attribute__((section("sfrs"), address(0xBF801AA0)));
typedef struct {
  uint32_t RPC8R:5;
} __RPC8Rbits_t;
extern volatile __RPC8Rbits_t RPC8Rbits __asm__ ("RPC8R") __attribute__((section("sfrs"), address(0xBF801AA0)));
#define RPC9R RPC9R
extern volatile uint32_t   RPC9R __attribute__((section("sfrs"), address(0xBF801AA4)));
typedef struct {
  uint32_t RPC9R:5;
} __RPC9Rbits_t;
extern volatile __RPC9Rbits_t RPC9Rbits __asm__ ("RPC9R") __attribute__((section("sfrs"), address(0xBF801AA4)));
#define RPC10R RPC10R
extern volatile uint32_t   RPC10R __attribute__((section("sfrs"), address(0xBF801AA8)));
typedef struct {
  uint32_t RPC10R:5;
} __RPC10Rbits_t;
extern volatile __RPC10Rbits_t RPC10Rbits __asm__ ("RPC10R") __attribute__((section("sfrs"), address(0xBF801AA8)));
#define RPC11R RPC11R
extern volatile uint32_t   RPC11R __attribute__((section("sfrs"), address(0xBF801AAC)));
typedef struct {
  uint32_t RPC11R:5;
} __RPC11Rbits_t;
extern volatile __RPC11Rbits_t RPC11Rbits __asm__ ("RPC11R") __attribute__((section("sfrs"), address(0xBF801AAC)));
#define RPC12R RPC12R
extern volatile uint32_t   RPC12R __attribute__((section("sfrs"), address(0xBF801AB0)));
typedef struct {
  uint32_t RPC12R:5;
} __RPC12Rbits_t;
extern volatile __RPC12Rbits_t RPC12Rbits __asm__ ("RPC12R") __attribute__((section("sfrs"), address(0xBF801AB0)));
#define RPC13R RPC13R
extern volatile uint32_t   RPC13R __attribute__((section("sfrs"), address(0xBF801AB4)));
typedef struct {
  uint32_t RPC13R:5;
} __RPC13Rbits_t;
extern volatile __RPC13Rbits_t RPC13Rbits __asm__ ("RPC13R") __attribute__((section("sfrs"), address(0xBF801AB4)));
#define RPC14R RPC14R
extern volatile uint32_t   RPC14R __attribute__((section("sfrs"), address(0xBF801AB8)));
typedef struct {
  uint32_t RPC14R:5;
} __RPC14Rbits_t;
