Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __RPC14Rbits_t RPC14Rbits __asm__ ("RPC14R") __attribute__((section("sfrs"), address(0xBF801AB8)));
#define RPC15R RPC15R
extern volatile uint32_t   RPC15R __attribute__((section("sfrs"), address(0xBF801ABC)));
typedef struct {
  uint32_t RPC15R:5;
} __RPC15Rbits_t;
extern volatile __RPC15Rbits_t RPC15Rbits __asm__ ("RPC15R") __attribute__((section("sfrs"), address(0xBF801ABC)));
#define RPK0R RPK0R
extern volatile uint32_t   RPK0R __attribute__((section("sfrs"), address(0xBF801AC0)));
typedef struct {
  uint32_t RPK0R:5;
} __RPK0Rbits_t;
extern volatile __RPK0Rbits_t RPK0Rbits __asm__ ("RPK0R") __attribute__((section("sfrs"), address(0xBF801AC0)));
#define RPK1R RPK1R
extern volatile uint32_t   RPK1R __attribute__((section("sfrs"), address(0xBF801AC4)));
typedef struct {
  uint32_t RPK1R:5;
} __RPK1Rbits_t;
extern volatile __RPK1Rbits_t RPK1Rbits __asm__ ("RPK1R") __attribute__((section("sfrs"), address(0xBF801AC4)));
#define RPK2R RPK2R
extern volatile uint32_t   RPK2R __attribute__((section("sfrs"), address(0xBF801AC8)));
typedef struct {
  uint32_t RPK2R:5;
} __RPK2Rbits_t;
extern volatile __RPK2Rbits_t RPK2Rbits __asm__ ("RPK2R") __attribute__((section("sfrs"), address(0xBF801AC8)));
#define RPK3R RPK3R
extern volatile uint32_t   RPK3R __attribute__((section("sfrs"), address(0xBF801ACC)));
typedef struct {
  uint32_t RPK3R:5;
} __RPK3Rbits_t;
extern volatile __RPK3Rbits_t RPK3Rbits __asm__ ("RPK3R") __attribute__((section("sfrs"), address(0xBF801ACC)));
#define RPK4R RPK4R
extern volatile uint32_t   RPK4R __attribute__((section("sfrs"), address(0xBF801AD0)));
typedef struct {
  uint32_t RPK4R:5;
} __RPK4Rbits_t;
extern volatile __RPK4Rbits_t RPK4Rbits __asm__ ("RPK4R") __attribute__((section("sfrs"), address(0xBF801AD0)));
#define RPK5R RPK5R
extern volatile uint32_t   RPK5R __attribute__((section("sfrs"), address(0xBF801AD4)));
typedef struct {
  uint32_t RPK5R:5;
} __RPK5Rbits_t;
extern volatile __RPK5Rbits_t RPK5Rbits __asm__ ("RPK5R") __attribute__((section("sfrs"), address(0xBF801AD4)));
#define RPK6R RPK6R
extern volatile uint32_t   RPK6R __attribute__((section("sfrs"), address(0xBF801AD8)));
typedef struct {
  uint32_t RPK6R:5;
} __RPK6Rbits_t;
extern volatile __RPK6Rbits_t RPK6Rbits __asm__ ("RPK6R") __attribute__((section("sfrs"), address(0xBF801AD8)));
#define RPK7R RPK7R
extern volatile uint32_t   RPK7R __attribute__((section("sfrs"), address(0xBF801ADC)));
typedef struct {
  uint32_t RPK7R:5;
} __RPK7Rbits_t;
extern volatile __RPK7Rbits_t RPK7Rbits __asm__ ("RPK7R") __attribute__((section("sfrs"), address(0xBF801ADC)));
#define RPK8R RPK8R
extern volatile uint32_t   RPK8R __attribute__((section("sfrs"), address(0xBF801AE0)));
typedef struct {
  uint32_t RPK8R:5;
} __RPK8Rbits_t;
extern volatile __RPK8Rbits_t RPK8Rbits __asm__ ("RPK8R") __attribute__((section("sfrs"), address(0xBF801AE0)));
#define RPK9R RPK9R
extern volatile uint32_t   RPK9R __attribute__((section("sfrs"), address(0xBF801AE4)));
typedef struct {
  uint32_t RPK9R:5;
} __RPK9Rbits_t;
extern volatile __RPK9Rbits_t RPK9Rbits __asm__ ("RPK9R") __attribute__((section("sfrs"), address(0xBF801AE4)));
#define RPK10R RPK10R
extern volatile uint32_t   RPK10R __attribute__((section("sfrs"), address(0xBF801AE8)));
typedef struct {
  uint32_t RPK10R:5;
} __RPK10Rbits_t;
extern volatile __RPK10Rbits_t RPK10Rbits __asm__ ("RPK10R") __attribute__((section("sfrs"), address(0xBF801AE8)));
#define RPK11R RPK11R
extern volatile uint32_t   RPK11R __attribute__((section("sfrs"), address(0xBF801AEC)));
typedef struct {
  uint32_t RPK11R:5;
} __RPK11Rbits_t;
extern volatile __RPK11Rbits_t RPK11Rbits __asm__ ("RPK11R") __attribute__((section("sfrs"), address(0xBF801AEC)));
#define RPK12R RPK12R
extern volatile uint32_t   RPK12R __attribute__((section("sfrs"), address(0xBF801AF0)));
typedef struct {
  uint32_t RPK12R:5;
} __RPK12Rbits_t;
extern volatile __RPK12Rbits_t RPK12Rbits __asm__ ("RPK12R") __attribute__((section("sfrs"), address(0xBF801AF0)));
#define RPK13R RPK13R
extern volatile uint32_t   RPK13R __attribute__((section("sfrs"), address(0xBF801AF4)));
typedef struct {
  uint32_t RPK13R:5;
} __RPK13Rbits_t;
extern volatile __RPK13Rbits_t RPK13Rbits __asm__ ("RPK13R") __attribute__((section("sfrs"), address(0xBF801AF4)));
#define RPK14R RPK14R
extern volatile uint32_t   RPK14R __attribute__((section("sfrs"), address(0xBF801AF8)));
typedef struct {
  uint32_t RPK14R:5;
} __RPK14Rbits_t;
extern volatile __RPK14Rbits_t RPK14Rbits __asm__ ("RPK14R") __attribute__((section("sfrs"), address(0xBF801AF8)));
#define PTGCON PTGCON
extern volatile uint32_t   PTGCON __attribute__((section("sfrs"), address(0xBF801C00)));
typedef struct {
  uint32_t PTGITM:2;
  uint32_t :3;
  uint32_t PTGBUSY:1;
  uint32_t PTGWDTO:1;
  uint32_t PTGSTRT:1;
  uint32_t PTGIVIS:1;
  uint32_t PTGSSEN:1;
  uint32_t PTGSWT:1;
  uint32_t RESERVED:1;
  uint32_t PTGTOGL:1;
  uint32_t PTGSIDL:1;
  uint32_t PTGFRZ:1;
  uint32_t PTGON:1;
  uint32_t PTGWDT:3;
  uint32_t :1;
  uint32_t PTGPWD:4;
  uint32_t PTGDIV:5;
  uint32_t PTGCLK:3;
} __PTGCONbits_t;
extern volatile __PTGCONbits_t PTGCONbits __asm__ ("PTGCON") __attribute__((section("sfrs"), address(0xBF801C00)));
extern volatile uint32_t        PTGCONCLR __attribute__((section("sfrs"),address(0xBF801C04)));
extern volatile uint32_t        PTGCONSET __attribute__((section("sfrs"),address(0xBF801C08)));
extern volatile uint32_t        PTGCONINV __attribute__((section("sfrs"),address(0xBF801C0C)));
#define PTGBTE PTGBTE
extern volatile uint32_t   PTGBTE __attribute__((section("sfrs"), address(0xBF801C10)));
typedef struct {
  uint32_t PTGBTE:32;
} __PTGBTEbits_t;
extern volatile __PTGBTEbits_t PTGBTEbits __asm__ ("PTGBTE") __attribute__((section("sfrs"), address(0xBF801C10)));
extern volatile uint32_t        PTGBTECLR __attribute__((section("sfrs"),address(0xBF801C14)));
extern volatile uint32_t        PTGBTESET __attribute__((section("sfrs"),address(0xBF801C18)));
extern volatile uint32_t        PTGBTEINV __attribute__((section("sfrs"),address(0xBF801C1C)));
#define PTGHOLD PTGHOLD
extern volatile uint32_t   PTGHOLD __attribute__((section("sfrs"), address(0xBF801C20)));
typedef struct {
  uint32_t PTGHOLD:16;
} __PTGHOLDbits_t;
extern volatile __PTGHOLDbits_t PTGHOLDbits __asm__ ("PTGHOLD") __attribute__((section("sfrs"), address(0xBF801C20)));
extern volatile uint32_t        PTGHOLDCLR __attribute__((section("sfrs"),address(0xBF801C24)));
extern volatile uint32_t        PTGHOLDSET __attribute__((section("sfrs"),address(0xBF801C28)));
extern volatile uint32_t        PTGHOLDINV __attribute__((section("sfrs"),address(0xBF801C2C)));
#define PTGT0LIM PTGT0LIM
extern volatile uint32_t   PTGT0LIM __attribute__((section("sfrs"), address(0xBF801C30)));
typedef struct {
  uint32_t PTGT0LIM:16;
} __PTGT0LIMbits_t;
extern volatile __PTGT0LIMbits_t PTGT0LIMbits __asm__ ("PTGT0LIM") __attribute__((section("sfrs"), address(0xBF801C30)));
extern volatile uint32_t        PTGT0LIMCLR __attribute__((section("sfrs"),address(0xBF801C34)));
extern volatile uint32_t        PTGT0LIMSET __attribute__((section("sfrs"),address(0xBF801C38)));
extern volatile uint32_t        PTGT0LIMINV __attribute__((section("sfrs"),address(0xBF801C3C)));
#define PTGT1LIM PTGT1LIM
extern volatile uint32_t   PTGT1LIM __attribute__((section("sfrs"), address(0xBF801C40)));
typedef struct {
  uint32_t PTGT1LIM:16;
} __PTGT1LIMbits_t;
