Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __PTGT1LIMbits_t PTGT1LIMbits __asm__ ("PTGT1LIM") __attribute__((section("sfrs"), address(0xBF801C40)));
extern volatile uint32_t        PTGT1LIMCLR __attribute__((section("sfrs"),address(0xBF801C44)));
extern volatile uint32_t        PTGT1LIMSET __attribute__((section("sfrs"),address(0xBF801C48)));
extern volatile uint32_t        PTGT1LIMINV __attribute__((section("sfrs"),address(0xBF801C4C)));
#define PTGSDLIM PTGSDLIM
extern volatile uint32_t   PTGSDLIM __attribute__((section("sfrs"), address(0xBF801C50)));
typedef struct {
  uint32_t PTGSDLIM:16;
} __PTGSDLIMbits_t;
extern volatile __PTGSDLIMbits_t PTGSDLIMbits __asm__ ("PTGSDLIM") __attribute__((section("sfrs"), address(0xBF801C50)));
extern volatile uint32_t        PTGSDLIMCLR __attribute__((section("sfrs"),address(0xBF801C54)));
extern volatile uint32_t        PTGSDLIMSET __attribute__((section("sfrs"),address(0xBF801C58)));
extern volatile uint32_t        PTGSDLIMINV __attribute__((section("sfrs"),address(0xBF801C5C)));
#define PTGC0LIM PTGC0LIM
extern volatile uint32_t   PTGC0LIM __attribute__((section("sfrs"), address(0xBF801C60)));
typedef struct {
  uint32_t PTGC0LIM:16;
} __PTGC0LIMbits_t;
extern volatile __PTGC0LIMbits_t PTGC0LIMbits __asm__ ("PTGC0LIM") __attribute__((section("sfrs"), address(0xBF801C60)));
extern volatile uint32_t        PTGC0LIMCLR __attribute__((section("sfrs"),address(0xBF801C64)));
extern volatile uint32_t        PTGC0LIMSET __attribute__((section("sfrs"),address(0xBF801C68)));
extern volatile uint32_t        PTGC0LIMINV __attribute__((section("sfrs"),address(0xBF801C6C)));
#define PTGC1LIM PTGC1LIM
extern volatile uint32_t   PTGC1LIM __attribute__((section("sfrs"), address(0xBF801C70)));
typedef struct {
  uint32_t PTGC1LIM:16;
} __PTGC1LIMbits_t;
extern volatile __PTGC1LIMbits_t PTGC1LIMbits __asm__ ("PTGC1LIM") __attribute__((section("sfrs"), address(0xBF801C70)));
extern volatile uint32_t        PTGC1LIMCLR __attribute__((section("sfrs"),address(0xBF801C74)));
extern volatile uint32_t        PTGC1LIMSET __attribute__((section("sfrs"),address(0xBF801C78)));
extern volatile uint32_t        PTGC1LIMINV __attribute__((section("sfrs"),address(0xBF801C7C)));
#define PTGADJ PTGADJ
extern volatile uint32_t   PTGADJ __attribute__((section("sfrs"), address(0xBF801C80)));
typedef struct {
  uint32_t PTGADJ:16;
} __PTGADJbits_t;
extern volatile __PTGADJbits_t PTGADJbits __asm__ ("PTGADJ") __attribute__((section("sfrs"), address(0xBF801C80)));
extern volatile uint32_t        PTGADJCLR __attribute__((section("sfrs"),address(0xBF801C84)));
extern volatile uint32_t        PTGADJSET __attribute__((section("sfrs"),address(0xBF801C88)));
extern volatile uint32_t        PTGADJINV __attribute__((section("sfrs"),address(0xBF801C8C)));
#define PTGL0 PTGL0
extern volatile uint32_t   PTGL0 __attribute__((section("sfrs"), address(0xBF801C90)));
typedef struct {
  uint32_t PTGL0:16;
} __PTGL0bits_t;
extern volatile __PTGL0bits_t PTGL0bits __asm__ ("PTGL0") __attribute__((section("sfrs"), address(0xBF801C90)));
extern volatile uint32_t        PTGL0CLR __attribute__((section("sfrs"),address(0xBF801C94)));
extern volatile uint32_t        PTGL0SET __attribute__((section("sfrs"),address(0xBF801C98)));
extern volatile uint32_t        PTGL0INV __attribute__((section("sfrs"),address(0xBF801C9C)));
#define PTGQPTR PTGQPTR
extern volatile uint32_t   PTGQPTR __attribute__((section("sfrs"), address(0xBF801CA0)));
typedef struct {
  uint32_t PTGQPTR:5;
} __PTGQPTRbits_t;
extern volatile __PTGQPTRbits_t PTGQPTRbits __asm__ ("PTGQPTR") __attribute__((section("sfrs"), address(0xBF801CA0)));
extern volatile uint32_t        PTGQPTRCLR __attribute__((section("sfrs"),address(0xBF801CA4)));
extern volatile uint32_t        PTGQPTRSET __attribute__((section("sfrs"),address(0xBF801CA8)));
extern volatile uint32_t        PTGQPTRINV __attribute__((section("sfrs"),address(0xBF801CAC)));
#define PTGQUE0 PTGQUE0
extern volatile uint32_t   PTGQUE0 __attribute__((section("sfrs"), address(0xBF801CC0)));
typedef struct {
  uint32_t STEP0:8;
  uint32_t STEP1:8;
  uint32_t STEP2:8;
  uint32_t STEP3:8;
} __PTGQUE0bits_t;
extern volatile __PTGQUE0bits_t PTGQUE0bits __asm__ ("PTGQUE0") __attribute__((section("sfrs"), address(0xBF801CC0)));
extern volatile uint32_t        PTGQUE0CLR __attribute__((section("sfrs"),address(0xBF801CC4)));
extern volatile uint32_t        PTGQUE0SET __attribute__((section("sfrs"),address(0xBF801CC8)));
extern volatile uint32_t        PTGQUE0INV __attribute__((section("sfrs"),address(0xBF801CCC)));
#define PTGQUE1 PTGQUE1
extern volatile uint32_t   PTGQUE1 __attribute__((section("sfrs"), address(0xBF801CD0)));
typedef struct {
  uint32_t STEP4:8;
  uint32_t STEP5:8;
  uint32_t STEP6:8;
  uint32_t STEP7:8;
} __PTGQUE1bits_t;
extern volatile __PTGQUE1bits_t PTGQUE1bits __asm__ ("PTGQUE1") __attribute__((section("sfrs"), address(0xBF801CD0)));
extern volatile uint32_t        PTGQUE1CLR __attribute__((section("sfrs"),address(0xBF801CD4)));
extern volatile uint32_t        PTGQUE1SET __attribute__((section("sfrs"),address(0xBF801CD8)));
extern volatile uint32_t        PTGQUE1INV __attribute__((section("sfrs"),address(0xBF801CDC)));
#define PTGQUE2 PTGQUE2
extern volatile uint32_t   PTGQUE2 __attribute__((section("sfrs"), address(0xBF801CE0)));
typedef struct {
  uint32_t STEP8:8;
  uint32_t STEP9:8;
  uint32_t STEP10:8;
  uint32_t STEP11:8;
} __PTGQUE2bits_t;
extern volatile __PTGQUE2bits_t PTGQUE2bits __asm__ ("PTGQUE2") __attribute__((section("sfrs"), address(0xBF801CE0)));
extern volatile uint32_t        PTGQUE2CLR __attribute__((section("sfrs"),address(0xBF801CE4)));
extern volatile uint32_t        PTGQUE2SET __attribute__((section("sfrs"),address(0xBF801CE8)));
extern volatile uint32_t        PTGQUE2INV __attribute__((section("sfrs"),address(0xBF801CEC)));
#define PTGQUE3 PTGQUE3
extern volatile uint32_t   PTGQUE3 __attribute__((section("sfrs"), address(0xBF801CF0)));
typedef struct {
  uint32_t STEP12:8;
  uint32_t STEP13:8;
  uint32_t STEP14:8;
  uint32_t STEP15:8;
} __PTGQUE3bits_t;
extern volatile __PTGQUE3bits_t PTGQUE3bits __asm__ ("PTGQUE3") __attribute__((section("sfrs"), address(0xBF801CF0)));
extern volatile uint32_t        PTGQUE3CLR __attribute__((section("sfrs"),address(0xBF801CF4)));
extern volatile uint32_t        PTGQUE3SET __attribute__((section("sfrs"),address(0xBF801CF8)));
extern volatile uint32_t        PTGQUE3INV __attribute__((section("sfrs"),address(0xBF801CFC)));
#define PTGQUE4 PTGQUE4
extern volatile uint32_t   PTGQUE4 __attribute__((section("sfrs"), address(0xBF801D00)));
typedef struct {
  uint32_t STEP16:8;
  uint32_t STEP17:8;
  uint32_t STEP18:8;
  uint32_t STEP19:8;
} __PTGQUE4bits_t;
extern volatile __PTGQUE4bits_t PTGQUE4bits __asm__ ("PTGQUE4") __attribute__((section("sfrs"), address(0xBF801D00)));
extern volatile uint32_t        PTGQUE4CLR __attribute__((section("sfrs"),address(0xBF801D04)));
extern volatile uint32_t        PTGQUE4SET __attribute__((section("sfrs"),address(0xBF801D08)));
extern volatile uint32_t        PTGQUE4INV __attribute__((section("sfrs"),address(0xBF801D0C)));
#define PTGQUE5 PTGQUE5
extern volatile uint32_t   PTGQUE5 __attribute__((section("sfrs"), address(0xBF801D10)));
typedef struct {
  uint32_t STEP20:8;
  uint32_t STEP21:8;
  uint32_t STEP22:8;
  uint32_t STEP23:8;
} __PTGQUE5bits_t;
