Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __T6CONbits_t T6CONbits __asm__ ("T6CON") __attribute__((section("sfrs"), address(0xBF802A00)));
extern volatile uint32_t        T6CONCLR __attribute__((section("sfrs"),address(0xBF802A04)));
extern volatile uint32_t        T6CONSET __attribute__((section("sfrs"),address(0xBF802A08)));
extern volatile uint32_t        T6CONINV __attribute__((section("sfrs"),address(0xBF802A0C)));
#define TMR6 TMR6
extern volatile uint32_t   TMR6 __attribute__((section("sfrs"), address(0xBF802A10)));
extern volatile uint32_t        TMR6CLR __attribute__((section("sfrs"),address(0xBF802A14)));
extern volatile uint32_t        TMR6SET __attribute__((section("sfrs"),address(0xBF802A18)));
extern volatile uint32_t        TMR6INV __attribute__((section("sfrs"),address(0xBF802A1C)));
#define PR6 PR6
extern volatile uint32_t   PR6 __attribute__((section("sfrs"), address(0xBF802A20)));
extern volatile uint32_t        PR6CLR __attribute__((section("sfrs"),address(0xBF802A24)));
extern volatile uint32_t        PR6SET __attribute__((section("sfrs"),address(0xBF802A28)));
extern volatile uint32_t        PR6INV __attribute__((section("sfrs"),address(0xBF802A2C)));
#define T7CON T7CON
extern volatile uint32_t   T7CON __attribute__((section("sfrs"), address(0xBF802C00)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TCS:1;
    uint32_t :2;
    uint32_t TCKPS:3;
    uint32_t TGATE:1;
    uint32_t :5;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :4;
    uint32_t TCKPS0:1;
    uint32_t TCKPS1:1;
    uint32_t TCKPS2:1;
  };
  struct {
    uint32_t :13;
    uint32_t TSIDL:1;
    uint32_t :1;
    uint32_t TON:1;
  };
  struct {
    uint32_t w:32;
  };
} __T7CONbits_t;
extern volatile __T7CONbits_t T7CONbits __asm__ ("T7CON") __attribute__((section("sfrs"), address(0xBF802C00)));
extern volatile uint32_t        T7CONCLR __attribute__((section("sfrs"),address(0xBF802C04)));
extern volatile uint32_t        T7CONSET __attribute__((section("sfrs"),address(0xBF802C08)));
extern volatile uint32_t        T7CONINV __attribute__((section("sfrs"),address(0xBF802C0C)));
#define TMR7 TMR7
extern volatile uint32_t   TMR7 __attribute__((section("sfrs"), address(0xBF802C10)));
extern volatile uint32_t        TMR7CLR __attribute__((section("sfrs"),address(0xBF802C14)));
extern volatile uint32_t        TMR7SET __attribute__((section("sfrs"),address(0xBF802C18)));
extern volatile uint32_t        TMR7INV __attribute__((section("sfrs"),address(0xBF802C1C)));
#define PR7 PR7
extern volatile uint32_t   PR7 __attribute__((section("sfrs"), address(0xBF802C20)));
extern volatile uint32_t        PR7CLR __attribute__((section("sfrs"),address(0xBF802C24)));
extern volatile uint32_t        PR7SET __attribute__((section("sfrs"),address(0xBF802C28)));
extern volatile uint32_t        PR7INV __attribute__((section("sfrs"),address(0xBF802C2C)));
#define INTCON INTCON
extern volatile uint32_t   INTCON __attribute__((section("sfrs"), address(0xBF810000)));
typedef struct {
  uint32_t INT0EP:1;
  uint32_t INT1EP:1;
  uint32_t INT2EP:1;
  uint32_t INT3EP:1;
  uint32_t INT4EP:1;
  uint32_t :3;
  uint32_t TPC:3;
  uint32_t :1;
  uint32_t MVEC:1;
  uint32_t :11;
  uint32_t NMIKEY:8;
} __INTCONbits_t;
extern volatile __INTCONbits_t INTCONbits __asm__ ("INTCON") __attribute__((section("sfrs"), address(0xBF810000)));
extern volatile uint32_t        INTCONCLR __attribute__((section("sfrs"),address(0xBF810004)));
extern volatile uint32_t        INTCONSET __attribute__((section("sfrs"),address(0xBF810008)));
extern volatile uint32_t        INTCONINV __attribute__((section("sfrs"),address(0xBF81000C)));
#define PRISS PRISS
extern volatile uint32_t   PRISS __attribute__((section("sfrs"), address(0xBF810010)));
typedef struct {
  uint32_t SS0:1;
  uint32_t :3;
  uint32_t PRI1SS:4;
  uint32_t PRI2SS:4;
  uint32_t PRI3SS:4;
  uint32_t PRI4SS:4;
  uint32_t PRI5SS:4;
  uint32_t PRI6SS:4;
  uint32_t PRI7SS:4;
} __PRISSbits_t;
extern volatile __PRISSbits_t PRISSbits __asm__ ("PRISS") __attribute__((section("sfrs"), address(0xBF810010)));
extern volatile uint32_t        PRISSCLR __attribute__((section("sfrs"),address(0xBF810014)));
extern volatile uint32_t        PRISSSET __attribute__((section("sfrs"),address(0xBF810018)));
extern volatile uint32_t        PRISSINV __attribute__((section("sfrs"),address(0xBF81001C)));
#define INTSTAT INTSTAT
extern volatile uint32_t   INTSTAT __attribute__((section("sfrs"), address(0xBF810020)));
typedef struct {
  uint32_t SIRQ:8;
  uint32_t SRIPL:3;
} __INTSTATbits_t;
extern volatile __INTSTATbits_t INTSTATbits __asm__ ("INTSTAT") __attribute__((section("sfrs"), address(0xBF810020)));
extern volatile uint32_t        INTSTATCLR __attribute__((section("sfrs"),address(0xBF810024)));
extern volatile uint32_t        INTSTATSET __attribute__((section("sfrs"),address(0xBF810028)));
extern volatile uint32_t        INTSTATINV __attribute__((section("sfrs"),address(0xBF81002C)));
#define IPTMR IPTMR
extern volatile uint32_t   IPTMR __attribute__((section("sfrs"), address(0xBF810030)));
typedef struct {
  uint32_t IPTMR:32;
} __IPTMRbits_t;
extern volatile __IPTMRbits_t IPTMRbits __asm__ ("IPTMR") __attribute__((section("sfrs"), address(0xBF810030)));
extern volatile uint32_t        IPTMRCLR __attribute__((section("sfrs"),address(0xBF810034)));
extern volatile uint32_t        IPTMRSET __attribute__((section("sfrs"),address(0xBF810038)));
extern volatile uint32_t        IPTMRINV __attribute__((section("sfrs"),address(0xBF81003C)));
#define IFS0 IFS0
extern volatile uint32_t   IFS0 __attribute__((section("sfrs"), address(0xBF810040)));
typedef struct {
  uint32_t CTIF:1;
  uint32_t CS0IF:1;
  uint32_t CS1IF:1;
  uint32_t INT0IF:1;
  uint32_t T1IF:1;
  uint32_t IC1EIF:1;
  uint32_t IC1IF:1;
  uint32_t OC1IF:1;
  uint32_t INT1IF:1;
  uint32_t T2IF:1;
  uint32_t IC2EIF:1;
  uint32_t IC2IF:1;
  uint32_t OC2IF:1;
  uint32_t INT2IF:1;
  uint32_t T3IF:1;
  uint32_t IC3EIF:1;
  uint32_t IC3IF:1;
  uint32_t OC3IF:1;
  uint32_t INT3IF:1;
  uint32_t T4IF:1;
  uint32_t IC4EIF:1;
  uint32_t IC4IF:1;
  uint32_t OC4IF:1;
  uint32_t INT4IF:1;
  uint32_t T5IF:1;
  uint32_t :5;
  uint32_t FCEIF:1;
  uint32_t PREIF:1;
} __IFS0bits_t;
extern volatile __IFS0bits_t IFS0bits __asm__ ("IFS0") __attribute__((section("sfrs"), address(0xBF810040)));
extern volatile uint32_t        IFS0CLR __attribute__((section("sfrs"),address(0xBF810044)));
extern volatile uint32_t        IFS0SET __attribute__((section("sfrs"),address(0xBF810048)));
extern volatile uint32_t        IFS0INV __attribute__((section("sfrs"),address(0xBF81004C)));
#define IFS1 IFS1
extern volatile uint32_t   IFS1 __attribute__((section("sfrs"), address(0xBF810050)));
typedef struct {
  uint32_t PFWCRCIF:1;
  uint32_t RTCCIF:1;
  uint32_t USBIF:1;
  uint32_t SPI1EIF:1;
  uint32_t SPI1RXIF:1;
  uint32_t SPI1TXIF:1;
  uint32_t U1EIF:1;
  uint32_t U1RXIF:1;
  uint32_t U1TXIF:1;
  uint32_t I2C1BIF:1;
  uint32_t I2C1SIF:1;
  uint32_t I2C1MIF:1;
  uint32_t CNAIF:1;
  uint32_t CNBIF:1;
  uint32_t CNCIF:1;
  uint32_t CNKIF:1;
  uint32_t :5;
  uint32_t SPI2EIF:1;
  uint32_t SPI2RXIF:1;
  uint32_t SPI2TXIF:1;
  uint32_t U2EIF:1;
  uint32_t U2RXIF:1;
  uint32_t U2TXIF:1;
  uint32_t I2C2BIF:1;
  uint32_t I2C2SIF:1;
  uint32_t I2C2MIF:1;
  uint32_t U3EIF:1;
  uint32_t U3RXIF:1;
} __IFS1bits_t;
extern volatile __IFS1bits_t IFS1bits __asm__ ("IFS1") __attribute__((section("sfrs"), address(0xBF810050)));
extern volatile uint32_t        IFS1CLR __attribute__((section("sfrs"),address(0xBF810054)));
extern volatile uint32_t        IFS1SET __attribute__((section("sfrs"),address(0xBF810058)));
extern volatile uint32_t        IFS1INV __attribute__((section("sfrs"),address(0xBF81005C)));
#define IFS2 IFS2
extern volatile uint32_t   IFS2 __attribute__((section("sfrs"), address(0xBF810060)));
typedef struct {
  uint32_t U3TXIF:1;
  uint32_t :3;
  uint32_t DMA0IF:1;
  uint32_t DMA1IF:1;
  uint32_t DMA2IF:1;
  uint32_t DMA3IF:1;
  uint32_t DMA4IF:1;
  uint32_t DMA5IF:1;
  uint32_t DMA6IF:1;
  uint32_t DMA7IF:1;
  uint32_t T6IF:1;
  uint32_t :3;
  uint32_t T7IF:1;
  uint32_t :2;
  uint32_t RFSMCIF:1;
  uint32_t RFMACIF:1;
  uint32_t CTR1EVIF:1;
  uint32_t RFTM0IF:1;
  uint32_t RFTM1IF:1;
  uint32_t RFTM2IF:1;
  uint32_t RFTM3IF:1;
  uint32_t CTR1TRGIF:1;
  uint32_t RFWCOEIF:1;
  uint32_t ADCIF:1;
  uint32_t :1;
  uint32_t ADCDC1IF:1;
  uint32_t ADCDC2IF:1;
} __IFS2bits_t;
