Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __IFS2bits_t IFS2bits __asm__ ("IFS2") __attribute__((section("sfrs"), address(0xBF810060)));
extern volatile uint32_t        IFS2CLR __attribute__((section("sfrs"),address(0xBF810064)));
extern volatile uint32_t        IFS2SET __attribute__((section("sfrs"),address(0xBF810068)));
extern volatile uint32_t        IFS2INV __attribute__((section("sfrs"),address(0xBF81006C)));
#define IFS3 IFS3
extern volatile uint32_t   IFS3 __attribute__((section("sfrs"), address(0xBF810070)));
typedef struct {
  uint32_t ADCDF1IF:1;
  uint32_t ADCDF2IF:1;
  uint32_t :2;
  uint32_t ADCFLTIF:1;
  uint32_t ADCEOSIF:1;
  uint32_t ADCARDYIF:1;
  uint32_t ADCURDYIF:1;
  uint32_t ADCFCBTIF:1;
  uint32_t :1;
  uint32_t ADCD0IF:1;
  uint32_t ADCD1IF:1;
  uint32_t ADCD2IF:1;
  uint32_t ADCD3IF:1;
  uint32_t ADCD4IF:1;
  uint32_t ADCD5IF:1;
  uint32_t ADCD6IF:1;
  uint32_t ADCD7IF:1;
  uint32_t ADCD8IF:1;
  uint32_t ADCD9IF:1;
  uint32_t ADCD10IF:1;
  uint32_t ADCD11IF:1;
  uint32_t ADCD12IF:1;
  uint32_t ADCD13IF:1;
  uint32_t ADCD14IF:1;
  uint32_t ADCD15IF:1;
  uint32_t ADCD16IF:1;
  uint32_t ADCD17IF:1;
  uint32_t ADCD18IF:1;
  uint32_t ADCD19IF:1;
  uint32_t ADCD20IF:1;
  uint32_t ADCD21IF:1;
} __IFS3bits_t;
extern volatile __IFS3bits_t IFS3bits __asm__ ("IFS3") __attribute__((section("sfrs"), address(0xBF810070)));
extern volatile uint32_t        IFS3CLR __attribute__((section("sfrs"),address(0xBF810074)));
extern volatile uint32_t        IFS3SET __attribute__((section("sfrs"),address(0xBF810078)));
extern volatile uint32_t        IFS3INV __attribute__((section("sfrs"),address(0xBF81007C)));
#define IFS4 IFS4
extern volatile uint32_t   IFS4 __attribute__((section("sfrs"), address(0xBF810080)));
typedef struct {
  uint32_t ADCD22IF:1;
  uint32_t ADCD23IF:1;
  uint32_t :12;
  uint32_t CAN1IF:1;
  uint32_t CAN2RXIF:1;
  uint32_t CAN2TXIF:1;
  uint32_t CAN2IF:1;
  uint32_t :4;
  uint32_t SQIIF:1;
  uint32_t :1;
  uint32_t PTGSTEPIF:1;
  uint32_t PTGWDTIF:1;
  uint32_t PTG0TR0IF:1;
  uint32_t PTG0TR1IF:1;
  uint32_t PTG0TR2IF:1;
  uint32_t PTG0TR3IF:1;
} __IFS4bits_t;
extern volatile __IFS4bits_t IFS4bits __asm__ ("IFS4") __attribute__((section("sfrs"), address(0xBF810080)));
extern volatile uint32_t        IFS4CLR __attribute__((section("sfrs"),address(0xBF810084)));
extern volatile uint32_t        IFS4SET __attribute__((section("sfrs"),address(0xBF810088)));
extern volatile uint32_t        IFS4INV __attribute__((section("sfrs"),address(0xBF81008C)));
#define IFS5 IFS5
extern volatile uint32_t   IFS5 __attribute__((section("sfrs"), address(0xBF810090)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t MPUPCIF:1;
    uint32_t FDCIF:1;
    uint32_t CRPTIF:1;
    uint32_t ETHIF:1;
    uint32_t CRPT1IF:1;
    uint32_t CRPT1EIF:1;
  };
  struct {
    uint32_t w:32;
  };
} __IFS5bits_t;
extern volatile __IFS5bits_t IFS5bits __asm__ ("IFS5") __attribute__((section("sfrs"), address(0xBF810090)));
extern volatile uint32_t        IFS5CLR __attribute__((section("sfrs"),address(0xBF810094)));
extern volatile uint32_t        IFS5SET __attribute__((section("sfrs"),address(0xBF810098)));
extern volatile uint32_t        IFS5INV __attribute__((section("sfrs"),address(0xBF81009C)));
#define IEC0 IEC0
extern volatile uint32_t   IEC0 __attribute__((section("sfrs"), address(0xBF8100C0)));
typedef struct {
  uint32_t CTIE:1;
  uint32_t CS0IE:1;
  uint32_t CS1IE:1;
  uint32_t INT0IE:1;
  uint32_t T1IE:1;
  uint32_t IC1EIE:1;
  uint32_t IC1IE:1;
  uint32_t OC1IE:1;
  uint32_t INT1IE:1;
  uint32_t T2IE:1;
  uint32_t IC2EIE:1;
  uint32_t IC2IE:1;
  uint32_t OC2IE:1;
  uint32_t INT2IE:1;
  uint32_t T3IE:1;
  uint32_t IC3EIE:1;
  uint32_t IC3IE:1;
  uint32_t OC3IE:1;
  uint32_t INT3IE:1;
  uint32_t T4IE:1;
  uint32_t IC4EIE:1;
  uint32_t IC4IE:1;
  uint32_t OC4IE:1;
  uint32_t INT4IE:1;
  uint32_t T5IE:1;
  uint32_t :5;
  uint32_t FCEIE:1;
  uint32_t PREIE:1;
} __IEC0bits_t;
extern volatile __IEC0bits_t IEC0bits __asm__ ("IEC0") __attribute__((section("sfrs"), address(0xBF8100C0)));
extern volatile uint32_t        IEC0CLR __attribute__((section("sfrs"),address(0xBF8100C4)));
extern volatile uint32_t        IEC0SET __attribute__((section("sfrs"),address(0xBF8100C8)));
extern volatile uint32_t        IEC0INV __attribute__((section("sfrs"),address(0xBF8100CC)));
#define IEC1 IEC1
extern volatile uint32_t   IEC1 __attribute__((section("sfrs"), address(0xBF8100D0)));
typedef struct {
  uint32_t PFWCRCIE:1;
  uint32_t RTCCIE:1;
  uint32_t USBIE:1;
  uint32_t SPI1EIE:1;
  uint32_t SPI1RXIE:1;
  uint32_t SPI1TXIE:1;
  uint32_t U1EIE:1;
  uint32_t U1RXIE:1;
  uint32_t U1TXIE:1;
  uint32_t I2C1BIE:1;
  uint32_t I2C1SIE:1;
  uint32_t I2C1MIE:1;
  uint32_t CNAIE:1;
  uint32_t CNBIE:1;
  uint32_t CNCIE:1;
  uint32_t CNKIE:1;
  uint32_t :5;
  uint32_t SPI2EIE:1;
  uint32_t SPI2RXIE:1;
  uint32_t SPI2TXIE:1;
  uint32_t U2EIE:1;
  uint32_t U2RXIE:1;
  uint32_t U2TXIE:1;
  uint32_t I2C2BIE:1;
  uint32_t I2C2SIE:1;
  uint32_t I2C2MIE:1;
  uint32_t U3EIE:1;
  uint32_t U3RXIE:1;
} __IEC1bits_t;
extern volatile __IEC1bits_t IEC1bits __asm__ ("IEC1") __attribute__((section("sfrs"), address(0xBF8100D0)));
extern volatile uint32_t        IEC1CLR __attribute__((section("sfrs"),address(0xBF8100D4)));
extern volatile uint32_t        IEC1SET __attribute__((section("sfrs"),address(0xBF8100D8)));
extern volatile uint32_t        IEC1INV __attribute__((section("sfrs"),address(0xBF8100DC)));
#define IEC2 IEC2
extern volatile uint32_t   IEC2 __attribute__((section("sfrs"), address(0xBF8100E0)));
typedef struct {
  uint32_t U3TXIE:1;
  uint32_t :3;
  uint32_t DMA0IE:1;
  uint32_t DMA1IE:1;
  uint32_t DMA2IE:1;
  uint32_t DMA3IE:1;
  uint32_t DMA4IE:1;
  uint32_t DMA5IE:1;
  uint32_t DMA6IE:1;
  uint32_t DMA7IE:1;
  uint32_t T6IE:1;
  uint32_t :3;
  uint32_t T7IE:1;
  uint32_t :2;
  uint32_t RFSMCIE:1;
  uint32_t RFMACIE:1;
  uint32_t CTREVIE:1;
  uint32_t RFTM0IE:1;
  uint32_t RFTM1IE:1;
  uint32_t RFTM2IE:1;
  uint32_t RFTM3IE:1;
  uint32_t CTRTRGIE:1;
  uint32_t RFWCOEIE:1;
  uint32_t ADCIE:1;
  uint32_t :1;
  uint32_t ADCDC1IE:1;
  uint32_t ADCDC2IE:1;
} __IEC2bits_t;
extern volatile __IEC2bits_t IEC2bits __asm__ ("IEC2") __attribute__((section("sfrs"), address(0xBF8100E0)));
extern volatile uint32_t        IEC2CLR __attribute__((section("sfrs"),address(0xBF8100E4)));
extern volatile uint32_t        IEC2SET __attribute__((section("sfrs"),address(0xBF8100E8)));
extern volatile uint32_t        IEC2INV __attribute__((section("sfrs"),address(0xBF8100EC)));
#define IEC3 IEC3
extern volatile uint32_t   IEC3 __attribute__((section("sfrs"), address(0xBF8100F0)));
typedef struct {
  uint32_t ADCDF1IE:1;
  uint32_t ADCDF2IE:1;
  uint32_t :2;
  uint32_t ADCFLTIE:1;
  uint32_t ADCEOSIE:1;
  uint32_t ADCARDYIE:1;
  uint32_t ADCURDYIE:1;
  uint32_t ADCFCBTIE:1;
  uint32_t :1;
  uint32_t ADCD0IE:1;
  uint32_t ADCD1IE:1;
  uint32_t ADCD2IE:1;
  uint32_t ADCD3IE:1;
  uint32_t ADCD4IE:1;
  uint32_t ADCD5IE:1;
  uint32_t ADCD6IE:1;
  uint32_t ADCD7IE:1;
  uint32_t ADCD8IE:1;
  uint32_t ADCD9IE:1;
  uint32_t ADCD10IE:1;
  uint32_t ADCD11IE:1;
  uint32_t ADCD12IE:1;
  uint32_t ADCD13IE:1;
  uint32_t ADCD14IE:1;
  uint32_t ADCD15IE:1;
  uint32_t ADCD16IE:1;
  uint32_t ADCD17IE:1;
  uint32_t ADCD18IE:1;
  uint32_t ADCD19IE:1;
  uint32_t ADCD20IE:1;
  uint32_t ADCD21IE:1;
} __IEC3bits_t;
extern volatile __IEC3bits_t IEC3bits __asm__ ("IEC3") __attribute__((section("sfrs"), address(0xBF8100F0)));
extern volatile uint32_t        IEC3CLR __attribute__((section("sfrs"),address(0xBF8100F4)));
extern volatile uint32_t        IEC3SET __attribute__((section("sfrs"),address(0xBF8100F8)));
extern volatile uint32_t        IEC3INV __attribute__((section("sfrs"),address(0xBF8100FC)));
#define IEC4 IEC4
extern volatile uint32_t   IEC4 __attribute__((section("sfrs"), address(0xBF810100)));
typedef struct {
  uint32_t ADCD22IE:1;
  uint32_t ADCD23IE:1;
  uint32_t :12;
  uint32_t CAN1IE:1;
  uint32_t CAN2RXIE:1;
  uint32_t CAN2TXIE:1;
  uint32_t CAN2IE:1;
  uint32_t :4;
  uint32_t SQIIE:1;
  uint32_t :1;
  uint32_t PTGSTEPIE:1;
  uint32_t PTGWDTIE:1;
  uint32_t PTG0TR0IE:1;
  uint32_t PTG0TR1IE:1;
  uint32_t PTG0TR2IE:1;
  uint32_t PTG0TR3IE:1;
} __IEC4bits_t;
