Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __IEC4bits_t IEC4bits __asm__ ("IEC4") __attribute__((section("sfrs"), address(0xBF810100)));
extern volatile uint32_t        IEC4CLR __attribute__((section("sfrs"),address(0xBF810104)));
extern volatile uint32_t        IEC4SET __attribute__((section("sfrs"),address(0xBF810108)));
extern volatile uint32_t        IEC4INV __attribute__((section("sfrs"),address(0xBF81010C)));
#define IEC5 IEC5
extern volatile uint32_t   IEC5 __attribute__((section("sfrs"), address(0xBF810110)));
typedef struct {
  uint32_t :2;
  uint32_t MPUPCIE:1;
  uint32_t FDCIE:1;
  uint32_t CRPTIE:1;
  uint32_t ETHIE:1;
  uint32_t CRPT1IE:1;
  uint32_t CRPT1EIE:1;
} __IEC5bits_t;
extern volatile __IEC5bits_t IEC5bits __asm__ ("IEC5") __attribute__((section("sfrs"), address(0xBF810110)));
extern volatile uint32_t        IEC5CLR __attribute__((section("sfrs"),address(0xBF810114)));
extern volatile uint32_t        IEC5SET __attribute__((section("sfrs"),address(0xBF810118)));
extern volatile uint32_t        IEC5INV __attribute__((section("sfrs"),address(0xBF81011C)));
#define IPC0 IPC0
extern volatile uint32_t   IPC0 __attribute__((section("sfrs"), address(0xBF810140)));
typedef struct {
  uint32_t CTIS:2;
  uint32_t CTIP:3;
  uint32_t :3;
  uint32_t CS0IS:2;
  uint32_t CS0IP:3;
  uint32_t :3;
  uint32_t CS1IS:2;
  uint32_t CS1IP:3;
  uint32_t :3;
  uint32_t INT0IS:2;
  uint32_t INT0IP:3;
} __IPC0bits_t;
extern volatile __IPC0bits_t IPC0bits __asm__ ("IPC0") __attribute__((section("sfrs"), address(0xBF810140)));
extern volatile uint32_t        IPC0CLR __attribute__((section("sfrs"),address(0xBF810144)));
extern volatile uint32_t        IPC0SET __attribute__((section("sfrs"),address(0xBF810148)));
extern volatile uint32_t        IPC0INV __attribute__((section("sfrs"),address(0xBF81014C)));
#define IPC1 IPC1
extern volatile uint32_t   IPC1 __attribute__((section("sfrs"), address(0xBF810150)));
typedef struct {
  uint32_t T1IS:2;
  uint32_t T1IP:3;
  uint32_t :3;
  uint32_t IC1EIS:2;
  uint32_t IC1EIP:3;
  uint32_t :3;
  uint32_t IC1IS:2;
  uint32_t IC1IP:3;
  uint32_t :3;
  uint32_t OC1IS:2;
  uint32_t OC1IP:3;
} __IPC1bits_t;
extern volatile __IPC1bits_t IPC1bits __asm__ ("IPC1") __attribute__((section("sfrs"), address(0xBF810150)));
extern volatile uint32_t        IPC1CLR __attribute__((section("sfrs"),address(0xBF810154)));
extern volatile uint32_t        IPC1SET __attribute__((section("sfrs"),address(0xBF810158)));
extern volatile uint32_t        IPC1INV __attribute__((section("sfrs"),address(0xBF81015C)));
#define IPC2 IPC2
extern volatile uint32_t   IPC2 __attribute__((section("sfrs"), address(0xBF810160)));
typedef struct {
  uint32_t INT1IS:2;
  uint32_t INT1IP:3;
  uint32_t :3;
  uint32_t T2IS:2;
  uint32_t T2IP:3;
  uint32_t :3;
  uint32_t IC2EIS:2;
  uint32_t IC2EIP:3;
  uint32_t :3;
  uint32_t IC2IS:2;
  uint32_t IC2IP:3;
} __IPC2bits_t;
extern volatile __IPC2bits_t IPC2bits __asm__ ("IPC2") __attribute__((section("sfrs"), address(0xBF810160)));
extern volatile uint32_t        IPC2CLR __attribute__((section("sfrs"),address(0xBF810164)));
extern volatile uint32_t        IPC2SET __attribute__((section("sfrs"),address(0xBF810168)));
extern volatile uint32_t        IPC2INV __attribute__((section("sfrs"),address(0xBF81016C)));
#define IPC3 IPC3
extern volatile uint32_t   IPC3 __attribute__((section("sfrs"), address(0xBF810170)));
typedef struct {
  uint32_t OC2IS:2;
  uint32_t OC2IP:3;
  uint32_t :3;
  uint32_t INT2IS:2;
  uint32_t INT2IP:3;
  uint32_t :3;
  uint32_t T3IS:2;
  uint32_t T3IP:3;
  uint32_t :3;
  uint32_t IC3EIS:2;
  uint32_t IC3EIP:3;
} __IPC3bits_t;
extern volatile __IPC3bits_t IPC3bits __asm__ ("IPC3") __attribute__((section("sfrs"), address(0xBF810170)));
extern volatile uint32_t        IPC3CLR __attribute__((section("sfrs"),address(0xBF810174)));
extern volatile uint32_t        IPC3SET __attribute__((section("sfrs"),address(0xBF810178)));
extern volatile uint32_t        IPC3INV __attribute__((section("sfrs"),address(0xBF81017C)));
#define IPC4 IPC4
extern volatile uint32_t   IPC4 __attribute__((section("sfrs"), address(0xBF810180)));
typedef struct {
  uint32_t IC3IS:2;
  uint32_t IC3IP:3;
  uint32_t :3;
  uint32_t OC3IS:2;
  uint32_t OC3IP:3;
  uint32_t :3;
  uint32_t INT3IS:2;
  uint32_t INT3IP:3;
  uint32_t :3;
  uint32_t T4IS:2;
  uint32_t T4IP:3;
} __IPC4bits_t;
extern volatile __IPC4bits_t IPC4bits __asm__ ("IPC4") __attribute__((section("sfrs"), address(0xBF810180)));
extern volatile uint32_t        IPC4CLR __attribute__((section("sfrs"),address(0xBF810184)));
extern volatile uint32_t        IPC4SET __attribute__((section("sfrs"),address(0xBF810188)));
extern volatile uint32_t        IPC4INV __attribute__((section("sfrs"),address(0xBF81018C)));
#define IPC5 IPC5
extern volatile uint32_t   IPC5 __attribute__((section("sfrs"), address(0xBF810190)));
typedef struct {
  uint32_t IC4EIS:2;
  uint32_t IC4EIP:3;
  uint32_t :3;
  uint32_t IC4IS:2;
  uint32_t IC4IP:3;
  uint32_t :3;
  uint32_t OC4IS:2;
  uint32_t OC4IP:3;
  uint32_t :3;
  uint32_t INT4IS:2;
  uint32_t INT4IP:3;
} __IPC5bits_t;
extern volatile __IPC5bits_t IPC5bits __asm__ ("IPC5") __attribute__((section("sfrs"), address(0xBF810190)));
extern volatile uint32_t        IPC5CLR __attribute__((section("sfrs"),address(0xBF810194)));
extern volatile uint32_t        IPC5SET __attribute__((section("sfrs"),address(0xBF810198)));
extern volatile uint32_t        IPC5INV __attribute__((section("sfrs"),address(0xBF81019C)));
#define IPC6 IPC6
extern volatile uint32_t   IPC6 __attribute__((section("sfrs"), address(0xBF8101A0)));
typedef struct {
  uint32_t T5IS:2;
  uint32_t T5IP:3;
} __IPC6bits_t;
extern volatile __IPC6bits_t IPC6bits __asm__ ("IPC6") __attribute__((section("sfrs"), address(0xBF8101A0)));
extern volatile uint32_t        IPC6CLR __attribute__((section("sfrs"),address(0xBF8101A4)));
extern volatile uint32_t        IPC6SET __attribute__((section("sfrs"),address(0xBF8101A8)));
extern volatile uint32_t        IPC6INV __attribute__((section("sfrs"),address(0xBF8101AC)));
#define IPC7 IPC7
extern volatile uint32_t   IPC7 __attribute__((section("sfrs"), address(0xBF8101B0)));
typedef struct {
  uint32_t :16;
  uint32_t FCEIS:2;
  uint32_t FCEIP:3;
  uint32_t :3;
  uint32_t PREIS:2;
  uint32_t PREIP:3;
} __IPC7bits_t;
extern volatile __IPC7bits_t IPC7bits __asm__ ("IPC7") __attribute__((section("sfrs"), address(0xBF8101B0)));
extern volatile uint32_t        IPC7CLR __attribute__((section("sfrs"),address(0xBF8101B4)));
extern volatile uint32_t        IPC7SET __attribute__((section("sfrs"),address(0xBF8101B8)));
extern volatile uint32_t        IPC7INV __attribute__((section("sfrs"),address(0xBF8101BC)));
#define IPC8 IPC8
extern volatile uint32_t   IPC8 __attribute__((section("sfrs"), address(0xBF8101C0)));
typedef struct {
  uint32_t PFWCRCIS:2;
  uint32_t PFWCRCIP:3;
  uint32_t :3;
  uint32_t RTCCIS:2;
  uint32_t RTCCIP:3;
  uint32_t :3;
  uint32_t USBIS:2;
  uint32_t USBIP:3;
  uint32_t :3;
  uint32_t SPI1EIS:2;
  uint32_t SPI1EIP:3;
} __IPC8bits_t;
extern volatile __IPC8bits_t IPC8bits __asm__ ("IPC8") __attribute__((section("sfrs"), address(0xBF8101C0)));
extern volatile uint32_t        IPC8CLR __attribute__((section("sfrs"),address(0xBF8101C4)));
extern volatile uint32_t        IPC8SET __attribute__((section("sfrs"),address(0xBF8101C8)));
extern volatile uint32_t        IPC8INV __attribute__((section("sfrs"),address(0xBF8101CC)));
#define IPC9 IPC9
extern volatile uint32_t   IPC9 __attribute__((section("sfrs"), address(0xBF8101D0)));
typedef struct {
  uint32_t SPI1RXIS:2;
  uint32_t SPI1RXIP:3;
  uint32_t :3;
  uint32_t SPI1TXIS:2;
  uint32_t SPI1TXIP:3;
  uint32_t :3;
  uint32_t U1EIS:2;
  uint32_t U1EIP:3;
  uint32_t :3;
  uint32_t U1RXIS:2;
  uint32_t U1RXIP:3;
} __IPC9bits_t;
extern volatile __IPC9bits_t IPC9bits __asm__ ("IPC9") __attribute__((section("sfrs"), address(0xBF8101D0)));
extern volatile uint32_t        IPC9CLR __attribute__((section("sfrs"),address(0xBF8101D4)));
extern volatile uint32_t        IPC9SET __attribute__((section("sfrs"),address(0xBF8101D8)));
extern volatile uint32_t        IPC9INV __attribute__((section("sfrs"),address(0xBF8101DC)));
#define IPC10 IPC10
extern volatile uint32_t   IPC10 __attribute__((section("sfrs"), address(0xBF8101E0)));
typedef union {
  struct {
    uint32_t U1TXIS:2;
    uint32_t U1TXIP:3;
    uint32_t :3;
    uint32_t I2C1BIS:2;
    uint32_t I2C1BIP:3;
    uint32_t :3;
    uint32_t I2C1SIS:2;
    uint32_t I2C1SIP:3;
    uint32_t :3;
    uint32_t I2C1MIS:2;
    uint32_t I2C1MIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC10bits_t;
extern volatile __IPC10bits_t IPC10bits __asm__ ("IPC10") __attribute__((section("sfrs"), address(0xBF8101E0)));
extern volatile uint32_t        IPC10CLR __attribute__((section("sfrs"),address(0xBF8101E4)));
extern volatile uint32_t        IPC10SET __attribute__((section("sfrs"),address(0xBF8101E8)));
extern volatile uint32_t        IPC10INV __attribute__((section("sfrs"),address(0xBF8101EC)));
#define IPC11 IPC11
extern volatile uint32_t   IPC11 __attribute__((section("sfrs"), address(0xBF8101F0)));
typedef struct {
  uint32_t CNAIS:2;
  uint32_t CNAIP:3;
  uint32_t :3;
  uint32_t CNBIS:2;
  uint32_t CNBIP:3;
  uint32_t :3;
  uint32_t CNCIS:2;
  uint32_t CNCIP:3;
  uint32_t :3;
  uint32_t CNKIS:2;
  uint32_t CNKIP:3;
} __IPC11bits_t;
extern volatile __IPC11bits_t IPC11bits __asm__ ("IPC11") __attribute__((section("sfrs"), address(0xBF8101F0)));
extern volatile uint32_t        IPC11CLR __attribute__((section("sfrs"),address(0xBF8101F4)));
extern volatile uint32_t        IPC11SET __attribute__((section("sfrs"),address(0xBF8101F8)));
extern volatile uint32_t        IPC11INV __attribute__((section("sfrs"),address(0xBF8101FC)));
#define IPC13 IPC13
extern volatile uint32_t   IPC13 __attribute__((section("sfrs"), address(0xBF810210)));
typedef struct {
  uint32_t :8;
  uint32_t SPI2EIS:2;
  uint32_t SPI2EIP:3;
  uint32_t :3;
  uint32_t SPI2RXIS:2;
  uint32_t SPI2RXIP:3;
  uint32_t :3;
  uint32_t SPI2TXIS:2;
  uint32_t SPI2TXIP:3;
} __IPC13bits_t;
