Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __DCH7CSIZbits_t DCH7CSIZbits __asm__ ("DCH7CSIZ") __attribute__((section("sfrs"), address(0xBF811630)));
extern volatile uint32_t        DCH7CSIZCLR __attribute__((section("sfrs"),address(0xBF811634)));
extern volatile uint32_t        DCH7CSIZSET __attribute__((section("sfrs"),address(0xBF811638)));
extern volatile uint32_t        DCH7CSIZINV __attribute__((section("sfrs"),address(0xBF81163C)));
#define DCH7CPTR DCH7CPTR
extern volatile uint32_t   DCH7CPTR __attribute__((section("sfrs"), address(0xBF811640)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCH7CPTRbits_t;
extern volatile __DCH7CPTRbits_t DCH7CPTRbits __asm__ ("DCH7CPTR") __attribute__((section("sfrs"), address(0xBF811640)));
#define DCS7CPTR DCS7CPTR
extern volatile uint32_t   DCS7CPTR __attribute__((section("sfrs"), address(0xBF811640)));
typedef struct {
  uint32_t CHCPTR:16;
} __DCS7CPTRbits_t;
extern volatile __DCS7CPTRbits_t DCS7CPTRbits __asm__ ("DCS7CPTR") __attribute__((section("sfrs"), address(0xBF811640)));
extern volatile uint32_t        DCH7CPTRCLR __attribute__((section("sfrs"),address(0xBF811644)));
extern volatile uint32_t        DCS7CPTRCLR __attribute__((section("sfrs"),address(0xBF811644)));
extern volatile uint32_t        DCH7CPTRSET __attribute__((section("sfrs"),address(0xBF811648)));
extern volatile uint32_t        DCS7CPTRSET __attribute__((section("sfrs"),address(0xBF811648)));
extern volatile uint32_t        DCH7CPTRINV __attribute__((section("sfrs"),address(0xBF81164C)));
extern volatile uint32_t        DCS7CPTRINV __attribute__((section("sfrs"),address(0xBF81164C)));
#define DCH7DAT DCH7DAT
extern volatile uint32_t   DCH7DAT __attribute__((section("sfrs"), address(0xBF811650)));
typedef struct {
  uint32_t CHPDAT:16;
} __DCH7DATbits_t;
extern volatile __DCH7DATbits_t DCH7DATbits __asm__ ("DCH7DAT") __attribute__((section("sfrs"), address(0xBF811650)));
extern volatile uint32_t        DCH7DATCLR __attribute__((section("sfrs"),address(0xBF811654)));
extern volatile uint32_t        DCH7DATSET __attribute__((section("sfrs"),address(0xBF811658)));
extern volatile uint32_t        DCH7DATINV __attribute__((section("sfrs"),address(0xBF81165C)));
#define _ICDCON _ICDCON
extern volatile uint32_t   _ICDCON __attribute__((section("sfrs"), address(0xBF812000)));
typedef struct {
  uint32_t CKSWBKEN:1;
  uint32_t SLPBKEN:1;
  uint32_t WDTBKEN:1;
  uint32_t WDTEN:1;
  uint32_t RSTBUG:1;
  uint32_t DMTBKEN:1;
  uint32_t DMTEN:1;
  uint32_t :7;
  uint32_t FRZ:1;
} ___ICDCONbits_t;
extern volatile ___ICDCONbits_t _ICDCONbits __asm__ ("_ICDCON") __attribute__((section("sfrs"), address(0xBF812000)));
#define _ICDSTAT _ICDSTAT
extern volatile uint32_t   _ICDSTAT __attribute__((section("sfrs"), address(0xBF812010)));
typedef struct {
  uint32_t CKSWBF:1;
  uint32_t SLPBF:1;
  uint32_t WDTBF:1;
  uint32_t DMTBF:1;
  uint32_t WDTRUNBF:1;
  uint32_t WDTSLPBF:1;
} ___ICDSTATbits_t;
extern volatile ___ICDSTATbits_t _ICDSTATbits __asm__ ("_ICDSTAT") __attribute__((section("sfrs"), address(0xBF812010)));
#define PRECON PRECON
extern volatile uint32_t   PRECON __attribute__((section("sfrs"), address(0xBF812400)));
typedef struct {
  uint32_t PFMWS:4;
  uint32_t PREFEN:2;
  uint32_t :1;
  uint32_t PFMSECEN:1;
  uint32_t PFMAWSEN:1;
  uint32_t :3;
  uint32_t CHEPERFEN:1;
  uint32_t :3;
  uint32_t ICHECOH:1;
  uint32_t DCHECOH:1;
  uint32_t PERCHECOH:1;
  uint32_t :1;
  uint32_t ICHEINV:1;
  uint32_t DCHEINV:1;
  uint32_t PERCHEINV:1;
  uint32_t :1;
  uint32_t ICHEEN:1;
  uint32_t DCHEEN:1;
  uint32_t PERCHEEN:1;
} __PRECONbits_t;
extern volatile __PRECONbits_t PRECONbits __asm__ ("PRECON") __attribute__((section("sfrs"), address(0xBF812400)));
extern volatile uint32_t        PRECONCLR __attribute__((section("sfrs"),address(0xBF812404)));
extern volatile uint32_t        PRECONSET __attribute__((section("sfrs"),address(0xBF812408)));
extern volatile uint32_t        PRECONINV __attribute__((section("sfrs"),address(0xBF81240C)));
#define PRESTAT PRESTAT
extern volatile uint32_t   PRESTAT __attribute__((section("sfrs"), address(0xBF812410)));
typedef struct {
  uint32_t PFMSECCNT:8;
  uint32_t :18;
  uint32_t PFMSEC:1;
  uint32_t PFMDED:1;
} __PRESTATbits_t;
extern volatile __PRESTATbits_t PRESTATbits __asm__ ("PRESTAT") __attribute__((section("sfrs"), address(0xBF812410)));
#define PREHIT PREHIT
extern volatile uint32_t   PREHIT __attribute__((section("sfrs"), address(0xBF812420)));
typedef struct {
  uint32_t CHEHIT:32;
} __PREHITbits_t;
extern volatile __PREHITbits_t PREHITbits __asm__ ("PREHIT") __attribute__((section("sfrs"), address(0xBF812420)));
#define PREMIS PREMIS
extern volatile uint32_t   PREMIS __attribute__((section("sfrs"), address(0xBF812430)));
typedef struct {
  uint32_t CHEMIS:32;
} __PREMISbits_t;
extern volatile __PREMISbits_t PREMISbits __asm__ ("PREMIS") __attribute__((section("sfrs"), address(0xBF812430)));
#define PMUSPICTRL PMUSPICTRL
extern volatile uint32_t   PMUSPICTRL __attribute__((section("sfrs"), address(0xBF813E00)));
typedef struct {
  uint32_t SPIWDATA:16;
  uint32_t SPIADDR:8;
  uint32_t CMD:1;
  uint32_t :5;
  uint32_t PMUCRST:1;
  uint32_t SPIRST:1;
} __PMUSPICTRLbits_t;
extern volatile __PMUSPICTRLbits_t PMUSPICTRLbits __asm__ ("PMUSPICTRL") __attribute__((section("sfrs"), address(0xBF813E00)));
#define PMUSPISTAT PMUSPISTAT
extern volatile uint32_t   PMUSPISTAT __attribute__((section("sfrs"), address(0xBF813E04)));
typedef struct {
  uint32_t SPIERR:1;
  uint32_t :6;
  uint32_t SPIRDY:1;
  uint32_t SPIRADDR:8;
  uint32_t SPIRDATA:16;
} __PMUSPISTATbits_t;
extern volatile __PMUSPISTATbits_t PMUSPISTATbits __asm__ ("PMUSPISTAT") __attribute__((section("sfrs"), address(0xBF813E04)));
#define PMUCLKCTRL PMUCLKCTRL
extern volatile uint32_t   PMUCLKCTRL __attribute__((section("sfrs"), address(0xBF813E08)));
typedef struct {
  uint32_t SPICLKDIV:6;
  uint32_t PMUANABUCKBOREN:1;
  uint32_t SPISRC:1;
  uint32_t BUCKCLKDIV:6;
  uint32_t BUCKSRC:2;
  uint32_t BACWD:1;
  uint32_t MLDOEXTEN:1;
  uint32_t MVREFFSMEN:1;
  uint32_t WCMRETEXBCWD:1;
  uint32_t CMPCYCLE:4;
  uint32_t BKCLKHWOVR:1;
  uint32_t :1;
  uint32_t MDLOEXTBOREN:1;
  uint32_t ADCBOREN:1;
  uint32_t BUCKBOREN:1;
  uint32_t FBCLKCFG:1;
  uint32_t WLDOOFF:1;
  uint32_t WCMRET:1;
} __PMUCLKCTRLbits_t;
