Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __PMUCLKCTRLbits_t PMUCLKCTRLbits __asm__ ("PMUCLKCTRL") __attribute__((section("sfrs"), address(0xBF813E08)));
#define PMUMODECTRL1 PMUMODECTRL1
extern volatile uint32_t   PMUMODECTRL1 __attribute__((section("sfrs"), address(0xBF813E0C)));
typedef struct {
  uint32_t VREG4CTRL:5;
  uint32_t :3;
  uint32_t VREG3CTRL:5;
  uint32_t :3;
  uint32_t VREG2CTRL:5;
  uint32_t :3;
  uint32_t VREG1CTRL:5;
  uint32_t BUCKMODE:1;
  uint32_t MLDOEN:1;
  uint32_t BUCKEN:1;
} __PMUMODECTRL1bits_t;
extern volatile __PMUMODECTRL1bits_t PMUMODECTRL1bits __asm__ ("PMUMODECTRL1") __attribute__((section("sfrs"), address(0xBF813E0C)));
#define PMUMODECTRL2 PMUMODECTRL2
extern volatile uint32_t   PMUMODECTRL2 __attribute__((section("sfrs"), address(0xBF813E10)));
typedef struct {
  uint32_t VREG4CTRL:5;
  uint32_t :3;
  uint32_t VREG3CTRL:5;
  uint32_t :3;
  uint32_t VREG2CTRL:5;
  uint32_t :3;
  uint32_t VREG1CTRL:5;
  uint32_t BUCKMODE:1;
  uint32_t MLDOEN:1;
  uint32_t BUCKEN:1;
} __PMUMODECTRL2bits_t;
extern volatile __PMUMODECTRL2bits_t PMUMODECTRL2bits __asm__ ("PMUMODECTRL2") __attribute__((section("sfrs"), address(0xBF813E10)));
#define PMUMODECTRL3 PMUMODECTRL3
extern volatile uint32_t   PMUMODECTRL3 __attribute__((section("sfrs"), address(0xBF813E14)));
typedef struct {
  uint32_t VREG4CTRL:5;
  uint32_t :3;
  uint32_t VREG3CTRL:5;
  uint32_t :3;
  uint32_t VREG2CTRL:5;
  uint32_t :3;
  uint32_t VREG1CTRL:5;
  uint32_t BUCKMODE:1;
  uint32_t MLDOEN:1;
  uint32_t BUCKEN:1;
} __PMUMODECTRL3bits_t;
extern volatile __PMUMODECTRL3bits_t PMUMODECTRL3bits __asm__ ("PMUMODECTRL3") __attribute__((section("sfrs"), address(0xBF813E14)));
#define PMUMODECTRL4 PMUMODECTRL4
extern volatile uint32_t   PMUMODECTRL4 __attribute__((section("sfrs"), address(0xBF813E18)));
typedef struct {
  uint32_t VREG4CTRL:5;
  uint32_t :3;
  uint32_t VREG3CTRL:5;
  uint32_t :3;
  uint32_t VREG2CTRL:5;
  uint32_t :3;
  uint32_t VREG1CTRL:5;
  uint32_t BUCKMODE:1;
  uint32_t MLDOEN:1;
  uint32_t BUCKEN:1;
} __PMUMODECTRL4bits_t;
extern volatile __PMUMODECTRL4bits_t PMUMODECTRL4bits __asm__ ("PMUMODECTRL4") __attribute__((section("sfrs"), address(0xBF813E18)));
#define PMUOVERCTRL PMUOVERCTRL
extern volatile uint32_t   PMUOVERCTRL __attribute__((section("sfrs"), address(0xBF813E1C)));
typedef struct {
  uint32_t VREG4OCTRL:5;
  uint32_t :3;
  uint32_t VREG3OCTRL:5;
  uint32_t :1;
  uint32_t ORETEXIT:1;
  uint32_t OWLDOEN:1;
  uint32_t VREG2OCTRL:5;
  uint32_t :1;
  uint32_t PHWC:1;
  uint32_t OVEREN:1;
  uint32_t VREG1OCTRL:5;
  uint32_t OBUCKMODE:1;
  uint32_t OMLDOEN:1;
  uint32_t OBUCKEN:1;
} __PMUOVERCTRLbits_t;
extern volatile __PMUOVERCTRLbits_t PMUOVERCTRLbits __asm__ ("PMUOVERCTRL") __attribute__((section("sfrs"), address(0xBF813E1C)));
#define PMUCMODE PMUCMODE
extern volatile uint32_t   PMUCMODE __attribute__((section("sfrs"), address(0xBF813E20)));
typedef struct {
  uint32_t CVREG4OCTRL:5;
  uint32_t :3;
  uint32_t CVREG3OCTRL:5;
  uint32_t :3;
  uint32_t CVREG2OCTRL:5;
  uint32_t ADCBOR:1;
  uint32_t BUCKBOR:1;
  uint32_t MLDOEXTBOR:1;
  uint32_t CVREG1OCTRL:5;
  uint32_t CBUCKMODE:1;
  uint32_t CMLDOEN:1;
  uint32_t CBUCKEN:1;
} __PMUCMODEbits_t;
extern volatile __PMUCMODEbits_t PMUCMODEbits __asm__ ("PMUCMODE") __attribute__((section("sfrs"), address(0xBF813E20)));
#define PMUSTATUS PMUSTATUS
extern volatile uint32_t   PMUSTATUS __attribute__((section("sfrs"), address(0xBF813E24)));
typedef struct {
  uint32_t STATUS:5;
  uint32_t WCMRM:1;
  uint32_t PMUANABUCKBOR:1;
  uint32_t WLDORDY:1;
  uint32_t BSSEDATA:16;
  uint32_t BSSENUM:7;
  uint32_t BSSERR:1;
} __PMUSTATUSbits_t;
extern volatile __PMUSTATUSbits_t PMUSTATUSbits __asm__ ("PMUSTATUS") __attribute__((section("sfrs"), address(0xBF813E24)));
#define PMUSEQ1 PMUSEQ1
extern volatile uint32_t   PMUSEQ1 __attribute__((section("sfrs"), address(0xBF813E28)));
typedef struct {
  uint32_t DELAY:6;
  uint32_t CMPBVAL:1;
  uint32_t CMD:1;
  uint32_t SPIADDR:8;
  uint32_t SPIDATA:16;
} __PMUSEQ1bits_t;
extern volatile __PMUSEQ1bits_t PMUSEQ1bits __asm__ ("PMUSEQ1") __attribute__((section("sfrs"), address(0xBF813E28)));
#define PMUSEQ2 PMUSEQ2
extern volatile uint32_t   PMUSEQ2 __attribute__((section("sfrs"), address(0xBF813E2C)));
typedef struct {
  uint32_t DELAY:6;
  uint32_t CMPBVAL:1;
  uint32_t CMD:1;
  uint32_t SPIADDR:8;
  uint32_t SPIDATA:16;
} __PMUSEQ2bits_t;
extern volatile __PMUSEQ2bits_t PMUSEQ2bits __asm__ ("PMUSEQ2") __attribute__((section("sfrs"), address(0xBF813E2C)));
#define PMUSEQ3 PMUSEQ3
extern volatile uint32_t   PMUSEQ3 __attribute__((section("sfrs"), address(0xBF813E30)));
typedef struct {
  uint32_t DELAY:6;
  uint32_t CMPBVAL:1;
  uint32_t CMD:1;
  uint32_t SPIADDR:8;
  uint32_t SPIDATA:16;
} __PMUSEQ3bits_t;
extern volatile __PMUSEQ3bits_t PMUSEQ3bits __asm__ ("PMUSEQ3") __attribute__((section("sfrs"), address(0xBF813E30)));
#define PMUSEQ4 PMUSEQ4
extern volatile uint32_t   PMUSEQ4 __attribute__((section("sfrs"), address(0xBF813E34)));
typedef struct {
  uint32_t DELAY:6;
  uint32_t CMPBVAL:1;
  uint32_t CMD:1;
  uint32_t SPIADDR:8;
  uint32_t SPIDATA:16;
} __PMUSEQ4bits_t;
extern volatile __PMUSEQ4bits_t PMUSEQ4bits __asm__ ("PMUSEQ4") __attribute__((section("sfrs"), address(0xBF813E34)));
#define PMUCFG PMUCFG
extern volatile uint32_t   PMUCFG __attribute__((section("sfrs"), address(0xBF813E38)));
typedef struct {
  uint32_t BUCKSWDELAY:7;
  uint32_t MLDOSWDELAY:7;
  uint32_t MLDOEXTL:2;
  uint32_t BUCKCPL:4;
  uint32_t BUCKCPH:4;
  uint32_t ADCCPL:4;
  uint32_t ADCCPH:4;
} __PMUCFGbits_t;
extern volatile __PMUCFGbits_t PMUCFGbits __asm__ ("PMUCFG") __attribute__((section("sfrs"), address(0xBF813E38)));
#define PMUWCMCMD PMUWCMCMD
extern volatile uint32_t   PMUWCMCMD __attribute__((section("sfrs"), address(0xBF813E3C)));
typedef struct {
  uint32_t WCMADDR:11;
  uint32_t :5;
  uint32_t WCMCLKDIV:3;
  uint32_t :9;
  uint32_t WCMRDY:1;
  uint32_t :1;
  uint32_t CMD:1;
  uint32_t MODE:1;
} __PMUWCMCMDbits_t;
extern volatile __PMUWCMCMDbits_t PMUWCMCMDbits __asm__ ("PMUWCMCMD") __attribute__((section("sfrs"), address(0xBF813E3C)));
#define PMUWCMWDATA PMUWCMWDATA
extern volatile uint32_t   PMUWCMWDATA __attribute__((section("sfrs"), address(0xBF813E40)));
typedef struct {
  uint32_t WDATA:32;
} __PMUWCMWDATAbits_t;
extern volatile __PMUWCMWDATAbits_t PMUWCMWDATAbits __asm__ ("PMUWCMWDATA") __attribute__((section("sfrs"), address(0xBF813E40)));
#define PMUWCMRDATA PMUWCMRDATA
extern volatile uint32_t   PMUWCMRDATA __attribute__((section("sfrs"), address(0xBF813E44)));
typedef struct {
  uint32_t RDATA:32;
} __PMUWCMRDATAbits_t;
