Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __PMUWCMRDATAbits_t PMUWCMRDATAbits __asm__ ("PMUWCMRDATA") __attribute__((section("sfrs"), address(0xBF813E44)));
#define PMUVBCCMD PMUVBCCMD
extern volatile uint32_t   PMUVBCCMD __attribute__((section("sfrs"), address(0xBF813E48)));
typedef struct {
  uint32_t VBCADDR:16;
  uint32_t :12;
  uint32_t VBCRDY:1;
  uint32_t :1;
  uint32_t CMD:1;
} __PMUVBCCMDbits_t;
extern volatile __PMUVBCCMDbits_t PMUVBCCMDbits __asm__ ("PMUVBCCMD") __attribute__((section("sfrs"), address(0xBF813E48)));
#define PMUVCBWDATA PMUVCBWDATA
extern volatile uint32_t   PMUVCBWDATA __attribute__((section("sfrs"), address(0xBF813E4C)));
typedef struct {
  uint32_t WDATA:32;
} __PMUVCBWDATAbits_t;
extern volatile __PMUVCBWDATAbits_t PMUVCBWDATAbits __asm__ ("PMUVCBWDATA") __attribute__((section("sfrs"), address(0xBF813E4C)));
#define PMUVCBRDATA PMUVCBRDATA
extern volatile uint32_t   PMUVCBRDATA __attribute__((section("sfrs"), address(0xBF813E50)));
typedef struct {
  uint32_t RDATA:32;
} __PMUVCBRDATAbits_t;
extern volatile __PMUVCBRDATAbits_t PMUVCBRDATAbits __asm__ ("PMUVCBRDATA") __attribute__((section("sfrs"), address(0xBF813E50)));
#define WCMCFG WCMCFG
extern volatile uint32_t   WCMCFG __attribute__((section("sfrs"), address(0xBF813E54)));
typedef struct {
  uint32_t WCM1CFG:3;
  uint32_t :1;
  uint32_t WCM2CFG:3;
  uint32_t :1;
  uint32_t SRAM1CFG:3;
  uint32_t :1;
  uint32_t SRAM2CFG:3;
  uint32_t :1;
  uint32_t SRAM3CFG:3;
  uint32_t :1;
  uint32_t SRAM4CFG:3;
  uint32_t :1;
  uint32_t SRAM5CFG:3;
  uint32_t :1;
  uint32_t SRAM6CFG:3;
} __WCMCFGbits_t;
extern volatile __WCMCFGbits_t WCMCFGbits __asm__ ("WCMCFG") __attribute__((section("sfrs"), address(0xBF813E54)));
#define PMUIENB PMUIENB
extern volatile uint32_t   PMUIENB __attribute__((section("sfrs"), address(0xBF813E58)));
typedef struct {
  uint32_t ADCBORIEN:1;
  uint32_t BUCKBORIEN:1;
  uint32_t SCMPIEN:1;
  uint32_t WCMIAIEN:1;
  uint32_t VBCIAIEN:1;
} __PMUIENBbits_t;
extern volatile __PMUIENBbits_t PMUIENBbits __asm__ ("PMUIENB") __attribute__((section("sfrs"), address(0xBF813E58)));
#define PMUISTAT PMUISTAT
extern volatile uint32_t   PMUISTAT __attribute__((section("sfrs"), address(0xBF813E5C)));
typedef struct {
  uint32_t ADCBORINT:1;
  uint32_t BUCKBORINT:1;
  uint32_t SCMPINT:1;
  uint32_t WCMIAINT:1;
  uint32_t VBCIAINT:1;
} __PMUISTATbits_t;
extern volatile __PMUISTATbits_t PMUISTATbits __asm__ ("PMUISTAT") __attribute__((section("sfrs"), address(0xBF813E5C)));
#define WCMSIZ WCMSIZ
extern volatile uint32_t   WCMSIZ __attribute__((section("sfrs"), address(0xBF813E60)));
typedef struct {
  uint32_t WCM1SIZ:2;
  uint32_t :2;
  uint32_t WCM2SIZ:2;
  uint32_t :2;
  uint32_t SRAM1SIZ:2;
  uint32_t :2;
  uint32_t SRAM2SIZ:2;
  uint32_t :2;
  uint32_t SRAM3SIZ:2;
  uint32_t :2;
  uint32_t SRAM4SIZ:2;
  uint32_t :2;
  uint32_t SRAM5SIZ:2;
  uint32_t :2;
  uint32_t SRAM6SIZ:2;
} __WCMSIZbits_t;
extern volatile __WCMSIZbits_t WCMSIZbits __asm__ ("WCMSIZ") __attribute__((section("sfrs"), address(0xBF813E60)));
#define PMUWCM PMUWCM
extern volatile uint32_t   PMUWCM __attribute__((section("sfrs"), address(0xBF814000)));
typedef struct {
  uint32_t WCMDATA:32;
} __PMUWCMbits_t;
extern volatile __PMUWCMbits_t PMUWCMbits __asm__ ("PMUWCM") __attribute__((section("sfrs"), address(0xBF814000)));
#define ANSELA ANSELA
extern volatile uint32_t   ANSELA __attribute__((section("sfrs"), address(0xBF820000)));
typedef union {
  struct {
    uint32_t :10;
    uint32_t ANSA10:1;
    uint32_t :1;
    uint32_t ANSA12:1;
    uint32_t ANSA13:1;
    uint32_t ANSA14:1;
    uint32_t ANSA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELAbits_t;
extern volatile __ANSELAbits_t ANSELAbits __asm__ ("ANSELA") __attribute__((section("sfrs"), address(0xBF820000)));
extern volatile uint32_t        ANSELACLR __attribute__((section("sfrs"),address(0xBF820004)));
extern volatile uint32_t        ANSELASET __attribute__((section("sfrs"),address(0xBF820008)));
extern volatile uint32_t        ANSELAINV __attribute__((section("sfrs"),address(0xBF82000C)));
#define TRISA TRISA
extern volatile uint32_t   TRISA __attribute__((section("sfrs"), address(0xBF820010)));
typedef union {
  struct {
    uint32_t TRISA0:1;
    uint32_t TRISA1:1;
    uint32_t TRISA2:1;
    uint32_t TRISA3:1;
    uint32_t TRISA4:1;
    uint32_t TRISA5:1;
    uint32_t TRISA6:1;
    uint32_t TRISA7:1;
    uint32_t TRISA8:1;
    uint32_t TRISA9:1;
    uint32_t TRISA10:1;
    uint32_t TRISA11:1;
    uint32_t TRISA12:1;
    uint32_t TRISA13:1;
    uint32_t TRISA14:1;
    uint32_t TRISA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISAbits_t;
extern volatile __TRISAbits_t TRISAbits __asm__ ("TRISA") __attribute__((section("sfrs"), address(0xBF820010)));
extern volatile uint32_t        TRISACLR __attribute__((section("sfrs"),address(0xBF820014)));
extern volatile uint32_t        TRISASET __attribute__((section("sfrs"),address(0xBF820018)));
extern volatile uint32_t        TRISAINV __attribute__((section("sfrs"),address(0xBF82001C)));
#define PORTA PORTA
extern volatile uint32_t   PORTA __attribute__((section("sfrs"), address(0xBF820020)));
typedef union {
  struct {
    uint32_t RA0:1;
    uint32_t RA1:1;
    uint32_t RA2:1;
    uint32_t RA3:1;
    uint32_t RA4:1;
    uint32_t RA5:1;
    uint32_t RA6:1;
    uint32_t RA7:1;
    uint32_t RA8:1;
    uint32_t RA9:1;
    uint32_t RA10:1;
    uint32_t RA11:1;
    uint32_t RA12:1;
    uint32_t RA13:1;
    uint32_t RA14:1;
    uint32_t RA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTAbits_t;
extern volatile __PORTAbits_t PORTAbits __asm__ ("PORTA") __attribute__((section("sfrs"), address(0xBF820020)));
extern volatile uint32_t        PORTACLR __attribute__((section("sfrs"),address(0xBF820024)));
extern volatile uint32_t        PORTASET __attribute__((section("sfrs"),address(0xBF820028)));
extern volatile uint32_t        PORTAINV __attribute__((section("sfrs"),address(0xBF82002C)));
#define LATA LATA
extern volatile uint32_t   LATA __attribute__((section("sfrs"), address(0xBF820030)));
typedef union {
  struct {
    uint32_t LATA0:1;
    uint32_t LATA1:1;
    uint32_t LATA2:1;
    uint32_t LATA3:1;
    uint32_t LATA4:1;
    uint32_t LATA5:1;
    uint32_t LATA6:1;
    uint32_t LATA7:1;
    uint32_t LATA8:1;
    uint32_t LATA9:1;
    uint32_t LATA10:1;
    uint32_t LATA11:1;
    uint32_t LATA12:1;
    uint32_t LATA13:1;
    uint32_t LATA14:1;
    uint32_t LATA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATAbits_t;
extern volatile __LATAbits_t LATAbits __asm__ ("LATA") __attribute__((section("sfrs"), address(0xBF820030)));
extern volatile uint32_t        LATACLR __attribute__((section("sfrs"),address(0xBF820034)));
extern volatile uint32_t        LATASET __attribute__((section("sfrs"),address(0xBF820038)));
extern volatile uint32_t        LATAINV __attribute__((section("sfrs"),address(0xBF82003C)));
#define ODCA ODCA
extern volatile uint32_t   ODCA __attribute__((section("sfrs"), address(0xBF820040)));
typedef union {
  struct {
    uint32_t ODCA0:1;
    uint32_t ODCA1:1;
    uint32_t ODCA2:1;
    uint32_t ODCA3:1;
    uint32_t ODCA4:1;
    uint32_t ODCA5:1;
    uint32_t ODCA6:1;
    uint32_t ODCA7:1;
    uint32_t ODCA8:1;
    uint32_t ODCA9:1;
    uint32_t ODCA10:1;
    uint32_t ODCA11:1;
    uint32_t ODCA12:1;
    uint32_t ODCA13:1;
    uint32_t ODCA14:1;
    uint32_t ODCA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCAbits_t;
extern volatile __ODCAbits_t ODCAbits __asm__ ("ODCA") __attribute__((section("sfrs"), address(0xBF820040)));
extern volatile uint32_t        ODCACLR __attribute__((section("sfrs"),address(0xBF820044)));
extern volatile uint32_t        ODCASET __attribute__((section("sfrs"),address(0xBF820048)));
extern volatile uint32_t        ODCAINV __attribute__((section("sfrs"),address(0xBF82004C)));
#define CNPUA CNPUA
extern volatile uint32_t   CNPUA __attribute__((section("sfrs"), address(0xBF820050)));
typedef union {
  struct {
    uint32_t CNPUA0:1;
    uint32_t CNPUA1:1;
    uint32_t CNPUA2:1;
    uint32_t CNPUA3:1;
    uint32_t CNPUA4:1;
    uint32_t CNPUA5:1;
    uint32_t CNPUA6:1;
    uint32_t CNPUA7:1;
    uint32_t CNPUA8:1;
    uint32_t CNPUA9:1;
    uint32_t CNPUA10:1;
    uint32_t CNPUA11:1;
    uint32_t CNPUA12:1;
    uint32_t CNPUA13:1;
    uint32_t CNPUA14:1;
    uint32_t CNPUA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUAbits_t;
extern volatile __CNPUAbits_t CNPUAbits __asm__ ("CNPUA") __attribute__((section("sfrs"), address(0xBF820050)));
extern volatile uint32_t        CNPUACLR __attribute__((section("sfrs"),address(0xBF820054)));
extern volatile uint32_t        CNPUASET __attribute__((section("sfrs"),address(0xBF820058)));
extern volatile uint32_t        CNPUAINV __attribute__((section("sfrs"),address(0xBF82005C)));
#define CNPDA CNPDA
extern volatile uint32_t   CNPDA __attribute__((section("sfrs"), address(0xBF820060)));
typedef union {
  struct {
    uint32_t CNPDA0:1;
    uint32_t CNPDA1:1;
    uint32_t CNPDA2:1;
    uint32_t CNPDA3:1;
    uint32_t CNPDA4:1;
    uint32_t CNPDA5:1;
    uint32_t CNPDA6:1;
    uint32_t CNPDA7:1;
    uint32_t CNPDA8:1;
    uint32_t CNPDA9:1;
    uint32_t CNPDA10:1;
    uint32_t CNPDA11:1;
    uint32_t CNPDA12:1;
    uint32_t CNPDA13:1;
    uint32_t CNPDA14:1;
    uint32_t CNPDA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDAbits_t;
extern volatile __CNPDAbits_t CNPDAbits __asm__ ("CNPDA") __attribute__((section("sfrs"), address(0xBF820060)));
extern volatile uint32_t        CNPDACLR __attribute__((section("sfrs"),address(0xBF820064)));
extern volatile uint32_t        CNPDASET __attribute__((section("sfrs"),address(0xBF820068)));
extern volatile uint32_t        CNPDAINV __attribute__((section("sfrs"),address(0xBF82006C)));
#define CNCONA CNCONA
extern volatile uint32_t   CNCONA __attribute__((section("sfrs"), address(0xBF820070)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONAbits_t;
extern volatile __CNCONAbits_t CNCONAbits __asm__ ("CNCONA") __attribute__((section("sfrs"), address(0xBF820070)));
extern volatile uint32_t        CNCONACLR __attribute__((section("sfrs"),address(0xBF820074)));
extern volatile uint32_t        CNCONASET __attribute__((section("sfrs"),address(0xBF820078)));
extern volatile uint32_t        CNCONAINV __attribute__((section("sfrs"),address(0xBF82007C)));
#define CNENA CNENA
extern volatile uint32_t   CNENA __attribute__((section("sfrs"), address(0xBF820080)));
typedef union {
  struct {
    uint32_t CNIEA0:1;
    uint32_t CNIEA1:1;
    uint32_t CNIEA2:1;
    uint32_t CNIEA3:1;
    uint32_t CNIEA4:1;
    uint32_t CNIEA5:1;
    uint32_t CNIEA6:1;
    uint32_t CNIEA7:1;
    uint32_t CNIEA8:1;
    uint32_t CNIEA9:1;
    uint32_t CNIEA10:1;
    uint32_t CNIEA11:1;
    uint32_t CNIEA12:1;
    uint32_t CNIEA13:1;
    uint32_t CNIEA14:1;
    uint32_t CNIEA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENAbits_t;
extern volatile __CNENAbits_t CNENAbits __asm__ ("CNENA") __attribute__((section("sfrs"), address(0xBF820080)));
extern volatile uint32_t        CNENACLR __attribute__((section("sfrs"),address(0xBF820084)));
extern volatile uint32_t        CNENASET __attribute__((section("sfrs"),address(0xBF820088)));
extern volatile uint32_t        CNENAINV __attribute__((section("sfrs"),address(0xBF82008C)));
#define CNSTATA CNSTATA
extern volatile uint32_t   CNSTATA __attribute__((section("sfrs"), address(0xBF820090)));
typedef union {
  struct {
    uint32_t CNSTATA0:1;
    uint32_t CNSTATA1:1;
    uint32_t CNSTATA2:1;
    uint32_t CNSTATA3:1;
    uint32_t CNSTATA4:1;
    uint32_t CNSTATA5:1;
    uint32_t CNSTATA6:1;
    uint32_t CNSTATA7:1;
    uint32_t CNSTATA8:1;
    uint32_t CNSTATA9:1;
    uint32_t CNSTATA10:1;
    uint32_t CNSTATA11:1;
    uint32_t CNSTATA12:1;
    uint32_t CNSTATA13:1;
    uint32_t CNSTATA14:1;
    uint32_t CNSTATA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATAbits_t;
extern volatile __CNSTATAbits_t CNSTATAbits __asm__ ("CNSTATA") __attribute__((section("sfrs"), address(0xBF820090)));
extern volatile uint32_t        CNSTATACLR __attribute__((section("sfrs"),address(0xBF820094)));
extern volatile uint32_t        CNSTATASET __attribute__((section("sfrs"),address(0xBF820098)));
extern volatile uint32_t        CNSTATAINV __attribute__((section("sfrs"),address(0xBF82009C)));
#define CNNEA CNNEA
extern volatile uint32_t   CNNEA __attribute__((section("sfrs"), address(0xBF8200A0)));
typedef struct {
  uint32_t CNNEA0:1;
  uint32_t CNNEA1:1;
  uint32_t CNNEA2:1;
  uint32_t CNNEA3:1;
  uint32_t CNNEA4:1;
  uint32_t CNNEA5:1;
  uint32_t CNNEA6:1;
  uint32_t CNNEA7:1;
  uint32_t CNNEA8:1;
  uint32_t CNNEA9:1;
  uint32_t CNNEA10:1;
  uint32_t CNNEA11:1;
  uint32_t CNNEA12:1;
  uint32_t CNNEA13:1;
  uint32_t CNNEA14:1;
  uint32_t CNNEA15:1;
} __CNNEAbits_t;
extern volatile __CNNEAbits_t CNNEAbits __asm__ ("CNNEA") __attribute__((section("sfrs"), address(0xBF8200A0)));
extern volatile uint32_t        CNNEACLR __attribute__((section("sfrs"),address(0xBF8200A4)));
extern volatile uint32_t        CNNEASET __attribute__((section("sfrs"),address(0xBF8200A8)));
extern volatile uint32_t        CNNEAINV __attribute__((section("sfrs"),address(0xBF8200AC)));
#define CNFA CNFA
extern volatile uint32_t   CNFA __attribute__((section("sfrs"), address(0xBF8200B0)));
typedef struct {
  uint32_t CNFA0:1;
  uint32_t CNFA1:1;
  uint32_t CNFA2:1;
  uint32_t CNFA3:1;
  uint32_t CNFA4:1;
  uint32_t CNFA5:1;
  uint32_t CNFA6:1;
  uint32_t CNFA7:1;
  uint32_t CNFA8:1;
  uint32_t CNFA9:1;
  uint32_t CNFA10:1;
  uint32_t CNFA11:1;
  uint32_t CNFA12:1;
  uint32_t CNFA13:1;
  uint32_t CNFA14:1;
  uint32_t CNFA15:1;
} __CNFAbits_t;
