Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __CNFAbits_t CNFAbits __asm__ ("CNFA") __attribute__((section("sfrs"), address(0xBF8200B0)));
extern volatile uint32_t        CNFACLR __attribute__((section("sfrs"),address(0xBF8200B4)));
extern volatile uint32_t        CNFASET __attribute__((section("sfrs"),address(0xBF8200B8)));
extern volatile uint32_t        CNFAINV __attribute__((section("sfrs"),address(0xBF8200BC)));
#define SRCON0A SRCON0A
extern volatile uint32_t   SRCON0A __attribute__((section("sfrs"), address(0xBF8200C0)));
typedef struct {
  uint32_t SR0A0:1;
} __SRCON0Abits_t;
extern volatile __SRCON0Abits_t SRCON0Abits __asm__ ("SRCON0A") __attribute__((section("sfrs"), address(0xBF8200C0)));
extern volatile uint32_t        SRCON0ACLR __attribute__((section("sfrs"),address(0xBF8200C4)));
extern volatile uint32_t        SRCON0ASET __attribute__((section("sfrs"),address(0xBF8200C8)));
extern volatile uint32_t        SRCON0AINV __attribute__((section("sfrs"),address(0xBF8200CC)));
#define SRCON1A SRCON1A
extern volatile uint32_t   SRCON1A __attribute__((section("sfrs"), address(0xBF8200D0)));
typedef struct {
  uint32_t SR1A0:1;
} __SRCON1Abits_t;
extern volatile __SRCON1Abits_t SRCON1Abits __asm__ ("SRCON1A") __attribute__((section("sfrs"), address(0xBF8200D0)));
extern volatile uint32_t        SRCON1ACLR __attribute__((section("sfrs"),address(0xBF8200D4)));
extern volatile uint32_t        SRCON1ASET __attribute__((section("sfrs"),address(0xBF8200D8)));
extern volatile uint32_t        SRCON1AINV __attribute__((section("sfrs"),address(0xBF8200DC)));
#define ANSELB ANSELB
extern volatile uint32_t   ANSELB __attribute__((section("sfrs"), address(0xBF820100)));
typedef union {
  struct {
    uint32_t ANSB0:1;
    uint32_t ANSB1:1;
    uint32_t ANSB2:1;
    uint32_t ANSB3:1;
    uint32_t ANSB4:1;
    uint32_t ANSB5:1;
    uint32_t ANSB6:1;
    uint32_t ANSB7:1;
    uint32_t ANSB8:1;
    uint32_t ANSB9:1;
    uint32_t ANSB10:1;
    uint32_t ANSB11:1;
    uint32_t ANSB12:1;
    uint32_t ANSB13:1;
    uint32_t ANSB14:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELBbits_t;
extern volatile __ANSELBbits_t ANSELBbits __asm__ ("ANSELB") __attribute__((section("sfrs"), address(0xBF820100)));
extern volatile uint32_t        ANSELBCLR __attribute__((section("sfrs"),address(0xBF820104)));
extern volatile uint32_t        ANSELBSET __attribute__((section("sfrs"),address(0xBF820108)));
extern volatile uint32_t        ANSELBINV __attribute__((section("sfrs"),address(0xBF82010C)));
#define TRISB TRISB
extern volatile uint32_t   TRISB __attribute__((section("sfrs"), address(0xBF820110)));
typedef union {
  struct {
    uint32_t TRISB0:1;
    uint32_t TRISB1:1;
    uint32_t TRISB2:1;
    uint32_t TRISB3:1;
    uint32_t TRISB4:1;
    uint32_t TRISB5:1;
    uint32_t TRISB6:1;
    uint32_t TRISB7:1;
    uint32_t TRISB8:1;
    uint32_t TRISB9:1;
    uint32_t TRISB10:1;
    uint32_t TRISB11:1;
    uint32_t TRISB12:1;
    uint32_t TRISB13:1;
    uint32_t TRISB14:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISBbits_t;
extern volatile __TRISBbits_t TRISBbits __asm__ ("TRISB") __attribute__((section("sfrs"), address(0xBF820110)));
extern volatile uint32_t        TRISBCLR __attribute__((section("sfrs"),address(0xBF820114)));
extern volatile uint32_t        TRISBSET __attribute__((section("sfrs"),address(0xBF820118)));
extern volatile uint32_t        TRISBINV __attribute__((section("sfrs"),address(0xBF82011C)));
#define PORTB PORTB
extern volatile uint32_t   PORTB __attribute__((section("sfrs"), address(0xBF820120)));
typedef union {
  struct {
    uint32_t RB0:1;
    uint32_t RB1:1;
    uint32_t RB2:1;
    uint32_t RB3:1;
    uint32_t RB4:1;
    uint32_t RB5:1;
    uint32_t RB6:1;
    uint32_t RB7:1;
    uint32_t RB8:1;
    uint32_t RB9:1;
    uint32_t RB10:1;
    uint32_t RB11:1;
    uint32_t RB12:1;
    uint32_t RB13:1;
    uint32_t RB14:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTBbits_t;
extern volatile __PORTBbits_t PORTBbits __asm__ ("PORTB") __attribute__((section("sfrs"), address(0xBF820120)));
extern volatile uint32_t        PORTBCLR __attribute__((section("sfrs"),address(0xBF820124)));
extern volatile uint32_t        PORTBSET __attribute__((section("sfrs"),address(0xBF820128)));
extern volatile uint32_t        PORTBINV __attribute__((section("sfrs"),address(0xBF82012C)));
#define LATB LATB
extern volatile uint32_t   LATB __attribute__((section("sfrs"), address(0xBF820130)));
typedef union {
  struct {
    uint32_t LATB0:1;
    uint32_t LATB1:1;
    uint32_t LATB2:1;
    uint32_t LATB3:1;
    uint32_t LATB4:1;
    uint32_t LATB5:1;
    uint32_t LATB6:1;
    uint32_t LATB7:1;
    uint32_t LATB8:1;
    uint32_t LATB9:1;
    uint32_t LATB10:1;
    uint32_t LATB11:1;
    uint32_t LATB12:1;
    uint32_t LATB13:1;
    uint32_t LATB14:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATBbits_t;
extern volatile __LATBbits_t LATBbits __asm__ ("LATB") __attribute__((section("sfrs"), address(0xBF820130)));
extern volatile uint32_t        LATBCLR __attribute__((section("sfrs"),address(0xBF820134)));
extern volatile uint32_t        LATBSET __attribute__((section("sfrs"),address(0xBF820138)));
extern volatile uint32_t        LATBINV __attribute__((section("sfrs"),address(0xBF82013C)));
#define ODCB ODCB
extern volatile uint32_t   ODCB __attribute__((section("sfrs"), address(0xBF820140)));
typedef union {
  struct {
    uint32_t ODCB0:1;
    uint32_t ODCB1:1;
    uint32_t ODCB2:1;
    uint32_t ODCB3:1;
    uint32_t ODCB4:1;
    uint32_t ODCB5:1;
    uint32_t ODCB6:1;
    uint32_t ODCB7:1;
    uint32_t ODCB8:1;
    uint32_t ODCB9:1;
    uint32_t ODCB10:1;
    uint32_t ODCB11:1;
    uint32_t ODCB12:1;
    uint32_t ODCB13:1;
    uint32_t ODCB14:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCBbits_t;
extern volatile __ODCBbits_t ODCBbits __asm__ ("ODCB") __attribute__((section("sfrs"), address(0xBF820140)));
extern volatile uint32_t        ODCBCLR __attribute__((section("sfrs"),address(0xBF820144)));
extern volatile uint32_t        ODCBSET __attribute__((section("sfrs"),address(0xBF820148)));
extern volatile uint32_t        ODCBINV __attribute__((section("sfrs"),address(0xBF82014C)));
#define CNPUB CNPUB
extern volatile uint32_t   CNPUB __attribute__((section("sfrs"), address(0xBF820150)));
typedef union {
  struct {
    uint32_t CNPUB0:1;
    uint32_t CNPUB1:1;
    uint32_t CNPUB2:1;
    uint32_t CNPUB3:1;
    uint32_t CNPUB4:1;
    uint32_t CNPUB5:1;
    uint32_t CNPUB6:1;
    uint32_t CNPUB7:1;
    uint32_t CNPUB8:1;
    uint32_t CNPUB9:1;
    uint32_t CNPUB10:1;
    uint32_t CNPUB11:1;
    uint32_t CNPUB12:1;
    uint32_t CNPUB13:1;
    uint32_t CNPUB14:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUBbits_t;
extern volatile __CNPUBbits_t CNPUBbits __asm__ ("CNPUB") __attribute__((section("sfrs"), address(0xBF820150)));
extern volatile uint32_t        CNPUBCLR __attribute__((section("sfrs"),address(0xBF820154)));
extern volatile uint32_t        CNPUBSET __attribute__((section("sfrs"),address(0xBF820158)));
extern volatile uint32_t        CNPUBINV __attribute__((section("sfrs"),address(0xBF82015C)));
#define CNPDB CNPDB
extern volatile uint32_t   CNPDB __attribute__((section("sfrs"), address(0xBF820160)));
typedef union {
  struct {
    uint32_t CNPDB0:1;
    uint32_t CNPDB1:1;
    uint32_t CNPDB2:1;
    uint32_t CNPDB3:1;
    uint32_t CNPDB4:1;
    uint32_t CNPDB5:1;
    uint32_t CNPDB6:1;
    uint32_t CNPDB7:1;
    uint32_t CNPDB8:1;
    uint32_t CNPDB9:1;
    uint32_t CNPDB10:1;
    uint32_t CNPDB11:1;
    uint32_t CNPDB12:1;
    uint32_t CNPDB13:1;
    uint32_t CNPDB14:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDBbits_t;
extern volatile __CNPDBbits_t CNPDBbits __asm__ ("CNPDB") __attribute__((section("sfrs"), address(0xBF820160)));
extern volatile uint32_t        CNPDBCLR __attribute__((section("sfrs"),address(0xBF820164)));
extern volatile uint32_t        CNPDBSET __attribute__((section("sfrs"),address(0xBF820168)));
extern volatile uint32_t        CNPDBINV __attribute__((section("sfrs"),address(0xBF82016C)));
#define CNCONB CNCONB
extern volatile uint32_t   CNCONB __attribute__((section("sfrs"), address(0xBF820170)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONBbits_t;
extern volatile __CNCONBbits_t CNCONBbits __asm__ ("CNCONB") __attribute__((section("sfrs"), address(0xBF820170)));
extern volatile uint32_t        CNCONBCLR __attribute__((section("sfrs"),address(0xBF820174)));
extern volatile uint32_t        CNCONBSET __attribute__((section("sfrs"),address(0xBF820178)));
extern volatile uint32_t        CNCONBINV __attribute__((section("sfrs"),address(0xBF82017C)));
#define CNENB CNENB
extern volatile uint32_t   CNENB __attribute__((section("sfrs"), address(0xBF820180)));
typedef union {
  struct {
    uint32_t CNIEB0:1;
    uint32_t CNIEB1:1;
    uint32_t CNIEB2:1;
    uint32_t CNIEB3:1;
    uint32_t CNIEB4:1;
    uint32_t CNIEB5:1;
    uint32_t CNIEB6:1;
    uint32_t CNIEB7:1;
    uint32_t CNIEB8:1;
    uint32_t CNIEB9:1;
    uint32_t CNIEB10:1;
    uint32_t CNIEB11:1;
    uint32_t CNIEB12:1;
    uint32_t CNIEB13:1;
    uint32_t CNIEB14:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENBbits_t;
extern volatile __CNENBbits_t CNENBbits __asm__ ("CNENB") __attribute__((section("sfrs"), address(0xBF820180)));
extern volatile uint32_t        CNENBCLR __attribute__((section("sfrs"),address(0xBF820184)));
extern volatile uint32_t        CNENBSET __attribute__((section("sfrs"),address(0xBF820188)));
extern volatile uint32_t        CNENBINV __attribute__((section("sfrs"),address(0xBF82018C)));
#define CNSTATB CNSTATB
extern volatile uint32_t   CNSTATB __attribute__((section("sfrs"), address(0xBF820190)));
typedef union {
  struct {
    uint32_t CNSTATB0:1;
    uint32_t CNSTATB1:1;
    uint32_t CNSTATB2:1;
    uint32_t CNSTATB3:1;
    uint32_t CNSTATB4:1;
    uint32_t CNSTATB5:1;
    uint32_t CNSTATB6:1;
    uint32_t CNSTATB7:1;
    uint32_t CNSTATB8:1;
    uint32_t CNSTATB9:1;
    uint32_t CNSTATB10:1;
    uint32_t CNSTATB11:1;
    uint32_t CNSTATB12:1;
    uint32_t CNSTATB13:1;
    uint32_t CNSTATB14:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATBbits_t;
extern volatile __CNSTATBbits_t CNSTATBbits __asm__ ("CNSTATB") __attribute__((section("sfrs"), address(0xBF820190)));
extern volatile uint32_t        CNSTATBCLR __attribute__((section("sfrs"),address(0xBF820194)));
extern volatile uint32_t        CNSTATBSET __attribute__((section("sfrs"),address(0xBF820198)));
extern volatile uint32_t        CNSTATBINV __attribute__((section("sfrs"),address(0xBF82019C)));
#define CNNEB CNNEB
extern volatile uint32_t   CNNEB __attribute__((section("sfrs"), address(0xBF8201A0)));
typedef struct {
  uint32_t CNNEB0:1;
  uint32_t CNNEB1:1;
  uint32_t CNNEB2:1;
  uint32_t CNNEB3:1;
  uint32_t CNNEB4:1;
  uint32_t CNNEB5:1;
  uint32_t CNNEB6:1;
  uint32_t CNNEB7:1;
  uint32_t CNNEB8:1;
  uint32_t CNNEB9:1;
  uint32_t CNNEB10:1;
  uint32_t CNNEB11:1;
  uint32_t CNNEB12:1;
  uint32_t CNNEB13:1;
  uint32_t CNNEB14:1;
} __CNNEBbits_t;
extern volatile __CNNEBbits_t CNNEBbits __asm__ ("CNNEB") __attribute__((section("sfrs"), address(0xBF8201A0)));
extern volatile uint32_t        CNNEBCLR __attribute__((section("sfrs"),address(0xBF8201A4)));
extern volatile uint32_t        CNNEBSET __attribute__((section("sfrs"),address(0xBF8201A8)));
extern volatile uint32_t        CNNEBINV __attribute__((section("sfrs"),address(0xBF8201AC)));
#define CNFB CNFB
extern volatile uint32_t   CNFB __attribute__((section("sfrs"), address(0xBF8201B0)));
typedef struct {
  uint32_t CNFB0:1;
  uint32_t CNFB1:1;
  uint32_t CNFB2:1;
  uint32_t CNFB3:1;
  uint32_t CNFB4:1;
  uint32_t CNFB5:1;
  uint32_t CNFB6:1;
  uint32_t CNFB7:1;
  uint32_t CNFB8:1;
  uint32_t CNFB9:1;
  uint32_t CNFB10:1;
  uint32_t CNFB11:1;
  uint32_t CNFB12:1;
  uint32_t CNFB13:1;
  uint32_t CNFB14:1;
} __CNFBbits_t;
extern volatile __CNFBbits_t CNFBbits __asm__ ("CNFB") __attribute__((section("sfrs"), address(0xBF8201B0)));
extern volatile uint32_t        CNFBCLR __attribute__((section("sfrs"),address(0xBF8201B4)));
extern volatile uint32_t        CNFBSET __attribute__((section("sfrs"),address(0xBF8201B8)));
extern volatile uint32_t        CNFBINV __attribute__((section("sfrs"),address(0xBF8201BC)));
#define TRISC TRISC
extern volatile uint32_t   TRISC __attribute__((section("sfrs"), address(0xBF820210)));
typedef union {
  struct {
    uint32_t TRISC0:1;
    uint32_t TRISC1:1;
    uint32_t TRISC2:1;
    uint32_t TRISC3:1;
    uint32_t TRISC4:1;
    uint32_t TRISC5:1;
    uint32_t TRISC6:1;
    uint32_t TRISC7:1;
    uint32_t TRISC8:1;
    uint32_t TRISC9:1;
    uint32_t TRISC10:1;
    uint32_t TRISC11:1;
    uint32_t TRISC12:1;
    uint32_t TRISC13:1;
    uint32_t TRISC14:1;
    uint32_t TRISC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISCbits_t;
extern volatile __TRISCbits_t TRISCbits __asm__ ("TRISC") __attribute__((section("sfrs"), address(0xBF820210)));
extern volatile uint32_t        TRISCCLR __attribute__((section("sfrs"),address(0xBF820214)));
extern volatile uint32_t        TRISCSET __attribute__((section("sfrs"),address(0xBF820218)));
extern volatile uint32_t        TRISCINV __attribute__((section("sfrs"),address(0xBF82021C)));
#define PORTC PORTC
extern volatile uint32_t   PORTC __attribute__((section("sfrs"), address(0xBF820220)));
typedef union {
  struct {
    uint32_t RC0:1;
    uint32_t RC1:1;
    uint32_t RC2:1;
    uint32_t RC3:1;
    uint32_t RC4:1;
    uint32_t RC5:1;
    uint32_t RC6:1;
    uint32_t RC7:1;
    uint32_t RC8:1;
    uint32_t RC9:1;
    uint32_t RC10:1;
    uint32_t RC11:1;
    uint32_t RC12:1;
    uint32_t RC13:1;
    uint32_t RC14:1;
    uint32_t RC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTCbits_t;
extern volatile __PORTCbits_t PORTCbits __asm__ ("PORTC") __attribute__((section("sfrs"), address(0xBF820220)));
extern volatile uint32_t        PORTCCLR __attribute__((section("sfrs"),address(0xBF820224)));
extern volatile uint32_t        PORTCSET __attribute__((section("sfrs"),address(0xBF820228)));
extern volatile uint32_t        PORTCINV __attribute__((section("sfrs"),address(0xBF82022C)));
#define LATC LATC
extern volatile uint32_t   LATC __attribute__((section("sfrs"), address(0xBF820230)));
typedef union {
  struct {
    uint32_t LATC0:1;
    uint32_t LATC1:1;
    uint32_t LATC2:1;
    uint32_t LATC3:1;
    uint32_t LATC4:1;
    uint32_t LATC5:1;
    uint32_t LATC6:1;
    uint32_t LATC7:1;
    uint32_t LATC8:1;
    uint32_t LATC9:1;
    uint32_t LATC10:1;
    uint32_t LATC11:1;
    uint32_t LATC12:1;
    uint32_t LATC13:1;
    uint32_t LATC14:1;
    uint32_t LATC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATCbits_t;
extern volatile __LATCbits_t LATCbits __asm__ ("LATC") __attribute__((section("sfrs"), address(0xBF820230)));
extern volatile uint32_t        LATCCLR __attribute__((section("sfrs"),address(0xBF820234)));
extern volatile uint32_t        LATCSET __attribute__((section("sfrs"),address(0xBF820238)));
extern volatile uint32_t        LATCINV __attribute__((section("sfrs"),address(0xBF82023C)));
#define ODCC ODCC
extern volatile uint32_t   ODCC __attribute__((section("sfrs"), address(0xBF820240)));
typedef union {
  struct {
    uint32_t ODCC0:1;
    uint32_t ODCC1:1;
    uint32_t ODCC2:1;
    uint32_t ODCC3:1;
    uint32_t ODCC4:1;
    uint32_t ODCC5:1;
    uint32_t ODCC6:1;
    uint32_t ODCC7:1;
    uint32_t ODCC8:1;
    uint32_t ODCC9:1;
    uint32_t ODCC10:1;
    uint32_t ODCC11:1;
    uint32_t ODCC12:1;
    uint32_t ODCC13:1;
    uint32_t ODCC14:1;
    uint32_t ODCC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCCbits_t;
extern volatile __ODCCbits_t ODCCbits __asm__ ("ODCC") __attribute__((section("sfrs"), address(0xBF820240)));
extern volatile uint32_t        ODCCCLR __attribute__((section("sfrs"),address(0xBF820244)));
extern volatile uint32_t        ODCCSET __attribute__((section("sfrs"),address(0xBF820248)));
extern volatile uint32_t        ODCCINV __attribute__((section("sfrs"),address(0xBF82024C)));
#define CNPUC CNPUC
extern volatile uint32_t   CNPUC __attribute__((section("sfrs"), address(0xBF820250)));
typedef union {
  struct {
    uint32_t CNPUC0:1;
    uint32_t CNPUC1:1;
    uint32_t CNPUC2:1;
    uint32_t CNPUC3:1;
    uint32_t CNPUC4:1;
    uint32_t CNPUC5:1;
    uint32_t CNPUC6:1;
    uint32_t CNPUC7:1;
    uint32_t CNPUC8:1;
    uint32_t CNPUC9:1;
    uint32_t CNPUC10:1;
    uint32_t CNPUC11:1;
    uint32_t CNPUC12:1;
    uint32_t CNPUC13:1;
    uint32_t CNPUC14:1;
    uint32_t CNPUC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUCbits_t;
extern volatile __CNPUCbits_t CNPUCbits __asm__ ("CNPUC") __attribute__((section("sfrs"), address(0xBF820250)));
extern volatile uint32_t        CNPUCCLR __attribute__((section("sfrs"),address(0xBF820254)));
extern volatile uint32_t        CNPUCSET __attribute__((section("sfrs"),address(0xBF820258)));
extern volatile uint32_t        CNPUCINV __attribute__((section("sfrs"),address(0xBF82025C)));
#define CNPDC CNPDC
extern volatile uint32_t   CNPDC __attribute__((section("sfrs"), address(0xBF820260)));
typedef union {
  struct {
    uint32_t CNPDC0:1;
    uint32_t CNPDC1:1;
    uint32_t CNPDC2:1;
    uint32_t CNPDC3:1;
    uint32_t CNPDC4:1;
    uint32_t CNPDC5:1;
    uint32_t CNPDC6:1;
    uint32_t CNPDC7:1;
    uint32_t CNPDC8:1;
    uint32_t CNPDC9:1;
    uint32_t CNPDC10:1;
    uint32_t CNPDC11:1;
    uint32_t CNPDC12:1;
    uint32_t CNPDC13:1;
    uint32_t CNPDC14:1;
    uint32_t CNPDC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDCbits_t;
extern volatile __CNPDCbits_t CNPDCbits __asm__ ("CNPDC") __attribute__((section("sfrs"), address(0xBF820260)));
extern volatile uint32_t        CNPDCCLR __attribute__((section("sfrs"),address(0xBF820264)));
extern volatile uint32_t        CNPDCSET __attribute__((section("sfrs"),address(0xBF820268)));
extern volatile uint32_t        CNPDCINV __attribute__((section("sfrs"),address(0xBF82026C)));
#define CNCONC CNCONC
extern volatile uint32_t   CNCONC __attribute__((section("sfrs"), address(0xBF820270)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONCbits_t;
