Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __LATKbits_t LATKbits __asm__ ("LATK") __attribute__((section("sfrs"), address(0xBF820330)));
extern volatile uint32_t        LATKCLR __attribute__((section("sfrs"),address(0xBF820334)));
extern volatile uint32_t        LATKSET __attribute__((section("sfrs"),address(0xBF820338)));
extern volatile uint32_t        LATKINV __attribute__((section("sfrs"),address(0xBF82033C)));
#define ODCK ODCK
extern volatile uint32_t   ODCK __attribute__((section("sfrs"), address(0xBF820340)));
typedef union {
  struct {
    uint32_t ODCK0:1;
    uint32_t ODCK1:1;
    uint32_t ODCK2:1;
    uint32_t ODCK3:1;
    uint32_t ODCK4:1;
    uint32_t ODCK5:1;
    uint32_t ODCK6:1;
    uint32_t ODCK7:1;
    uint32_t ODCK8:1;
    uint32_t ODCK9:1;
    uint32_t ODCK10:1;
    uint32_t ODCK11:1;
    uint32_t ODCK12:1;
    uint32_t ODCK13:1;
    uint32_t ODCK14:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCKbits_t;
extern volatile __ODCKbits_t ODCKbits __asm__ ("ODCK") __attribute__((section("sfrs"), address(0xBF820340)));
extern volatile uint32_t        ODCKCLR __attribute__((section("sfrs"),address(0xBF820344)));
extern volatile uint32_t        ODCKSET __attribute__((section("sfrs"),address(0xBF820348)));
extern volatile uint32_t        ODCKINV __attribute__((section("sfrs"),address(0xBF82034C)));
#define CNPUK CNPUK
extern volatile uint32_t   CNPUK __attribute__((section("sfrs"), address(0xBF820350)));
typedef union {
  struct {
    uint32_t CNPUK0:1;
    uint32_t CNPUK1:1;
    uint32_t CNPUK2:1;
    uint32_t CNPUK3:1;
    uint32_t CNPUK4:1;
    uint32_t CNPUK5:1;
    uint32_t CNPUK6:1;
    uint32_t CNPUK7:1;
    uint32_t CNPUK8:1;
    uint32_t CNPUK9:1;
    uint32_t CNPUK10:1;
    uint32_t CNPUK11:1;
    uint32_t CNPUK12:1;
    uint32_t CNPUK13:1;
    uint32_t CNPUK14:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUKbits_t;
extern volatile __CNPUKbits_t CNPUKbits __asm__ ("CNPUK") __attribute__((section("sfrs"), address(0xBF820350)));
extern volatile uint32_t        CNPUKCLR __attribute__((section("sfrs"),address(0xBF820354)));
extern volatile uint32_t        CNPUKSET __attribute__((section("sfrs"),address(0xBF820358)));
extern volatile uint32_t        CNPUKINV __attribute__((section("sfrs"),address(0xBF82035C)));
#define CNPDK CNPDK
extern volatile uint32_t   CNPDK __attribute__((section("sfrs"), address(0xBF820360)));
typedef union {
  struct {
    uint32_t CNPDK0:1;
    uint32_t CNPDK1:1;
    uint32_t CNPDK2:1;
    uint32_t CNPDK3:1;
    uint32_t CNPDK4:1;
    uint32_t CNPDK5:1;
    uint32_t CNPDK6:1;
    uint32_t CNPDK7:1;
    uint32_t CNPDK8:1;
    uint32_t CNPDK9:1;
    uint32_t CNPDK10:1;
    uint32_t CNPDK11:1;
    uint32_t CNPDK12:1;
    uint32_t CNPDK13:1;
    uint32_t CNPDK14:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDKbits_t;
extern volatile __CNPDKbits_t CNPDKbits __asm__ ("CNPDK") __attribute__((section("sfrs"), address(0xBF820360)));
extern volatile uint32_t        CNPDKCLR __attribute__((section("sfrs"),address(0xBF820364)));
extern volatile uint32_t        CNPDKSET __attribute__((section("sfrs"),address(0xBF820368)));
extern volatile uint32_t        CNPDKINV __attribute__((section("sfrs"),address(0xBF82036C)));
#define CNCONK CNCONK
extern volatile uint32_t   CNCONK __attribute__((section("sfrs"), address(0xBF820370)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONKbits_t;
extern volatile __CNCONKbits_t CNCONKbits __asm__ ("CNCONK") __attribute__((section("sfrs"), address(0xBF820370)));
extern volatile uint32_t        CNCONKCLR __attribute__((section("sfrs"),address(0xBF820374)));
extern volatile uint32_t        CNCONKSET __attribute__((section("sfrs"),address(0xBF820378)));
extern volatile uint32_t        CNCONKINV __attribute__((section("sfrs"),address(0xBF82037C)));
#define CNENK CNENK
extern volatile uint32_t   CNENK __attribute__((section("sfrs"), address(0xBF820380)));
typedef union {
  struct {
    uint32_t CNIEK0:1;
    uint32_t CNIEK1:1;
    uint32_t CNIEK2:1;
    uint32_t CNIEK3:1;
    uint32_t CNIEK4:1;
    uint32_t CNIEK5:1;
    uint32_t CNIEK6:1;
    uint32_t CNIEK7:1;
    uint32_t CNIEK8:1;
    uint32_t CNIEK9:1;
    uint32_t CNIEK10:1;
    uint32_t CNIEK11:1;
    uint32_t CNIEK12:1;
    uint32_t CNIEK13:1;
    uint32_t CNIEK14:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENKbits_t;
extern volatile __CNENKbits_t CNENKbits __asm__ ("CNENK") __attribute__((section("sfrs"), address(0xBF820380)));
extern volatile uint32_t        CNENKCLR __attribute__((section("sfrs"),address(0xBF820384)));
extern volatile uint32_t        CNENKSET __attribute__((section("sfrs"),address(0xBF820388)));
extern volatile uint32_t        CNENKINV __attribute__((section("sfrs"),address(0xBF82038C)));
#define CNSTATK CNSTATK
extern volatile uint32_t   CNSTATK __attribute__((section("sfrs"), address(0xBF820390)));
typedef union {
  struct {
    uint32_t CNSTATK0:1;
    uint32_t CNSTATK1:1;
    uint32_t CNSTATK2:1;
    uint32_t CNSTATK3:1;
    uint32_t CNSTATK4:1;
    uint32_t CNSTATK5:1;
    uint32_t CNSTATK6:1;
    uint32_t CNSTATK7:1;
    uint32_t CNSTATK8:1;
    uint32_t CNSTATK9:1;
    uint32_t CNSTATK10:1;
    uint32_t CNSTATK11:1;
    uint32_t CNSTATK12:1;
    uint32_t CNSTATK13:1;
    uint32_t CNSTATK14:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATKbits_t;
extern volatile __CNSTATKbits_t CNSTATKbits __asm__ ("CNSTATK") __attribute__((section("sfrs"), address(0xBF820390)));
extern volatile uint32_t        CNSTATKCLR __attribute__((section("sfrs"),address(0xBF820394)));
extern volatile uint32_t        CNSTATKSET __attribute__((section("sfrs"),address(0xBF820398)));
extern volatile uint32_t        CNSTATKINV __attribute__((section("sfrs"),address(0xBF82039C)));
#define CNNEK CNNEK
extern volatile uint32_t   CNNEK __attribute__((section("sfrs"), address(0xBF8203A0)));
typedef struct {
  uint32_t CNNEK0:1;
  uint32_t CNNEK1:1;
  uint32_t CNNEK2:1;
  uint32_t CNNEK3:1;
  uint32_t CNNEK4:1;
  uint32_t CNNEK5:1;
  uint32_t CNNEK6:1;
  uint32_t CNNEK7:1;
  uint32_t CNNEK8:1;
  uint32_t CNNEK9:1;
  uint32_t CNNEK10:1;
  uint32_t CNNEK11:1;
  uint32_t CNNEK12:1;
  uint32_t CNNEK13:1;
  uint32_t CNNEK14:1;
} __CNNEKbits_t;
extern volatile __CNNEKbits_t CNNEKbits __asm__ ("CNNEK") __attribute__((section("sfrs"), address(0xBF8203A0)));
extern volatile uint32_t        CNNEKCLR __attribute__((section("sfrs"),address(0xBF8203A4)));
extern volatile uint32_t        CNNEKSET __attribute__((section("sfrs"),address(0xBF8203A8)));
extern volatile uint32_t        CNNEKINV __attribute__((section("sfrs"),address(0xBF8203AC)));
#define CNFK CNFK
extern volatile uint32_t   CNFK __attribute__((section("sfrs"), address(0xBF8203B0)));
typedef struct {
  uint32_t CNFK0:1;
  uint32_t CNFK1:1;
  uint32_t CNFK2:1;
  uint32_t CNFK3:1;
  uint32_t CNFK4:1;
  uint32_t CNFK5:1;
  uint32_t CNFK6:1;
  uint32_t CNFK7:1;
  uint32_t CNFK8:1;
  uint32_t CNFK9:1;
  uint32_t CNFK10:1;
  uint32_t CNFK11:1;
  uint32_t CNFK12:1;
  uint32_t CNFK13:1;
  uint32_t CNFK14:1;
} __CNFKbits_t;
extern volatile __CNFKbits_t CNFKbits __asm__ ("CNFK") __attribute__((section("sfrs"), address(0xBF8203B0)));
extern volatile uint32_t        CNFKCLR __attribute__((section("sfrs"),address(0xBF8203B4)));
extern volatile uint32_t        CNFKSET __attribute__((section("sfrs"),address(0xBF8203B8)));
extern volatile uint32_t        CNFKINV __attribute__((section("sfrs"),address(0xBF8203BC)));
#define SRCON0K SRCON0K
extern volatile uint32_t   SRCON0K __attribute__((section("sfrs"), address(0xBF8203C0)));
typedef struct {
  uint32_t :13;
  uint32_t SR0K13:1;
  uint32_t SR0K14:1;
} __SRCON0Kbits_t;
extern volatile __SRCON0Kbits_t SRCON0Kbits __asm__ ("SRCON0K") __attribute__((section("sfrs"), address(0xBF8203C0)));
extern volatile uint32_t        SRCON0KCLR __attribute__((section("sfrs"),address(0xBF8203C4)));
extern volatile uint32_t        SRCON0KSET __attribute__((section("sfrs"),address(0xBF8203C8)));
extern volatile uint32_t        SRCON0KINV __attribute__((section("sfrs"),address(0xBF8203CC)));
#define SRCON1K SRCON1K
extern volatile uint32_t   SRCON1K __attribute__((section("sfrs"), address(0xBF8203D0)));
typedef struct {
  uint32_t :13;
  uint32_t SR1K13:1;
  uint32_t SR1K14:1;
} __SRCON1Kbits_t;
extern volatile __SRCON1Kbits_t SRCON1Kbits __asm__ ("SRCON1K") __attribute__((section("sfrs"), address(0xBF8203D0)));
extern volatile uint32_t        SRCON1KCLR __attribute__((section("sfrs"),address(0xBF8203D4)));
extern volatile uint32_t        SRCON1KSET __attribute__((section("sfrs"),address(0xBF8203D8)));
extern volatile uint32_t        SRCON1KINV __attribute__((section("sfrs"),address(0xBF8203DC)));
#define I2C1CON I2C1CON
extern volatile uint32_t   I2C1CON __attribute__((section("sfrs"), address(0xBF820400)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t DHEN:1;
    uint32_t AHEN:1;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C1CONbits_t;
extern volatile __I2C1CONbits_t I2C1CONbits __asm__ ("I2C1CON") __attribute__((section("sfrs"), address(0xBF820400)));
extern volatile uint32_t        I2C1CONCLR __attribute__((section("sfrs"),address(0xBF820404)));
extern volatile uint32_t        I2C1CONSET __attribute__((section("sfrs"),address(0xBF820408)));
extern volatile uint32_t        I2C1CONINV __attribute__((section("sfrs"),address(0xBF82040C)));
#define I2C1STAT I2C1STAT
extern volatile uint32_t   I2C1STAT __attribute__((section("sfrs"), address(0xBF820410)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C1STATbits_t;
extern volatile __I2C1STATbits_t I2C1STATbits __asm__ ("I2C1STAT") __attribute__((section("sfrs"), address(0xBF820410)));
extern volatile uint32_t        I2C1STATCLR __attribute__((section("sfrs"),address(0xBF820414)));
extern volatile uint32_t        I2C1STATSET __attribute__((section("sfrs"),address(0xBF820418)));
extern volatile uint32_t        I2C1STATINV __attribute__((section("sfrs"),address(0xBF82041C)));
#define I2C1ADD I2C1ADD
extern volatile uint32_t   I2C1ADD __attribute__((section("sfrs"), address(0xBF820420)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C1ADDbits_t;
extern volatile __I2C1ADDbits_t I2C1ADDbits __asm__ ("I2C1ADD") __attribute__((section("sfrs"), address(0xBF820420)));
extern volatile uint32_t        I2C1ADDCLR __attribute__((section("sfrs"),address(0xBF820424)));
extern volatile uint32_t        I2C1ADDSET __attribute__((section("sfrs"),address(0xBF820428)));
extern volatile uint32_t        I2C1ADDINV __attribute__((section("sfrs"),address(0xBF82042C)));
#define I2C1MSK I2C1MSK
extern volatile uint32_t   I2C1MSK __attribute__((section("sfrs"), address(0xBF820430)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C1MSKbits_t;
