Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __I2C1MSKbits_t I2C1MSKbits __asm__ ("I2C1MSK") __attribute__((section("sfrs"), address(0xBF820430)));
extern volatile uint32_t        I2C1MSKCLR __attribute__((section("sfrs"),address(0xBF820434)));
extern volatile uint32_t        I2C1MSKSET __attribute__((section("sfrs"),address(0xBF820438)));
extern volatile uint32_t        I2C1MSKINV __attribute__((section("sfrs"),address(0xBF82043C)));
#define I2C1BRG I2C1BRG
extern volatile uint32_t   I2C1BRG __attribute__((section("sfrs"), address(0xBF820440)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C1BRGbits_t;
extern volatile __I2C1BRGbits_t I2C1BRGbits __asm__ ("I2C1BRG") __attribute__((section("sfrs"), address(0xBF820440)));
extern volatile uint32_t        I2C1BRGCLR __attribute__((section("sfrs"),address(0xBF820444)));
extern volatile uint32_t        I2C1BRGSET __attribute__((section("sfrs"),address(0xBF820448)));
extern volatile uint32_t        I2C1BRGINV __attribute__((section("sfrs"),address(0xBF82044C)));
#define I2C1TRN I2C1TRN
extern volatile uint32_t   I2C1TRN __attribute__((section("sfrs"), address(0xBF820450)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C1TRNbits_t;
extern volatile __I2C1TRNbits_t I2C1TRNbits __asm__ ("I2C1TRN") __attribute__((section("sfrs"), address(0xBF820450)));
extern volatile uint32_t        I2C1TRNCLR __attribute__((section("sfrs"),address(0xBF820454)));
extern volatile uint32_t        I2C1TRNSET __attribute__((section("sfrs"),address(0xBF820458)));
extern volatile uint32_t        I2C1TRNINV __attribute__((section("sfrs"),address(0xBF82045C)));
#define I2C1RCV I2C1RCV
extern volatile uint32_t   I2C1RCV __attribute__((section("sfrs"), address(0xBF820460)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C1RCVbits_t;
extern volatile __I2C1RCVbits_t I2C1RCVbits __asm__ ("I2C1RCV") __attribute__((section("sfrs"), address(0xBF820460)));
extern volatile uint32_t        I2C1RCVCLR __attribute__((section("sfrs"),address(0xBF820464)));
extern volatile uint32_t        I2C1RCVSET __attribute__((section("sfrs"),address(0xBF820468)));
extern volatile uint32_t        I2C1RCVINV __attribute__((section("sfrs"),address(0xBF82046C)));
#define ADCCON1 ADCCON1
extern volatile uint32_t   ADCCON1 __attribute__((section("sfrs"), address(0xBF821000)));
typedef struct {
  uint32_t DMABL:3;
  uint32_t STRGLVL:1;
  uint32_t IRQVS:3;
  uint32_t :1;
  uint32_t SCANEN:1;
  uint32_t FSYUPB:1;
  uint32_t FSYDMA:1;
  uint32_t CVDEN:1;
  uint32_t :1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t STRGSRC:5;
  uint32_t SELRES:2;
  uint32_t FRACT:1;
  uint32_t TRBSLV:3;
  uint32_t TRBMST:3;
  uint32_t TRBERR:1;
  uint32_t TRBEN:1;
} __ADCCON1bits_t;
extern volatile __ADCCON1bits_t ADCCON1bits __asm__ ("ADCCON1") __attribute__((section("sfrs"), address(0xBF821000)));
extern volatile uint32_t        ADCCON1CLR __attribute__((section("sfrs"),address(0xBF821004)));
extern volatile uint32_t        ADCCON1SET __attribute__((section("sfrs"),address(0xBF821008)));
extern volatile uint32_t        ADCCON1INV __attribute__((section("sfrs"),address(0xBF82100C)));
#define ADCCON2 ADCCON2
extern volatile uint32_t   ADCCON2 __attribute__((section("sfrs"), address(0xBF821010)));
typedef struct {
  uint32_t ADCDIV:7;
  uint32_t :4;
  uint32_t ENXCNVRT:1;
  uint32_t :1;
  uint32_t EOSIEN:1;
  uint32_t REFFLTIEN:1;
  uint32_t BGVRIEN:1;
  uint32_t SAMC:10;
  uint32_t CVDCPL:3;
  uint32_t EOSRDY:1;
  uint32_t REFFLT:1;
  uint32_t BGVRRDY:1;
} __ADCCON2bits_t;
extern volatile __ADCCON2bits_t ADCCON2bits __asm__ ("ADCCON2") __attribute__((section("sfrs"), address(0xBF821010)));
extern volatile uint32_t        ADCCON2CLR __attribute__((section("sfrs"),address(0xBF821014)));
extern volatile uint32_t        ADCCON2SET __attribute__((section("sfrs"),address(0xBF821018)));
extern volatile uint32_t        ADCCON2INV __attribute__((section("sfrs"),address(0xBF82101C)));
#define ADCCON3 ADCCON3
extern volatile uint32_t   ADCCON3 __attribute__((section("sfrs"), address(0xBF821020)));
typedef struct {
  uint32_t ADINSEL:6;
  uint32_t GSWTRG:1;
  uint32_t GLSWTRG:1;
  uint32_t RQCNVRT:1;
  uint32_t SAMP:1;
  uint32_t UPDRDY:1;
  uint32_t UPDIEN:1;
  uint32_t TRGSUSP:1;
  uint32_t VREFSEL:3;
  uint32_t DIGEN0:1;
  uint32_t :6;
  uint32_t DIGEN7:1;
  uint32_t CONCLKDIV:6;
  uint32_t ADCSEL:2;
} __ADCCON3bits_t;
extern volatile __ADCCON3bits_t ADCCON3bits __asm__ ("ADCCON3") __attribute__((section("sfrs"), address(0xBF821020)));
extern volatile uint32_t        ADCCON3CLR __attribute__((section("sfrs"),address(0xBF821024)));
extern volatile uint32_t        ADCCON3SET __attribute__((section("sfrs"),address(0xBF821028)));
extern volatile uint32_t        ADCCON3INV __attribute__((section("sfrs"),address(0xBF82102C)));
#define ADCTRGMODE ADCTRGMODE
extern volatile uint32_t   ADCTRGMODE __attribute__((section("sfrs"), address(0xBF821030)));
typedef struct {
  uint32_t SSAMPEN0:1;
  uint32_t :7;
  uint32_t STRGEN0:1;
  uint32_t :7;
  uint32_t SH0ALT:2;
} __ADCTRGMODEbits_t;
extern volatile __ADCTRGMODEbits_t ADCTRGMODEbits __asm__ ("ADCTRGMODE") __attribute__((section("sfrs"), address(0xBF821030)));
extern volatile uint32_t        ADCTRGMODECLR __attribute__((section("sfrs"),address(0xBF821034)));
extern volatile uint32_t        ADCTRGMODESET __attribute__((section("sfrs"),address(0xBF821038)));
extern volatile uint32_t        ADCTRGMODEINV __attribute__((section("sfrs"),address(0xBF82103C)));
#define ADCIMCON1 ADCIMCON1
extern volatile uint32_t   ADCIMCON1 __attribute__((section("sfrs"), address(0xBF821040)));
typedef struct {
  uint32_t SIGN0:1;
  uint32_t DIFF0:1;
  uint32_t SIGN1:1;
  uint32_t DIFF1:1;
  uint32_t SIGN2:1;
  uint32_t DIFF2:1;
  uint32_t SIGN3:1;
  uint32_t DIFF3:1;
  uint32_t SIGN4:1;
  uint32_t DIFF4:1;
  uint32_t SIGN5:1;
  uint32_t DIFF5:1;
  uint32_t SIGN6:1;
  uint32_t DIFF6:1;
  uint32_t SIGN7:1;
  uint32_t DIFF7:1;
  uint32_t SIGN8:1;
  uint32_t DIFF8:1;
  uint32_t SIGN9:1;
  uint32_t DIFF9:1;
  uint32_t SIGN10:1;
  uint32_t DIFF10:1;
  uint32_t SIGN11:1;
  uint32_t DIFF11:1;
  uint32_t SIGN12:1;
  uint32_t DIFF12:1;
  uint32_t SIGN13:1;
  uint32_t DIFF13:1;
  uint32_t SIGN14:1;
  uint32_t DIFF14:1;
  uint32_t SIGN15:1;
  uint32_t DIFF15:1;
} __ADCIMCON1bits_t;
extern volatile __ADCIMCON1bits_t ADCIMCON1bits __asm__ ("ADCIMCON1") __attribute__((section("sfrs"), address(0xBF821040)));
extern volatile uint32_t        ADCIMCON1CLR __attribute__((section("sfrs"),address(0xBF821044)));
extern volatile uint32_t        ADCIMCON1SET __attribute__((section("sfrs"),address(0xBF821048)));
extern volatile uint32_t        ADCIMCON1INV __attribute__((section("sfrs"),address(0xBF82104C)));
#define ADCIMCON2 ADCIMCON2
extern volatile uint32_t   ADCIMCON2 __attribute__((section("sfrs"), address(0xBF821050)));
typedef struct {
  uint32_t SIGN16:1;
  uint32_t DIFF16:1;
  uint32_t SIGN17:1;
  uint32_t DIFF17:1;
  uint32_t SIGN18:1;
  uint32_t DIFF18:1;
  uint32_t SIGN19:1;
  uint32_t DIFF19:1;
} __ADCIMCON2bits_t;
extern volatile __ADCIMCON2bits_t ADCIMCON2bits __asm__ ("ADCIMCON2") __attribute__((section("sfrs"), address(0xBF821050)));
extern volatile uint32_t        ADCIMCON2CLR __attribute__((section("sfrs"),address(0xBF821054)));
extern volatile uint32_t        ADCIMCON2SET __attribute__((section("sfrs"),address(0xBF821058)));
extern volatile uint32_t        ADCIMCON2INV __attribute__((section("sfrs"),address(0xBF82105C)));
#define ADCGIRQEN1 ADCGIRQEN1
extern volatile uint32_t   ADCGIRQEN1 __attribute__((section("sfrs"), address(0xBF821080)));
typedef struct {
  uint32_t AGIEN0:1;
  uint32_t AGIEN1:1;
  uint32_t AGIEN2:1;
  uint32_t AGIEN3:1;
  uint32_t AGIEN4:1;
  uint32_t AGIEN5:1;
  uint32_t AGIEN6:1;
  uint32_t AGIEN7:1;
  uint32_t AGIEN8:1;
  uint32_t AGIEN9:1;
  uint32_t AGIEN10:1;
  uint32_t AGIEN11:1;
  uint32_t AGIEN12:1;
  uint32_t AGIEN13:1;
  uint32_t AGIEN14:1;
  uint32_t AGIEN15:1;
} __ADCGIRQEN1bits_t;
