Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __ADCGIRQEN1bits_t ADCGIRQEN1bits __asm__ ("ADCGIRQEN1") __attribute__((section("sfrs"), address(0xBF821080)));
extern volatile uint32_t        ADCGIRQEN1CLR __attribute__((section("sfrs"),address(0xBF821084)));
extern volatile uint32_t        ADCGIRQEN1SET __attribute__((section("sfrs"),address(0xBF821088)));
extern volatile uint32_t        ADCGIRQEN1INV __attribute__((section("sfrs"),address(0xBF82108C)));
#define ADCCSS1 ADCCSS1
extern volatile uint32_t   ADCCSS1 __attribute__((section("sfrs"), address(0xBF8210A0)));
typedef struct {
  uint32_t CSS0:1;
  uint32_t CSS1:1;
  uint32_t CSS2:1;
  uint32_t CSS3:1;
  uint32_t CSS4:1;
  uint32_t CSS5:1;
  uint32_t CSS6:1;
  uint32_t CSS7:1;
  uint32_t CSS8:1;
  uint32_t CSS9:1;
  uint32_t CSS10:1;
  uint32_t CSS11:1;
  uint32_t CSS12:1;
  uint32_t CSS13:1;
  uint32_t CSS14:1;
  uint32_t CSS15:1;
  uint32_t CSS16:1;
  uint32_t CSS17:1;
  uint32_t CSS18:1;
  uint32_t CSS19:1;
} __ADCCSS1bits_t;
extern volatile __ADCCSS1bits_t ADCCSS1bits __asm__ ("ADCCSS1") __attribute__((section("sfrs"), address(0xBF8210A0)));
extern volatile uint32_t        ADCCSS1CLR __attribute__((section("sfrs"),address(0xBF8210A4)));
extern volatile uint32_t        ADCCSS1SET __attribute__((section("sfrs"),address(0xBF8210A8)));
extern volatile uint32_t        ADCCSS1INV __attribute__((section("sfrs"),address(0xBF8210AC)));
#define ADCDSTAT1 ADCDSTAT1
extern volatile uint32_t   ADCDSTAT1 __attribute__((section("sfrs"), address(0xBF8210C0)));
typedef struct {
  uint32_t ARDY0:1;
  uint32_t ARDY1:1;
  uint32_t ARDY2:1;
  uint32_t ARDY3:1;
  uint32_t ARDY4:1;
  uint32_t ARDY5:1;
  uint32_t ARDY6:1;
  uint32_t ARDY7:1;
  uint32_t ARDY8:1;
  uint32_t ARDY9:1;
  uint32_t ARDY10:1;
  uint32_t ARDY11:1;
  uint32_t ARDY12:1;
  uint32_t ARDY13:1;
  uint32_t ARDY14:1;
  uint32_t ARDY15:1;
  uint32_t ARDY16:1;
  uint32_t ARDY17:1;
  uint32_t ARDY18:1;
  uint32_t ARDY19:1;
} __ADCDSTAT1bits_t;
extern volatile __ADCDSTAT1bits_t ADCDSTAT1bits __asm__ ("ADCDSTAT1") __attribute__((section("sfrs"), address(0xBF8210C0)));
extern volatile uint32_t        ADCDSTAT1CLR __attribute__((section("sfrs"),address(0xBF8210C4)));
extern volatile uint32_t        ADCDSTAT1SET __attribute__((section("sfrs"),address(0xBF8210C8)));
extern volatile uint32_t        ADCDSTAT1INV __attribute__((section("sfrs"),address(0xBF8210CC)));
#define ADCCMPEN1 ADCCMPEN1
extern volatile uint32_t   ADCCMPEN1 __attribute__((section("sfrs"), address(0xBF8210E0)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
} __ADCCMPEN1bits_t;
extern volatile __ADCCMPEN1bits_t ADCCMPEN1bits __asm__ ("ADCCMPEN1") __attribute__((section("sfrs"), address(0xBF8210E0)));
extern volatile uint32_t        ADCCMPEN1CLR __attribute__((section("sfrs"),address(0xBF8210E4)));
extern volatile uint32_t        ADCCMPEN1SET __attribute__((section("sfrs"),address(0xBF8210E8)));
extern volatile uint32_t        ADCCMPEN1INV __attribute__((section("sfrs"),address(0xBF8210EC)));
#define ADCCMP1 ADCCMP1
extern volatile uint32_t   ADCCMP1 __attribute__((section("sfrs"), address(0xBF8210F0)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP1bits_t;
extern volatile __ADCCMP1bits_t ADCCMP1bits __asm__ ("ADCCMP1") __attribute__((section("sfrs"), address(0xBF8210F0)));
extern volatile uint32_t        ADCCMP1CLR __attribute__((section("sfrs"),address(0xBF8210F4)));
extern volatile uint32_t        ADCCMP1SET __attribute__((section("sfrs"),address(0xBF8210F8)));
extern volatile uint32_t        ADCCMP1INV __attribute__((section("sfrs"),address(0xBF8210FC)));
#define ADCCMPEN2 ADCCMPEN2
extern volatile uint32_t   ADCCMPEN2 __attribute__((section("sfrs"), address(0xBF821100)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
} __ADCCMPEN2bits_t;
extern volatile __ADCCMPEN2bits_t ADCCMPEN2bits __asm__ ("ADCCMPEN2") __attribute__((section("sfrs"), address(0xBF821100)));
extern volatile uint32_t        ADCCMPEN2CLR __attribute__((section("sfrs"),address(0xBF821104)));
extern volatile uint32_t        ADCCMPEN2SET __attribute__((section("sfrs"),address(0xBF821108)));
extern volatile uint32_t        ADCCMPEN2INV __attribute__((section("sfrs"),address(0xBF82110C)));
#define ADCCMP2 ADCCMP2
extern volatile uint32_t   ADCCMP2 __attribute__((section("sfrs"), address(0xBF821110)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP2bits_t;
extern volatile __ADCCMP2bits_t ADCCMP2bits __asm__ ("ADCCMP2") __attribute__((section("sfrs"), address(0xBF821110)));
extern volatile uint32_t        ADCCMP2CLR __attribute__((section("sfrs"),address(0xBF821114)));
extern volatile uint32_t        ADCCMP2SET __attribute__((section("sfrs"),address(0xBF821118)));
extern volatile uint32_t        ADCCMP2INV __attribute__((section("sfrs"),address(0xBF82111C)));
#define ADCFLTR1 ADCFLTR1
extern volatile uint32_t   ADCFLTR1 __attribute__((section("sfrs"), address(0xBF8211A0)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR1bits_t;
extern volatile __ADCFLTR1bits_t ADCFLTR1bits __asm__ ("ADCFLTR1") __attribute__((section("sfrs"), address(0xBF8211A0)));
extern volatile uint32_t        ADCFLTR1CLR __attribute__((section("sfrs"),address(0xBF8211A4)));
extern volatile uint32_t        ADCFLTR1SET __attribute__((section("sfrs"),address(0xBF8211A8)));
extern volatile uint32_t        ADCFLTR1INV __attribute__((section("sfrs"),address(0xBF8211AC)));
#define ADCFLTR2 ADCFLTR2
extern volatile uint32_t   ADCFLTR2 __attribute__((section("sfrs"), address(0xBF8211B0)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR2bits_t;
extern volatile __ADCFLTR2bits_t ADCFLTR2bits __asm__ ("ADCFLTR2") __attribute__((section("sfrs"), address(0xBF8211B0)));
extern volatile uint32_t        ADCFLTR2CLR __attribute__((section("sfrs"),address(0xBF8211B4)));
extern volatile uint32_t        ADCFLTR2SET __attribute__((section("sfrs"),address(0xBF8211B8)));
extern volatile uint32_t        ADCFLTR2INV __attribute__((section("sfrs"),address(0xBF8211BC)));
#define ADCTRG1 ADCTRG1
extern volatile uint32_t   ADCTRG1 __attribute__((section("sfrs"), address(0xBF821200)));
typedef struct {
  uint32_t TRGSRC0:5;
  uint32_t :3;
  uint32_t TRGSRC1:5;
  uint32_t :3;
  uint32_t TRGSRC2:5;
  uint32_t :3;
  uint32_t TRGSRC3:5;
} __ADCTRG1bits_t;
extern volatile __ADCTRG1bits_t ADCTRG1bits __asm__ ("ADCTRG1") __attribute__((section("sfrs"), address(0xBF821200)));
extern volatile uint32_t        ADCTRG1CLR __attribute__((section("sfrs"),address(0xBF821204)));
extern volatile uint32_t        ADCTRG1SET __attribute__((section("sfrs"),address(0xBF821208)));
extern volatile uint32_t        ADCTRG1INV __attribute__((section("sfrs"),address(0xBF82120C)));
#define ADCTRG2 ADCTRG2
extern volatile uint32_t   ADCTRG2 __attribute__((section("sfrs"), address(0xBF821210)));
typedef struct {
  uint32_t TRGSRC4:5;
  uint32_t :3;
  uint32_t TRGSRC5:5;
  uint32_t :3;
  uint32_t TRGSRC6:5;
  uint32_t :3;
  uint32_t TRGSRC7:5;
} __ADCTRG2bits_t;
extern volatile __ADCTRG2bits_t ADCTRG2bits __asm__ ("ADCTRG2") __attribute__((section("sfrs"), address(0xBF821210)));
extern volatile uint32_t        ADCTRG2CLR __attribute__((section("sfrs"),address(0xBF821214)));
extern volatile uint32_t        ADCTRG2SET __attribute__((section("sfrs"),address(0xBF821218)));
extern volatile uint32_t        ADCTRG2INV __attribute__((section("sfrs"),address(0xBF82121C)));
#define ADCCMPCON1 ADCCMPCON1
extern volatile uint32_t   ADCCMPCON1 __attribute__((section("sfrs"), address(0xBF821280)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:6;
  uint32_t :2;
  uint32_t CVDDATA:16;
} __ADCCMPCON1bits_t;
extern volatile __ADCCMPCON1bits_t ADCCMPCON1bits __asm__ ("ADCCMPCON1") __attribute__((section("sfrs"), address(0xBF821280)));
extern volatile uint32_t        ADCCMPCON1CLR __attribute__((section("sfrs"),address(0xBF821284)));
extern volatile uint32_t        ADCCMPCON1SET __attribute__((section("sfrs"),address(0xBF821288)));
extern volatile uint32_t        ADCCMPCON1INV __attribute__((section("sfrs"),address(0xBF82128C)));
#define ADCCMPCON2 ADCCMPCON2
extern volatile uint32_t   ADCCMPCON2 __attribute__((section("sfrs"), address(0xBF821290)));
typedef struct {
  uint32_t IELOLO:1;
  uint32_t IELOHI:1;
  uint32_t IEHILO:1;
  uint32_t IEHIHI:1;
  uint32_t IEBTWN:1;
  uint32_t DCMPED:1;
  uint32_t DCMPGIEN:1;
  uint32_t ENDCMP:1;
  uint32_t AINID:5;
} __ADCCMPCON2bits_t;
extern volatile __ADCCMPCON2bits_t ADCCMPCON2bits __asm__ ("ADCCMPCON2") __attribute__((section("sfrs"), address(0xBF821290)));
extern volatile uint32_t        ADCCMPCON2CLR __attribute__((section("sfrs"),address(0xBF821294)));
extern volatile uint32_t        ADCCMPCON2SET __attribute__((section("sfrs"),address(0xBF821298)));
extern volatile uint32_t        ADCCMPCON2INV __attribute__((section("sfrs"),address(0xBF82129C)));
#define ADCFSTAT ADCFSTAT
extern volatile uint32_t   ADCFSTAT __attribute__((section("sfrs"), address(0xBF8212E0)));
typedef struct {
  uint32_t ADCID:3;
  uint32_t :4;
  uint32_t FSIGN:1;
  uint32_t FCNT:8;
  uint32_t :5;
  uint32_t FWROVERR:1;
  uint32_t FRDY:1;
  uint32_t FIEN:1;
  uint32_t ADC0EN:1;
  uint32_t :6;
  uint32_t FEN:1;
} __ADCFSTATbits_t;
extern volatile __ADCFSTATbits_t ADCFSTATbits __asm__ ("ADCFSTAT") __attribute__((section("sfrs"), address(0xBF8212E0)));
extern volatile uint32_t        ADCFSTATCLR __attribute__((section("sfrs"),address(0xBF8212E4)));
extern volatile uint32_t        ADCFSTATSET __attribute__((section("sfrs"),address(0xBF8212E8)));
extern volatile uint32_t        ADCFSTATINV __attribute__((section("sfrs"),address(0xBF8212EC)));
#define ADCFIFO ADCFIFO
extern volatile uint32_t   ADCFIFO __attribute__((section("sfrs"), address(0xBF8212F0)));
typedef struct {
  uint32_t DATA:32;
} __ADCFIFObits_t;
extern volatile __ADCFIFObits_t ADCFIFObits __asm__ ("ADCFIFO") __attribute__((section("sfrs"), address(0xBF8212F0)));
extern volatile uint32_t        ADCFIFOCLR __attribute__((section("sfrs"),address(0xBF8212F4)));
extern volatile uint32_t        ADCFIFOSET __attribute__((section("sfrs"),address(0xBF8212F8)));
extern volatile uint32_t        ADCFIFOINV __attribute__((section("sfrs"),address(0xBF8212FC)));
#define ADCBASE ADCBASE
extern volatile uint32_t   ADCBASE __attribute__((section("sfrs"), address(0xBF821300)));
typedef struct {
  uint32_t ADCBASE:16;
} __ADCBASEbits_t;
