Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __ADCDATA1bits_t ADCDATA1bits __asm__ ("ADCDATA1") __attribute__((section("sfrs"), address(0xBF821A10)));
#define ADCDATA2 ADCDATA2
extern volatile uint32_t   ADCDATA2 __attribute__((section("sfrs"), address(0xBF821A20)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA2bits_t;
extern volatile __ADCDATA2bits_t ADCDATA2bits __asm__ ("ADCDATA2") __attribute__((section("sfrs"), address(0xBF821A20)));
#define ADCDATA3 ADCDATA3
extern volatile uint32_t   ADCDATA3 __attribute__((section("sfrs"), address(0xBF821A30)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA3bits_t;
extern volatile __ADCDATA3bits_t ADCDATA3bits __asm__ ("ADCDATA3") __attribute__((section("sfrs"), address(0xBF821A30)));
#define ADCDATA4 ADCDATA4
extern volatile uint32_t   ADCDATA4 __attribute__((section("sfrs"), address(0xBF821A40)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA4bits_t;
extern volatile __ADCDATA4bits_t ADCDATA4bits __asm__ ("ADCDATA4") __attribute__((section("sfrs"), address(0xBF821A40)));
#define ADCDATA5 ADCDATA5
extern volatile uint32_t   ADCDATA5 __attribute__((section("sfrs"), address(0xBF821A50)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA5bits_t;
extern volatile __ADCDATA5bits_t ADCDATA5bits __asm__ ("ADCDATA5") __attribute__((section("sfrs"), address(0xBF821A50)));
#define ADCDATA6 ADCDATA6
extern volatile uint32_t   ADCDATA6 __attribute__((section("sfrs"), address(0xBF821A60)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA6bits_t;
extern volatile __ADCDATA6bits_t ADCDATA6bits __asm__ ("ADCDATA6") __attribute__((section("sfrs"), address(0xBF821A60)));
#define ADCDATA7 ADCDATA7
extern volatile uint32_t   ADCDATA7 __attribute__((section("sfrs"), address(0xBF821A70)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA7bits_t;
extern volatile __ADCDATA7bits_t ADCDATA7bits __asm__ ("ADCDATA7") __attribute__((section("sfrs"), address(0xBF821A70)));
#define ADCDATA8 ADCDATA8
extern volatile uint32_t   ADCDATA8 __attribute__((section("sfrs"), address(0xBF821A80)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA8bits_t;
extern volatile __ADCDATA8bits_t ADCDATA8bits __asm__ ("ADCDATA8") __attribute__((section("sfrs"), address(0xBF821A80)));
#define ADCDATA9 ADCDATA9
extern volatile uint32_t   ADCDATA9 __attribute__((section("sfrs"), address(0xBF821A90)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA9bits_t;
extern volatile __ADCDATA9bits_t ADCDATA9bits __asm__ ("ADCDATA9") __attribute__((section("sfrs"), address(0xBF821A90)));
#define ADCDATA10 ADCDATA10
extern volatile uint32_t   ADCDATA10 __attribute__((section("sfrs"), address(0xBF821AA0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA10bits_t;
extern volatile __ADCDATA10bits_t ADCDATA10bits __asm__ ("ADCDATA10") __attribute__((section("sfrs"), address(0xBF821AA0)));
#define ADCDATA11 ADCDATA11
extern volatile uint32_t   ADCDATA11 __attribute__((section("sfrs"), address(0xBF821AB0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA11bits_t;
extern volatile __ADCDATA11bits_t ADCDATA11bits __asm__ ("ADCDATA11") __attribute__((section("sfrs"), address(0xBF821AB0)));
#define ADCDATA12 ADCDATA12
extern volatile uint32_t   ADCDATA12 __attribute__((section("sfrs"), address(0xBF821AC0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA12bits_t;
extern volatile __ADCDATA12bits_t ADCDATA12bits __asm__ ("ADCDATA12") __attribute__((section("sfrs"), address(0xBF821AC0)));
#define ADCDATA13 ADCDATA13
extern volatile uint32_t   ADCDATA13 __attribute__((section("sfrs"), address(0xBF821AD0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA13bits_t;
extern volatile __ADCDATA13bits_t ADCDATA13bits __asm__ ("ADCDATA13") __attribute__((section("sfrs"), address(0xBF821AD0)));
#define ADCDATA14 ADCDATA14
extern volatile uint32_t   ADCDATA14 __attribute__((section("sfrs"), address(0xBF821AE0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA14bits_t;
extern volatile __ADCDATA14bits_t ADCDATA14bits __asm__ ("ADCDATA14") __attribute__((section("sfrs"), address(0xBF821AE0)));
#define ADCDATA15 ADCDATA15
extern volatile uint32_t   ADCDATA15 __attribute__((section("sfrs"), address(0xBF821AF0)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA15bits_t;
extern volatile __ADCDATA15bits_t ADCDATA15bits __asm__ ("ADCDATA15") __attribute__((section("sfrs"), address(0xBF821AF0)));
#define ADCDATA16 ADCDATA16
extern volatile uint32_t   ADCDATA16 __attribute__((section("sfrs"), address(0xBF821B00)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA16bits_t;
extern volatile __ADCDATA16bits_t ADCDATA16bits __asm__ ("ADCDATA16") __attribute__((section("sfrs"), address(0xBF821B00)));
#define ADCDATA17 ADCDATA17
extern volatile uint32_t   ADCDATA17 __attribute__((section("sfrs"), address(0xBF821B10)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA17bits_t;
extern volatile __ADCDATA17bits_t ADCDATA17bits __asm__ ("ADCDATA17") __attribute__((section("sfrs"), address(0xBF821B10)));
#define ADCDATA18 ADCDATA18
extern volatile uint32_t   ADCDATA18 __attribute__((section("sfrs"), address(0xBF821B20)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA18bits_t;
extern volatile __ADCDATA18bits_t ADCDATA18bits __asm__ ("ADCDATA18") __attribute__((section("sfrs"), address(0xBF821B20)));
#define ADCDATA19 ADCDATA19
extern volatile uint32_t   ADCDATA19 __attribute__((section("sfrs"), address(0xBF821B30)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA19bits_t;
extern volatile __ADCDATA19bits_t ADCDATA19bits __asm__ ("ADCDATA19") __attribute__((section("sfrs"), address(0xBF821B30)));
#define ADCDATA20 ADCDATA20
extern volatile uint32_t   ADCDATA20 __attribute__((section("sfrs"), address(0xBF821B40)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA20bits_t;
extern volatile __ADCDATA20bits_t ADCDATA20bits __asm__ ("ADCDATA20") __attribute__((section("sfrs"), address(0xBF821B40)));
#define ADCDATA21 ADCDATA21
extern volatile uint32_t   ADCDATA21 __attribute__((section("sfrs"), address(0xBF821B50)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA21bits_t;
extern volatile __ADCDATA21bits_t ADCDATA21bits __asm__ ("ADCDATA21") __attribute__((section("sfrs"), address(0xBF821B50)));
#define ADCDATA22 ADCDATA22
extern volatile uint32_t   ADCDATA22 __attribute__((section("sfrs"), address(0xBF821B60)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA22bits_t;
extern volatile __ADCDATA22bits_t ADCDATA22bits __asm__ ("ADCDATA22") __attribute__((section("sfrs"), address(0xBF821B60)));
#define ADCDATA23 ADCDATA23
extern volatile uint32_t   ADCDATA23 __attribute__((section("sfrs"), address(0xBF821B70)));
typedef struct {
  uint32_t DATA:32;
} __ADCDATA23bits_t;
extern volatile __ADCDATA23bits_t ADCDATA23bits __asm__ ("ADCDATA23") __attribute__((section("sfrs"), address(0xBF821B70)));
#define C1CON C1CON
extern volatile uint32_t   C1CON __attribute__((section("sfrs"), address(0xBF822000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t :6;
    uint32_t CANBUSY:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :4;
    uint32_t CANCAP:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1CONbits_t;
extern volatile __C1CONbits_t C1CONbits __asm__ ("C1CON") __attribute__((section("sfrs"), address(0xBF822000)));
extern volatile uint32_t        C1CONCLR __attribute__((section("sfrs"),address(0xBF822004)));
extern volatile uint32_t        C1CONSET __attribute__((section("sfrs"),address(0xBF822008)));
extern volatile uint32_t        C1CONINV __attribute__((section("sfrs"),address(0xBF82200C)));
#define C1CFG C1CFG
extern volatile uint32_t   C1CFG __attribute__((section("sfrs"), address(0xBF822010)));
typedef union {
  struct {
    uint32_t BRP:6;
    uint32_t SJW:2;
    uint32_t PRSEG:3;
    uint32_t SEG1PH:3;
    uint32_t SAM:1;
    uint32_t SEG2PHTS:1;
    uint32_t SEG2PH:3;
    uint32_t :3;
    uint32_t WAKFIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1CFGbits_t;
extern volatile __C1CFGbits_t C1CFGbits __asm__ ("C1CFG") __attribute__((section("sfrs"), address(0xBF822010)));
extern volatile uint32_t        C1CFGCLR __attribute__((section("sfrs"),address(0xBF822014)));
extern volatile uint32_t        C1CFGSET __attribute__((section("sfrs"),address(0xBF822018)));
extern volatile uint32_t        C1CFGINV __attribute__((section("sfrs"),address(0xBF82201C)));
#define C1INT C1INT
extern volatile uint32_t   C1INT __attribute__((section("sfrs"), address(0xBF822020)));
typedef union {
  struct {
    uint32_t TBIF:1;
    uint32_t RBIF:1;
    uint32_t CTMRIF:1;
    uint32_t MODIF:1;
    uint32_t :7;
    uint32_t RBOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVRIF:1;
    uint32_t TBIE:1;
    uint32_t RBIE:1;
    uint32_t CTMRIE:1;
    uint32_t MODIE:1;
    uint32_t :7;
    uint32_t RBOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVRIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1INTbits_t;
extern volatile __C1INTbits_t C1INTbits __asm__ ("C1INT") __attribute__((section("sfrs"), address(0xBF822020)));
extern volatile uint32_t        C1INTCLR __attribute__((section("sfrs"),address(0xBF822024)));
extern volatile uint32_t        C1INTSET __attribute__((section("sfrs"),address(0xBF822028)));
extern volatile uint32_t        C1INTINV __attribute__((section("sfrs"),address(0xBF82202C)));
#define C1VEC C1VEC
extern volatile uint32_t   C1VEC __attribute__((section("sfrs"), address(0xBF822030)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1VECbits_t;
extern volatile __C1VECbits_t C1VECbits __asm__ ("C1VEC") __attribute__((section("sfrs"), address(0xBF822030)));
extern volatile uint32_t        C1VECCLR __attribute__((section("sfrs"),address(0xBF822034)));
extern volatile uint32_t        C1VECSET __attribute__((section("sfrs"),address(0xBF822038)));
extern volatile uint32_t        C1VECINV __attribute__((section("sfrs"),address(0xBF82203C)));
#define C1TREC C1TREC
extern volatile uint32_t   C1TREC __attribute__((section("sfrs"), address(0xBF822040)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1TRECbits_t;
