Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __C1RXF2bits_t C1RXF2bits __asm__ ("C1RXF2") __attribute__((section("sfrs"), address(0xBF822160)));
extern volatile uint32_t        C1RXF2CLR __attribute__((section("sfrs"),address(0xBF822164)));
extern volatile uint32_t        C1RXF2SET __attribute__((section("sfrs"),address(0xBF822168)));
extern volatile uint32_t        C1RXF2INV __attribute__((section("sfrs"),address(0xBF82216C)));
#define C1RXF3 C1RXF3
extern volatile uint32_t   C1RXF3 __attribute__((section("sfrs"), address(0xBF822170)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF3bits_t;
extern volatile __C1RXF3bits_t C1RXF3bits __asm__ ("C1RXF3") __attribute__((section("sfrs"), address(0xBF822170)));
extern volatile uint32_t        C1RXF3CLR __attribute__((section("sfrs"),address(0xBF822174)));
extern volatile uint32_t        C1RXF3SET __attribute__((section("sfrs"),address(0xBF822178)));
extern volatile uint32_t        C1RXF3INV __attribute__((section("sfrs"),address(0xBF82217C)));
#define C1RXF4 C1RXF4
extern volatile uint32_t   C1RXF4 __attribute__((section("sfrs"), address(0xBF822180)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF4bits_t;
extern volatile __C1RXF4bits_t C1RXF4bits __asm__ ("C1RXF4") __attribute__((section("sfrs"), address(0xBF822180)));
extern volatile uint32_t        C1RXF4CLR __attribute__((section("sfrs"),address(0xBF822184)));
extern volatile uint32_t        C1RXF4SET __attribute__((section("sfrs"),address(0xBF822188)));
extern volatile uint32_t        C1RXF4INV __attribute__((section("sfrs"),address(0xBF82218C)));
#define C1RXF5 C1RXF5
extern volatile uint32_t   C1RXF5 __attribute__((section("sfrs"), address(0xBF822190)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF5bits_t;
extern volatile __C1RXF5bits_t C1RXF5bits __asm__ ("C1RXF5") __attribute__((section("sfrs"), address(0xBF822190)));
extern volatile uint32_t        C1RXF5CLR __attribute__((section("sfrs"),address(0xBF822194)));
extern volatile uint32_t        C1RXF5SET __attribute__((section("sfrs"),address(0xBF822198)));
extern volatile uint32_t        C1RXF5INV __attribute__((section("sfrs"),address(0xBF82219C)));
#define C1RXF6 C1RXF6
extern volatile uint32_t   C1RXF6 __attribute__((section("sfrs"), address(0xBF8221A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF6bits_t;
extern volatile __C1RXF6bits_t C1RXF6bits __asm__ ("C1RXF6") __attribute__((section("sfrs"), address(0xBF8221A0)));
extern volatile uint32_t        C1RXF6CLR __attribute__((section("sfrs"),address(0xBF8221A4)));
extern volatile uint32_t        C1RXF6SET __attribute__((section("sfrs"),address(0xBF8221A8)));
extern volatile uint32_t        C1RXF6INV __attribute__((section("sfrs"),address(0xBF8221AC)));
#define C1RXF7 C1RXF7
extern volatile uint32_t   C1RXF7 __attribute__((section("sfrs"), address(0xBF8221B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF7bits_t;
extern volatile __C1RXF7bits_t C1RXF7bits __asm__ ("C1RXF7") __attribute__((section("sfrs"), address(0xBF8221B0)));
extern volatile uint32_t        C1RXF7CLR __attribute__((section("sfrs"),address(0xBF8221B4)));
extern volatile uint32_t        C1RXF7SET __attribute__((section("sfrs"),address(0xBF8221B8)));
extern volatile uint32_t        C1RXF7INV __attribute__((section("sfrs"),address(0xBF8221BC)));
#define C1RXF8 C1RXF8
extern volatile uint32_t   C1RXF8 __attribute__((section("sfrs"), address(0xBF8221C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF8bits_t;
extern volatile __C1RXF8bits_t C1RXF8bits __asm__ ("C1RXF8") __attribute__((section("sfrs"), address(0xBF8221C0)));
extern volatile uint32_t        C1RXF8CLR __attribute__((section("sfrs"),address(0xBF8221C4)));
extern volatile uint32_t        C1RXF8SET __attribute__((section("sfrs"),address(0xBF8221C8)));
extern volatile uint32_t        C1RXF8INV __attribute__((section("sfrs"),address(0xBF8221CC)));
#define C1RXF9 C1RXF9
extern volatile uint32_t   C1RXF9 __attribute__((section("sfrs"), address(0xBF8221D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF9bits_t;
extern volatile __C1RXF9bits_t C1RXF9bits __asm__ ("C1RXF9") __attribute__((section("sfrs"), address(0xBF8221D0)));
extern volatile uint32_t        C1RXF9CLR __attribute__((section("sfrs"),address(0xBF8221D4)));
extern volatile uint32_t        C1RXF9SET __attribute__((section("sfrs"),address(0xBF8221D8)));
extern volatile uint32_t        C1RXF9INV __attribute__((section("sfrs"),address(0xBF8221DC)));
#define C1RXF10 C1RXF10
extern volatile uint32_t   C1RXF10 __attribute__((section("sfrs"), address(0xBF8221E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF10bits_t;
extern volatile __C1RXF10bits_t C1RXF10bits __asm__ ("C1RXF10") __attribute__((section("sfrs"), address(0xBF8221E0)));
extern volatile uint32_t        C1RXF10CLR __attribute__((section("sfrs"),address(0xBF8221E4)));
extern volatile uint32_t        C1RXF10SET __attribute__((section("sfrs"),address(0xBF8221E8)));
extern volatile uint32_t        C1RXF10INV __attribute__((section("sfrs"),address(0xBF8221EC)));
#define C1RXF11 C1RXF11
extern volatile uint32_t   C1RXF11 __attribute__((section("sfrs"), address(0xBF8221F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF11bits_t;
extern volatile __C1RXF11bits_t C1RXF11bits __asm__ ("C1RXF11") __attribute__((section("sfrs"), address(0xBF8221F0)));
extern volatile uint32_t        C1RXF11CLR __attribute__((section("sfrs"),address(0xBF8221F4)));
extern volatile uint32_t        C1RXF11SET __attribute__((section("sfrs"),address(0xBF8221F8)));
extern volatile uint32_t        C1RXF11INV __attribute__((section("sfrs"),address(0xBF8221FC)));
#define C1RXF12 C1RXF12
extern volatile uint32_t   C1RXF12 __attribute__((section("sfrs"), address(0xBF822200)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF12bits_t;
