Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __C1RXF12bits_t C1RXF12bits __asm__ ("C1RXF12") __attribute__((section("sfrs"), address(0xBF822200)));
extern volatile uint32_t        C1RXF12CLR __attribute__((section("sfrs"),address(0xBF822204)));
extern volatile uint32_t        C1RXF12SET __attribute__((section("sfrs"),address(0xBF822208)));
extern volatile uint32_t        C1RXF12INV __attribute__((section("sfrs"),address(0xBF82220C)));
#define C1RXF13 C1RXF13
extern volatile uint32_t   C1RXF13 __attribute__((section("sfrs"), address(0xBF822210)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF13bits_t;
extern volatile __C1RXF13bits_t C1RXF13bits __asm__ ("C1RXF13") __attribute__((section("sfrs"), address(0xBF822210)));
extern volatile uint32_t        C1RXF13CLR __attribute__((section("sfrs"),address(0xBF822214)));
extern volatile uint32_t        C1RXF13SET __attribute__((section("sfrs"),address(0xBF822218)));
extern volatile uint32_t        C1RXF13INV __attribute__((section("sfrs"),address(0xBF82221C)));
#define C1RXF14 C1RXF14
extern volatile uint32_t   C1RXF14 __attribute__((section("sfrs"), address(0xBF822220)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF14bits_t;
extern volatile __C1RXF14bits_t C1RXF14bits __asm__ ("C1RXF14") __attribute__((section("sfrs"), address(0xBF822220)));
extern volatile uint32_t        C1RXF14CLR __attribute__((section("sfrs"),address(0xBF822224)));
extern volatile uint32_t        C1RXF14SET __attribute__((section("sfrs"),address(0xBF822228)));
extern volatile uint32_t        C1RXF14INV __attribute__((section("sfrs"),address(0xBF82222C)));
#define C1RXF15 C1RXF15
extern volatile uint32_t   C1RXF15 __attribute__((section("sfrs"), address(0xBF822230)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF15bits_t;
extern volatile __C1RXF15bits_t C1RXF15bits __asm__ ("C1RXF15") __attribute__((section("sfrs"), address(0xBF822230)));
extern volatile uint32_t        C1RXF15CLR __attribute__((section("sfrs"),address(0xBF822234)));
extern volatile uint32_t        C1RXF15SET __attribute__((section("sfrs"),address(0xBF822238)));
extern volatile uint32_t        C1RXF15INV __attribute__((section("sfrs"),address(0xBF82223C)));
#define C1FIFOBA C1FIFOBA
extern volatile uint32_t   C1FIFOBA __attribute__((section("sfrs"), address(0xBF822340)));
extern volatile uint32_t        C1FIFOBACLR __attribute__((section("sfrs"),address(0xBF822344)));
extern volatile uint32_t        C1FIFOBASET __attribute__((section("sfrs"),address(0xBF822348)));
extern volatile uint32_t        C1FIFOBAINV __attribute__((section("sfrs"),address(0xBF82234C)));
#define C1FIFOCON0 C1FIFOCON0
extern volatile uint32_t   C1FIFOCON0 __attribute__((section("sfrs"), address(0xBF822350)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON0bits_t;
extern volatile __C1FIFOCON0bits_t C1FIFOCON0bits __asm__ ("C1FIFOCON0") __attribute__((section("sfrs"), address(0xBF822350)));
extern volatile uint32_t        C1FIFOCON0CLR __attribute__((section("sfrs"),address(0xBF822354)));
extern volatile uint32_t        C1FIFOCON0SET __attribute__((section("sfrs"),address(0xBF822358)));
extern volatile uint32_t        C1FIFOCON0INV __attribute__((section("sfrs"),address(0xBF82235C)));
#define C1FIFOINT0 C1FIFOINT0
extern volatile uint32_t   C1FIFOINT0 __attribute__((section("sfrs"), address(0xBF822360)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT0bits_t;
extern volatile __C1FIFOINT0bits_t C1FIFOINT0bits __asm__ ("C1FIFOINT0") __attribute__((section("sfrs"), address(0xBF822360)));
extern volatile uint32_t        C1FIFOINT0CLR __attribute__((section("sfrs"),address(0xBF822364)));
extern volatile uint32_t        C1FIFOINT0SET __attribute__((section("sfrs"),address(0xBF822368)));
extern volatile uint32_t        C1FIFOINT0INV __attribute__((section("sfrs"),address(0xBF82236C)));
#define C1FIFOUA0 C1FIFOUA0
extern volatile uint32_t   C1FIFOUA0 __attribute__((section("sfrs"), address(0xBF822370)));
extern volatile uint32_t        C1FIFOUA0CLR __attribute__((section("sfrs"),address(0xBF822374)));
extern volatile uint32_t        C1FIFOUA0SET __attribute__((section("sfrs"),address(0xBF822378)));
extern volatile uint32_t        C1FIFOUA0INV __attribute__((section("sfrs"),address(0xBF82237C)));
#define C1FIFOCI0 C1FIFOCI0
extern volatile uint32_t   C1FIFOCI0 __attribute__((section("sfrs"), address(0xBF822380)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI0bits_t;
extern volatile __C1FIFOCI0bits_t C1FIFOCI0bits __asm__ ("C1FIFOCI0") __attribute__((section("sfrs"), address(0xBF822380)));
extern volatile uint32_t        C1FIFOCI0CLR __attribute__((section("sfrs"),address(0xBF822384)));
extern volatile uint32_t        C1FIFOCI0SET __attribute__((section("sfrs"),address(0xBF822388)));
extern volatile uint32_t        C1FIFOCI0INV __attribute__((section("sfrs"),address(0xBF82238C)));
#define C1FIFOCON1 C1FIFOCON1
extern volatile uint32_t   C1FIFOCON1 __attribute__((section("sfrs"), address(0xBF822390)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON1bits_t;
extern volatile __C1FIFOCON1bits_t C1FIFOCON1bits __asm__ ("C1FIFOCON1") __attribute__((section("sfrs"), address(0xBF822390)));
extern volatile uint32_t        C1FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF822394)));
extern volatile uint32_t        C1FIFOCON1SET __attribute__((section("sfrs"),address(0xBF822398)));
extern volatile uint32_t        C1FIFOCON1INV __attribute__((section("sfrs"),address(0xBF82239C)));
#define C1FIFOINT1 C1FIFOINT1
extern volatile uint32_t   C1FIFOINT1 __attribute__((section("sfrs"), address(0xBF8223A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT1bits_t;
extern volatile __C1FIFOINT1bits_t C1FIFOINT1bits __asm__ ("C1FIFOINT1") __attribute__((section("sfrs"), address(0xBF8223A0)));
extern volatile uint32_t        C1FIFOINT1CLR __attribute__((section("sfrs"),address(0xBF8223A4)));
extern volatile uint32_t        C1FIFOINT1SET __attribute__((section("sfrs"),address(0xBF8223A8)));
extern volatile uint32_t        C1FIFOINT1INV __attribute__((section("sfrs"),address(0xBF8223AC)));
#define C1FIFOUA1 C1FIFOUA1
extern volatile uint32_t   C1FIFOUA1 __attribute__((section("sfrs"), address(0xBF8223B0)));
extern volatile uint32_t        C1FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF8223B4)));
extern volatile uint32_t        C1FIFOUA1SET __attribute__((section("sfrs"),address(0xBF8223B8)));
extern volatile uint32_t        C1FIFOUA1INV __attribute__((section("sfrs"),address(0xBF8223BC)));
#define C1FIFOCI1 C1FIFOCI1
extern volatile uint32_t   C1FIFOCI1 __attribute__((section("sfrs"), address(0xBF8223C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI1bits_t;
