Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __C1FIFOCI3bits_t C1FIFOCI3bits __asm__ ("C1FIFOCI3") __attribute__((section("sfrs"), address(0xBF822440)));
extern volatile uint32_t        C1FIFOCI3CLR __attribute__((section("sfrs"),address(0xBF822444)));
extern volatile uint32_t        C1FIFOCI3SET __attribute__((section("sfrs"),address(0xBF822448)));
extern volatile uint32_t        C1FIFOCI3INV __attribute__((section("sfrs"),address(0xBF82244C)));
#define C1FIFOCON4 C1FIFOCON4
extern volatile uint32_t   C1FIFOCON4 __attribute__((section("sfrs"), address(0xBF822450)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON4bits_t;
extern volatile __C1FIFOCON4bits_t C1FIFOCON4bits __asm__ ("C1FIFOCON4") __attribute__((section("sfrs"), address(0xBF822450)));
extern volatile uint32_t        C1FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF822454)));
extern volatile uint32_t        C1FIFOCON4SET __attribute__((section("sfrs"),address(0xBF822458)));
extern volatile uint32_t        C1FIFOCON4INV __attribute__((section("sfrs"),address(0xBF82245C)));
#define C1FIFOINT4 C1FIFOINT4
extern volatile uint32_t   C1FIFOINT4 __attribute__((section("sfrs"), address(0xBF822460)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT4bits_t;
extern volatile __C1FIFOINT4bits_t C1FIFOINT4bits __asm__ ("C1FIFOINT4") __attribute__((section("sfrs"), address(0xBF822460)));
extern volatile uint32_t        C1FIFOINT4CLR __attribute__((section("sfrs"),address(0xBF822464)));
extern volatile uint32_t        C1FIFOINT4SET __attribute__((section("sfrs"),address(0xBF822468)));
extern volatile uint32_t        C1FIFOINT4INV __attribute__((section("sfrs"),address(0xBF82246C)));
#define C1FIFOUA4 C1FIFOUA4
extern volatile uint32_t   C1FIFOUA4 __attribute__((section("sfrs"), address(0xBF822470)));
extern volatile uint32_t        C1FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF822474)));
extern volatile uint32_t        C1FIFOUA4SET __attribute__((section("sfrs"),address(0xBF822478)));
extern volatile uint32_t        C1FIFOUA4INV __attribute__((section("sfrs"),address(0xBF82247C)));
#define C1FIFOCI4 C1FIFOCI4
extern volatile uint32_t   C1FIFOCI4 __attribute__((section("sfrs"), address(0xBF822480)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI4bits_t;
extern volatile __C1FIFOCI4bits_t C1FIFOCI4bits __asm__ ("C1FIFOCI4") __attribute__((section("sfrs"), address(0xBF822480)));
extern volatile uint32_t        C1FIFOCI4CLR __attribute__((section("sfrs"),address(0xBF822484)));
extern volatile uint32_t        C1FIFOCI4SET __attribute__((section("sfrs"),address(0xBF822488)));
extern volatile uint32_t        C1FIFOCI4INV __attribute__((section("sfrs"),address(0xBF82248C)));
#define C1FIFOCON5 C1FIFOCON5
extern volatile uint32_t   C1FIFOCON5 __attribute__((section("sfrs"), address(0xBF822490)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON5bits_t;
extern volatile __C1FIFOCON5bits_t C1FIFOCON5bits __asm__ ("C1FIFOCON5") __attribute__((section("sfrs"), address(0xBF822490)));
extern volatile uint32_t        C1FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF822494)));
extern volatile uint32_t        C1FIFOCON5SET __attribute__((section("sfrs"),address(0xBF822498)));
extern volatile uint32_t        C1FIFOCON5INV __attribute__((section("sfrs"),address(0xBF82249C)));
#define C1FIFOINT5 C1FIFOINT5
extern volatile uint32_t   C1FIFOINT5 __attribute__((section("sfrs"), address(0xBF8224A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT5bits_t;
extern volatile __C1FIFOINT5bits_t C1FIFOINT5bits __asm__ ("C1FIFOINT5") __attribute__((section("sfrs"), address(0xBF8224A0)));
extern volatile uint32_t        C1FIFOINT5CLR __attribute__((section("sfrs"),address(0xBF8224A4)));
extern volatile uint32_t        C1FIFOINT5SET __attribute__((section("sfrs"),address(0xBF8224A8)));
extern volatile uint32_t        C1FIFOINT5INV __attribute__((section("sfrs"),address(0xBF8224AC)));
#define C1FIFOUA5 C1FIFOUA5
extern volatile uint32_t   C1FIFOUA5 __attribute__((section("sfrs"), address(0xBF8224B0)));
extern volatile uint32_t        C1FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF8224B4)));
extern volatile uint32_t        C1FIFOUA5SET __attribute__((section("sfrs"),address(0xBF8224B8)));
extern volatile uint32_t        C1FIFOUA5INV __attribute__((section("sfrs"),address(0xBF8224BC)));
#define C1FIFOCI5 C1FIFOCI5
extern volatile uint32_t   C1FIFOCI5 __attribute__((section("sfrs"), address(0xBF8224C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI5bits_t;
