Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __C1FIFOINT8bits_t C1FIFOINT8bits __asm__ ("C1FIFOINT8") __attribute__((section("sfrs"), address(0xBF822560)));
extern volatile uint32_t        C1FIFOINT8CLR __attribute__((section("sfrs"),address(0xBF822564)));
extern volatile uint32_t        C1FIFOINT8SET __attribute__((section("sfrs"),address(0xBF822568)));
extern volatile uint32_t        C1FIFOINT8INV __attribute__((section("sfrs"),address(0xBF82256C)));
#define C1FIFOUA8 C1FIFOUA8
extern volatile uint32_t   C1FIFOUA8 __attribute__((section("sfrs"), address(0xBF822570)));
extern volatile uint32_t        C1FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF822574)));
extern volatile uint32_t        C1FIFOUA8SET __attribute__((section("sfrs"),address(0xBF822578)));
extern volatile uint32_t        C1FIFOUA8INV __attribute__((section("sfrs"),address(0xBF82257C)));
#define C1FIFOCI8 C1FIFOCI8
extern volatile uint32_t   C1FIFOCI8 __attribute__((section("sfrs"), address(0xBF822580)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI8bits_t;
extern volatile __C1FIFOCI8bits_t C1FIFOCI8bits __asm__ ("C1FIFOCI8") __attribute__((section("sfrs"), address(0xBF822580)));
extern volatile uint32_t        C1FIFOCI8CLR __attribute__((section("sfrs"),address(0xBF822584)));
extern volatile uint32_t        C1FIFOCI8SET __attribute__((section("sfrs"),address(0xBF822588)));
extern volatile uint32_t        C1FIFOCI8INV __attribute__((section("sfrs"),address(0xBF82258C)));
#define C1FIFOCON9 C1FIFOCON9
extern volatile uint32_t   C1FIFOCON9 __attribute__((section("sfrs"), address(0xBF822590)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON9bits_t;
extern volatile __C1FIFOCON9bits_t C1FIFOCON9bits __asm__ ("C1FIFOCON9") __attribute__((section("sfrs"), address(0xBF822590)));
extern volatile uint32_t        C1FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF822594)));
extern volatile uint32_t        C1FIFOCON9SET __attribute__((section("sfrs"),address(0xBF822598)));
extern volatile uint32_t        C1FIFOCON9INV __attribute__((section("sfrs"),address(0xBF82259C)));
#define C1FIFOINT9 C1FIFOINT9
extern volatile uint32_t   C1FIFOINT9 __attribute__((section("sfrs"), address(0xBF8225A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT9bits_t;
extern volatile __C1FIFOINT9bits_t C1FIFOINT9bits __asm__ ("C1FIFOINT9") __attribute__((section("sfrs"), address(0xBF8225A0)));
extern volatile uint32_t        C1FIFOINT9CLR __attribute__((section("sfrs"),address(0xBF8225A4)));
extern volatile uint32_t        C1FIFOINT9SET __attribute__((section("sfrs"),address(0xBF8225A8)));
extern volatile uint32_t        C1FIFOINT9INV __attribute__((section("sfrs"),address(0xBF8225AC)));
#define C1FIFOUA9 C1FIFOUA9
extern volatile uint32_t   C1FIFOUA9 __attribute__((section("sfrs"), address(0xBF8225B0)));
extern volatile uint32_t        C1FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF8225B4)));
extern volatile uint32_t        C1FIFOUA9SET __attribute__((section("sfrs"),address(0xBF8225B8)));
extern volatile uint32_t        C1FIFOUA9INV __attribute__((section("sfrs"),address(0xBF8225BC)));
#define C1FIFOCI9 C1FIFOCI9
extern volatile uint32_t   C1FIFOCI9 __attribute__((section("sfrs"), address(0xBF8225C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI9bits_t;
extern volatile __C1FIFOCI9bits_t C1FIFOCI9bits __asm__ ("C1FIFOCI9") __attribute__((section("sfrs"), address(0xBF8225C0)));
extern volatile uint32_t        C1FIFOCI9CLR __attribute__((section("sfrs"),address(0xBF8225C4)));
extern volatile uint32_t        C1FIFOCI9SET __attribute__((section("sfrs"),address(0xBF8225C8)));
extern volatile uint32_t        C1FIFOCI9INV __attribute__((section("sfrs"),address(0xBF8225CC)));
#define C1FIFOCON10 C1FIFOCON10
extern volatile uint32_t   C1FIFOCON10 __attribute__((section("sfrs"), address(0xBF8225D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON10bits_t;
extern volatile __C1FIFOCON10bits_t C1FIFOCON10bits __asm__ ("C1FIFOCON10") __attribute__((section("sfrs"), address(0xBF8225D0)));
extern volatile uint32_t        C1FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF8225D4)));
extern volatile uint32_t        C1FIFOCON10SET __attribute__((section("sfrs"),address(0xBF8225D8)));
extern volatile uint32_t        C1FIFOCON10INV __attribute__((section("sfrs"),address(0xBF8225DC)));
#define C1FIFOINT10 C1FIFOINT10
extern volatile uint32_t   C1FIFOINT10 __attribute__((section("sfrs"), address(0xBF8225E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT10bits_t;
extern volatile __C1FIFOINT10bits_t C1FIFOINT10bits __asm__ ("C1FIFOINT10") __attribute__((section("sfrs"), address(0xBF8225E0)));
extern volatile uint32_t        C1FIFOINT10CLR __attribute__((section("sfrs"),address(0xBF8225E4)));
extern volatile uint32_t        C1FIFOINT10SET __attribute__((section("sfrs"),address(0xBF8225E8)));
extern volatile uint32_t        C1FIFOINT10INV __attribute__((section("sfrs"),address(0xBF8225EC)));
#define C1FIFOUA10 C1FIFOUA10
extern volatile uint32_t   C1FIFOUA10 __attribute__((section("sfrs"), address(0xBF8225F0)));
extern volatile uint32_t        C1FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF8225F4)));
extern volatile uint32_t        C1FIFOUA10SET __attribute__((section("sfrs"),address(0xBF8225F8)));
extern volatile uint32_t        C1FIFOUA10INV __attribute__((section("sfrs"),address(0xBF8225FC)));
#define C1FIFOCI10 C1FIFOCI10
extern volatile uint32_t   C1FIFOCI10 __attribute__((section("sfrs"), address(0xBF822600)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI10bits_t;
