Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __C1FIFOCI10bits_t C1FIFOCI10bits __asm__ ("C1FIFOCI10") __attribute__((section("sfrs"), address(0xBF822600)));
extern volatile uint32_t        C1FIFOCI10CLR __attribute__((section("sfrs"),address(0xBF822604)));
extern volatile uint32_t        C1FIFOCI10SET __attribute__((section("sfrs"),address(0xBF822608)));
extern volatile uint32_t        C1FIFOCI10INV __attribute__((section("sfrs"),address(0xBF82260C)));
#define C1FIFOCON11 C1FIFOCON11
extern volatile uint32_t   C1FIFOCON11 __attribute__((section("sfrs"), address(0xBF822610)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON11bits_t;
extern volatile __C1FIFOCON11bits_t C1FIFOCON11bits __asm__ ("C1FIFOCON11") __attribute__((section("sfrs"), address(0xBF822610)));
extern volatile uint32_t        C1FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF822614)));
extern volatile uint32_t        C1FIFOCON11SET __attribute__((section("sfrs"),address(0xBF822618)));
extern volatile uint32_t        C1FIFOCON11INV __attribute__((section("sfrs"),address(0xBF82261C)));
#define C1FIFOINT11 C1FIFOINT11
extern volatile uint32_t   C1FIFOINT11 __attribute__((section("sfrs"), address(0xBF822620)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT11bits_t;
extern volatile __C1FIFOINT11bits_t C1FIFOINT11bits __asm__ ("C1FIFOINT11") __attribute__((section("sfrs"), address(0xBF822620)));
extern volatile uint32_t        C1FIFOINT11CLR __attribute__((section("sfrs"),address(0xBF822624)));
extern volatile uint32_t        C1FIFOINT11SET __attribute__((section("sfrs"),address(0xBF822628)));
extern volatile uint32_t        C1FIFOINT11INV __attribute__((section("sfrs"),address(0xBF82262C)));
#define C1FIFOUA11 C1FIFOUA11
extern volatile uint32_t   C1FIFOUA11 __attribute__((section("sfrs"), address(0xBF822630)));
extern volatile uint32_t        C1FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF822634)));
extern volatile uint32_t        C1FIFOUA11SET __attribute__((section("sfrs"),address(0xBF822638)));
extern volatile uint32_t        C1FIFOUA11INV __attribute__((section("sfrs"),address(0xBF82263C)));
#define C1FIFOCI11 C1FIFOCI11
extern volatile uint32_t   C1FIFOCI11 __attribute__((section("sfrs"), address(0xBF822640)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI11bits_t;
extern volatile __C1FIFOCI11bits_t C1FIFOCI11bits __asm__ ("C1FIFOCI11") __attribute__((section("sfrs"), address(0xBF822640)));
extern volatile uint32_t        C1FIFOCI11CLR __attribute__((section("sfrs"),address(0xBF822644)));
extern volatile uint32_t        C1FIFOCI11SET __attribute__((section("sfrs"),address(0xBF822648)));
extern volatile uint32_t        C1FIFOCI11INV __attribute__((section("sfrs"),address(0xBF82264C)));
#define C1FIFOCON12 C1FIFOCON12
extern volatile uint32_t   C1FIFOCON12 __attribute__((section("sfrs"), address(0xBF822650)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON12bits_t;
extern volatile __C1FIFOCON12bits_t C1FIFOCON12bits __asm__ ("C1FIFOCON12") __attribute__((section("sfrs"), address(0xBF822650)));
extern volatile uint32_t        C1FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF822654)));
extern volatile uint32_t        C1FIFOCON12SET __attribute__((section("sfrs"),address(0xBF822658)));
extern volatile uint32_t        C1FIFOCON12INV __attribute__((section("sfrs"),address(0xBF82265C)));
#define C1FIFOINT12 C1FIFOINT12
extern volatile uint32_t   C1FIFOINT12 __attribute__((section("sfrs"), address(0xBF822660)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT12bits_t;
extern volatile __C1FIFOINT12bits_t C1FIFOINT12bits __asm__ ("C1FIFOINT12") __attribute__((section("sfrs"), address(0xBF822660)));
extern volatile uint32_t        C1FIFOINT12CLR __attribute__((section("sfrs"),address(0xBF822664)));
extern volatile uint32_t        C1FIFOINT12SET __attribute__((section("sfrs"),address(0xBF822668)));
extern volatile uint32_t        C1FIFOINT12INV __attribute__((section("sfrs"),address(0xBF82266C)));
#define C1FIFOUA12 C1FIFOUA12
extern volatile uint32_t   C1FIFOUA12 __attribute__((section("sfrs"), address(0xBF822670)));
extern volatile uint32_t        C1FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF822674)));
extern volatile uint32_t        C1FIFOUA12SET __attribute__((section("sfrs"),address(0xBF822678)));
extern volatile uint32_t        C1FIFOUA12INV __attribute__((section("sfrs"),address(0xBF82267C)));
#define C1FIFOCI12 C1FIFOCI12
extern volatile uint32_t   C1FIFOCI12 __attribute__((section("sfrs"), address(0xBF822680)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI12bits_t;
extern volatile __C1FIFOCI12bits_t C1FIFOCI12bits __asm__ ("C1FIFOCI12") __attribute__((section("sfrs"), address(0xBF822680)));
extern volatile uint32_t        C1FIFOCI12CLR __attribute__((section("sfrs"),address(0xBF822684)));
extern volatile uint32_t        C1FIFOCI12SET __attribute__((section("sfrs"),address(0xBF822688)));
extern volatile uint32_t        C1FIFOCI12INV __attribute__((section("sfrs"),address(0xBF82268C)));
#define C1FIFOCON13 C1FIFOCON13
extern volatile uint32_t   C1FIFOCON13 __attribute__((section("sfrs"), address(0xBF822690)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON13bits_t;
extern volatile __C1FIFOCON13bits_t C1FIFOCON13bits __asm__ ("C1FIFOCON13") __attribute__((section("sfrs"), address(0xBF822690)));
extern volatile uint32_t        C1FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF822694)));
extern volatile uint32_t        C1FIFOCON13SET __attribute__((section("sfrs"),address(0xBF822698)));
extern volatile uint32_t        C1FIFOCON13INV __attribute__((section("sfrs"),address(0xBF82269C)));
#define C1FIFOINT13 C1FIFOINT13
extern volatile uint32_t   C1FIFOINT13 __attribute__((section("sfrs"), address(0xBF8226A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT13bits_t;
extern volatile __C1FIFOINT13bits_t C1FIFOINT13bits __asm__ ("C1FIFOINT13") __attribute__((section("sfrs"), address(0xBF8226A0)));
extern volatile uint32_t        C1FIFOINT13CLR __attribute__((section("sfrs"),address(0xBF8226A4)));
extern volatile uint32_t        C1FIFOINT13SET __attribute__((section("sfrs"),address(0xBF8226A8)));
extern volatile uint32_t        C1FIFOINT13INV __attribute__((section("sfrs"),address(0xBF8226AC)));
#define C1FIFOUA13 C1FIFOUA13
extern volatile uint32_t   C1FIFOUA13 __attribute__((section("sfrs"), address(0xBF8226B0)));
extern volatile uint32_t        C1FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF8226B4)));
extern volatile uint32_t        C1FIFOUA13SET __attribute__((section("sfrs"),address(0xBF8226B8)));
extern volatile uint32_t        C1FIFOUA13INV __attribute__((section("sfrs"),address(0xBF8226BC)));
#define C1FIFOCI13 C1FIFOCI13
extern volatile uint32_t   C1FIFOCI13 __attribute__((section("sfrs"), address(0xBF8226C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI13bits_t;
extern volatile __C1FIFOCI13bits_t C1FIFOCI13bits __asm__ ("C1FIFOCI13") __attribute__((section("sfrs"), address(0xBF8226C0)));
extern volatile uint32_t        C1FIFOCI13CLR __attribute__((section("sfrs"),address(0xBF8226C4)));
extern volatile uint32_t        C1FIFOCI13SET __attribute__((section("sfrs"),address(0xBF8226C8)));
extern volatile uint32_t        C1FIFOCI13INV __attribute__((section("sfrs"),address(0xBF8226CC)));
#define C1FIFOCON14 C1FIFOCON14
extern volatile uint32_t   C1FIFOCON14 __attribute__((section("sfrs"), address(0xBF8226D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON14bits_t;
