Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __C1FIFOCON14bits_t C1FIFOCON14bits __asm__ ("C1FIFOCON14") __attribute__((section("sfrs"), address(0xBF8226D0)));
extern volatile uint32_t        C1FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF8226D4)));
extern volatile uint32_t        C1FIFOCON14SET __attribute__((section("sfrs"),address(0xBF8226D8)));
extern volatile uint32_t        C1FIFOCON14INV __attribute__((section("sfrs"),address(0xBF8226DC)));
#define C1FIFOINT14 C1FIFOINT14
extern volatile uint32_t   C1FIFOINT14 __attribute__((section("sfrs"), address(0xBF8226E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT14bits_t;
extern volatile __C1FIFOINT14bits_t C1FIFOINT14bits __asm__ ("C1FIFOINT14") __attribute__((section("sfrs"), address(0xBF8226E0)));
extern volatile uint32_t        C1FIFOINT14CLR __attribute__((section("sfrs"),address(0xBF8226E4)));
extern volatile uint32_t        C1FIFOINT14SET __attribute__((section("sfrs"),address(0xBF8226E8)));
extern volatile uint32_t        C1FIFOINT14INV __attribute__((section("sfrs"),address(0xBF8226EC)));
#define C1FIFOUA14 C1FIFOUA14
extern volatile uint32_t   C1FIFOUA14 __attribute__((section("sfrs"), address(0xBF8226F0)));
extern volatile uint32_t        C1FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF8226F4)));
extern volatile uint32_t        C1FIFOUA14SET __attribute__((section("sfrs"),address(0xBF8226F8)));
extern volatile uint32_t        C1FIFOUA14INV __attribute__((section("sfrs"),address(0xBF8226FC)));
#define C1FIFOCI14 C1FIFOCI14
extern volatile uint32_t   C1FIFOCI14 __attribute__((section("sfrs"), address(0xBF822700)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI14bits_t;
extern volatile __C1FIFOCI14bits_t C1FIFOCI14bits __asm__ ("C1FIFOCI14") __attribute__((section("sfrs"), address(0xBF822700)));
extern volatile uint32_t        C1FIFOCI14CLR __attribute__((section("sfrs"),address(0xBF822704)));
extern volatile uint32_t        C1FIFOCI14SET __attribute__((section("sfrs"),address(0xBF822708)));
extern volatile uint32_t        C1FIFOCI14INV __attribute__((section("sfrs"),address(0xBF82270C)));
#define C1FIFOCON15 C1FIFOCON15
extern volatile uint32_t   C1FIFOCON15 __attribute__((section("sfrs"), address(0xBF822710)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON15bits_t;
extern volatile __C1FIFOCON15bits_t C1FIFOCON15bits __asm__ ("C1FIFOCON15") __attribute__((section("sfrs"), address(0xBF822710)));
extern volatile uint32_t        C1FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF822714)));
extern volatile uint32_t        C1FIFOCON15SET __attribute__((section("sfrs"),address(0xBF822718)));
extern volatile uint32_t        C1FIFOCON15INV __attribute__((section("sfrs"),address(0xBF82271C)));
#define C1FIFOINT15 C1FIFOINT15
extern volatile uint32_t   C1FIFOINT15 __attribute__((section("sfrs"), address(0xBF822720)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT15bits_t;
extern volatile __C1FIFOINT15bits_t C1FIFOINT15bits __asm__ ("C1FIFOINT15") __attribute__((section("sfrs"), address(0xBF822720)));
extern volatile uint32_t        C1FIFOINT15CLR __attribute__((section("sfrs"),address(0xBF822724)));
extern volatile uint32_t        C1FIFOINT15SET __attribute__((section("sfrs"),address(0xBF822728)));
extern volatile uint32_t        C1FIFOINT15INV __attribute__((section("sfrs"),address(0xBF82272C)));
#define C1FIFOUA15 C1FIFOUA15
extern volatile uint32_t   C1FIFOUA15 __attribute__((section("sfrs"), address(0xBF822730)));
extern volatile uint32_t        C1FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF822734)));
extern volatile uint32_t        C1FIFOUA15SET __attribute__((section("sfrs"),address(0xBF822738)));
extern volatile uint32_t        C1FIFOUA15INV __attribute__((section("sfrs"),address(0xBF82273C)));
#define C1FIFOCI15 C1FIFOCI15
extern volatile uint32_t   C1FIFOCI15 __attribute__((section("sfrs"), address(0xBF822740)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI15bits_t;
extern volatile __C1FIFOCI15bits_t C1FIFOCI15bits __asm__ ("C1FIFOCI15") __attribute__((section("sfrs"), address(0xBF822740)));
extern volatile uint32_t        C1FIFOCI15CLR __attribute__((section("sfrs"),address(0xBF822744)));
extern volatile uint32_t        C1FIFOCI15SET __attribute__((section("sfrs"),address(0xBF822748)));
extern volatile uint32_t        C1FIFOCI15INV __attribute__((section("sfrs"),address(0xBF82274C)));
#define CFD2CON CFD2CON
extern volatile uint32_t   CFD2CON __attribute__((section("sfrs"), address(0xBF823000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t ISOCRCEN:1;
    uint32_t PXEDIS:1;
    uint32_t CLKSEL0:1;
    uint32_t WAKFIL:1;
    uint32_t WFT:2;
    uint32_t CANBUSY:1;
    uint32_t BRSDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t RTXAT:1;
    uint32_t ESIGM:1;
    uint32_t SERR2LOM:1;
    uint32_t STEF:1;
    uint32_t TXQEN:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
    uint32_t TXBWS:4;
  };
  struct {
    uint32_t w:32;
  };
} __CFD2CONbits_t;
