Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __CFD2CONbits_t CFD2CONbits __asm__ ("CFD2CON") __attribute__((section("sfrs"), address(0xBF823000)));
#define CFD2NBTCFG CFD2NBTCFG
extern volatile uint32_t   CFD2NBTCFG __attribute__((section("sfrs"), address(0xBF823004)));
typedef struct {
  uint32_t SJW:7;
  uint32_t :1;
  uint32_t TSEG2:7;
  uint32_t :1;
  uint32_t TSEG1:8;
  uint32_t BRP:8;
} __CFD2NBTCFGbits_t;
extern volatile __CFD2NBTCFGbits_t CFD2NBTCFGbits __asm__ ("CFD2NBTCFG") __attribute__((section("sfrs"), address(0xBF823004)));
#define CFD2DBTCFG CFD2DBTCFG
extern volatile uint32_t   CFD2DBTCFG __attribute__((section("sfrs"), address(0xBF823008)));
typedef struct {
  uint32_t SJW:4;
  uint32_t :4;
  uint32_t TSEG2:4;
  uint32_t :4;
  uint32_t TSEG1:5;
  uint32_t :3;
  uint32_t BRP:8;
} __CFD2DBTCFGbits_t;
extern volatile __CFD2DBTCFGbits_t CFD2DBTCFGbits __asm__ ("CFD2DBTCFG") __attribute__((section("sfrs"), address(0xBF823008)));
#define CFD2TDC CFD2TDC
extern volatile uint32_t   CFD2TDC __attribute__((section("sfrs"), address(0xBF82300C)));
typedef struct {
  uint32_t TDCV:6;
  uint32_t :2;
  uint32_t TDCO:7;
  uint32_t :1;
  uint32_t TDCMOD:2;
  uint32_t :6;
  uint32_t SID11EN:1;
  uint32_t EDGFLTEN:1;
} __CFD2TDCbits_t;
extern volatile __CFD2TDCbits_t CFD2TDCbits __asm__ ("CFD2TDC") __attribute__((section("sfrs"), address(0xBF82300C)));
#define CFD2TBC CFD2TBC
extern volatile uint32_t   CFD2TBC __attribute__((section("sfrs"), address(0xBF823010)));
typedef struct {
  uint32_t TBC:32;
} __CFD2TBCbits_t;
extern volatile __CFD2TBCbits_t CFD2TBCbits __asm__ ("CFD2TBC") __attribute__((section("sfrs"), address(0xBF823010)));
#define CFD2TSCON CFD2TSCON
extern volatile uint32_t   CFD2TSCON __attribute__((section("sfrs"), address(0xBF823014)));
typedef struct {
  uint32_t TBCPRE:10;
  uint32_t :6;
  uint32_t TBCEN:1;
  uint32_t TSEOF:1;
  uint32_t TSRES:1;
} __CFD2TSCONbits_t;
extern volatile __CFD2TSCONbits_t CFD2TSCONbits __asm__ ("CFD2TSCON") __attribute__((section("sfrs"), address(0xBF823014)));
#define CFD2VEC CFD2VEC
extern volatile uint32_t   CFD2VEC __attribute__((section("sfrs"), address(0xBF823018)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
    uint32_t :3;
    uint32_t TXCODE:7;
    uint32_t :1;
    uint32_t RXCODE:7;
  };
  struct {
    uint32_t w:32;
  };
} __CFD2VECbits_t;
extern volatile __CFD2VECbits_t CFD2VECbits __asm__ ("CFD2VEC") __attribute__((section("sfrs"), address(0xBF823018)));
#define CFD2INT CFD2INT
extern volatile uint32_t   CFD2INT __attribute__((section("sfrs"), address(0xBF82301C)));
typedef union {
  struct {
    uint32_t TXIF:1;
    uint32_t RXIF:1;
    uint32_t TBCIF:1;
    uint32_t MODIF:1;
    uint32_t TEFIF:1;
    uint32_t :3;
    uint32_t ECCIF:1;
    uint32_t SPICRCIF:1;
    uint32_t TXATIF:1;
    uint32_t RXOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVMIF:1;
    uint32_t TXIE:1;
    uint32_t RXIE:1;
    uint32_t TBCIE:1;
    uint32_t MODIE:1;
    uint32_t TEFIE:1;
    uint32_t :3;
    uint32_t ECCIE:1;
    uint32_t SPICRCIE:1;
    uint32_t TXATIE:1;
    uint32_t RXOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVMIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD2INTbits_t;
extern volatile __CFD2INTbits_t CFD2INTbits __asm__ ("CFD2INT") __attribute__((section("sfrs"), address(0xBF82301C)));
#define CFD2RXIF CFD2RXIF
extern volatile uint32_t   CFD2RXIF __attribute__((section("sfrs"), address(0xBF823020)));
typedef struct {
  uint32_t :1;
  uint32_t RFIF:31;
} __CFD2RXIFbits_t;
extern volatile __CFD2RXIFbits_t CFD2RXIFbits __asm__ ("CFD2RXIF") __attribute__((section("sfrs"), address(0xBF823020)));
#define CFD2TXIF CFD2TXIF
extern volatile uint32_t   CFD2TXIF __attribute__((section("sfrs"), address(0xBF823024)));
typedef struct {
  uint32_t TFIF:32;
} __CFD2TXIFbits_t;
extern volatile __CFD2TXIFbits_t CFD2TXIFbits __asm__ ("CFD2TXIF") __attribute__((section("sfrs"), address(0xBF823024)));
#define CFD2RXOVIF CFD2RXOVIF
extern volatile uint32_t   CFD2RXOVIF __attribute__((section("sfrs"), address(0xBF823028)));
typedef struct {
  uint32_t :1;
  uint32_t RFOVIF:31;
} __CFD2RXOVIFbits_t;
extern volatile __CFD2RXOVIFbits_t CFD2RXOVIFbits __asm__ ("CFD2RXOVIF") __attribute__((section("sfrs"), address(0xBF823028)));
#define CFD2TXATIF CFD2TXATIF
extern volatile uint32_t   CFD2TXATIF __attribute__((section("sfrs"), address(0xBF82302C)));
typedef struct {
  uint32_t TFATIF:32;
} __CFD2TXATIFbits_t;
extern volatile __CFD2TXATIFbits_t CFD2TXATIFbits __asm__ ("CFD2TXATIF") __attribute__((section("sfrs"), address(0xBF82302C)));
#define CFD2TXREQ CFD2TXREQ
extern volatile uint32_t   CFD2TXREQ __attribute__((section("sfrs"), address(0xBF823030)));
typedef struct {
  uint32_t TXREQ:32;
} __CFD2TXREQbits_t;
extern volatile __CFD2TXREQbits_t CFD2TXREQbits __asm__ ("CFD2TXREQ") __attribute__((section("sfrs"), address(0xBF823030)));
#define CFD2TREC CFD2TREC
extern volatile uint32_t   CFD2TREC __attribute__((section("sfrs"), address(0xBF823034)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD2TRECbits_t;
extern volatile __CFD2TRECbits_t CFD2TRECbits __asm__ ("CFD2TREC") __attribute__((section("sfrs"), address(0xBF823034)));
#define CFD2BDIAG0 CFD2BDIAG0
extern volatile uint32_t   CFD2BDIAG0 __attribute__((section("sfrs"), address(0xBF823038)));
typedef struct {
  uint32_t NRERRCNT:8;
  uint32_t NTERRCNT:8;
  uint32_t DRERRCNT:8;
  uint32_t DTERRCNT:8;
} __CFD2BDIAG0bits_t;
extern volatile __CFD2BDIAG0bits_t CFD2BDIAG0bits __asm__ ("CFD2BDIAG0") __attribute__((section("sfrs"), address(0xBF823038)));
#define CFD2BDIAG1 CFD2BDIAG1
extern volatile uint32_t   CFD2BDIAG1 __attribute__((section("sfrs"), address(0xBF82303C)));
typedef struct {
  uint32_t EFMSGCNT:16;
  uint32_t NBIT0ERR:1;
  uint32_t NBIT1ERR:1;
  uint32_t NACKERR:1;
  uint32_t NFORMERR:1;
  uint32_t NSTUFERR:1;
  uint32_t NCRCERR:1;
  uint32_t :2;
  uint32_t DBIT0ERR:1;
  uint32_t DBIT1ERR:1;
  uint32_t :1;
  uint32_t DFORMERR:1;
  uint32_t DSTUFERR:1;
  uint32_t DCRCERR:1;
  uint32_t ESI:1;
  uint32_t DLCMM:1;
} __CFD2BDIAG1bits_t;
extern volatile __CFD2BDIAG1bits_t CFD2BDIAG1bits __asm__ ("CFD2BDIAG1") __attribute__((section("sfrs"), address(0xBF82303C)));
#define CFD2TEFCON CFD2TEFCON
extern volatile uint32_t   CFD2TEFCON __attribute__((section("sfrs"), address(0xBF823040)));
typedef struct {
  uint32_t TEFNEIE:1;
  uint32_t TEFHIE:1;
  uint32_t TEFFIE:1;
  uint32_t TEFOVIE:1;
  uint32_t :1;
  uint32_t TEFTSEN:1;
  uint32_t :2;
  uint32_t UINC:1;
  uint32_t :1;
  uint32_t FRESET:1;
  uint32_t :13;
  uint32_t FSIZE:5;
} __CFD2TEFCONbits_t;
extern volatile __CFD2TEFCONbits_t CFD2TEFCONbits __asm__ ("CFD2TEFCON") __attribute__((section("sfrs"), address(0xBF823040)));
#define CFD2TEFSTA CFD2TEFSTA
extern volatile uint32_t   CFD2TEFSTA __attribute__((section("sfrs"), address(0xBF823044)));
typedef struct {
  uint32_t TEFNEIF:1;
  uint32_t TEFHIF:1;
  uint32_t TEFFIF:1;
  uint32_t TEFOVIF:1;
} __CFD2TEFSTAbits_t;
extern volatile __CFD2TEFSTAbits_t CFD2TEFSTAbits __asm__ ("CFD2TEFSTA") __attribute__((section("sfrs"), address(0xBF823044)));
#define CFD2TEFUA CFD2TEFUA
extern volatile uint32_t   CFD2TEFUA __attribute__((section("sfrs"), address(0xBF823048)));
typedef struct {
  uint32_t TEFUA:32;
} __CFD2TEFUAbits_t;
extern volatile __CFD2TEFUAbits_t CFD2TEFUAbits __asm__ ("CFD2TEFUA") __attribute__((section("sfrs"), address(0xBF823048)));
#define CFD2FIFOBA CFD2FIFOBA
extern volatile uint32_t   CFD2FIFOBA __attribute__((section("sfrs"), address(0xBF82304C)));
typedef struct {
  uint32_t FIFOBA:32;
} __CFD2FIFOBAbits_t;
extern volatile __CFD2FIFOBAbits_t CFD2FIFOBAbits __asm__ ("CFD2FIFOBA") __attribute__((section("sfrs"), address(0xBF82304C)));
#define CFD2TXQCON CFD2TXQCON
extern volatile uint32_t   CFD2TXQCON __attribute__((section("sfrs"), address(0xBF823050)));
typedef struct {
  uint32_t TXQNIE:1;
  uint32_t :1;
  uint32_t TXQEIE:1;
  uint32_t :1;
  uint32_t TXATIE:1;
  uint32_t :2;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2TXQCONbits_t;
extern volatile __CFD2TXQCONbits_t CFD2TXQCONbits __asm__ ("CFD2TXQCON") __attribute__((section("sfrs"), address(0xBF823050)));
#define CFD2TXQSTA CFD2TXQSTA
extern volatile uint32_t   CFD2TXQSTA __attribute__((section("sfrs"), address(0xBF823054)));
typedef struct {
  uint32_t TXQNIF:1;
  uint32_t :1;
  uint32_t TXQEIF:1;
  uint32_t :1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t TXQCI:5;
} __CFD2TXQSTAbits_t;
extern volatile __CFD2TXQSTAbits_t CFD2TXQSTAbits __asm__ ("CFD2TXQSTA") __attribute__((section("sfrs"), address(0xBF823054)));
#define CFD2TXQUA CFD2TXQUA
extern volatile uint32_t   CFD2TXQUA __attribute__((section("sfrs"), address(0xBF823058)));
typedef struct {
  uint32_t TXQUA:32;
} __CFD2TXQUAbits_t;
extern volatile __CFD2TXQUAbits_t CFD2TXQUAbits __asm__ ("CFD2TXQUA") __attribute__((section("sfrs"), address(0xBF823058)));
#define CFD2FIFOCON1 CFD2FIFOCON1
extern volatile uint32_t   CFD2FIFOCON1 __attribute__((section("sfrs"), address(0xBF82305C)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON1bits_t;
extern volatile __CFD2FIFOCON1bits_t CFD2FIFOCON1bits __asm__ ("CFD2FIFOCON1") __attribute__((section("sfrs"), address(0xBF82305C)));
#define CFD2FIFOSTA1 CFD2FIFOSTA1
extern volatile uint32_t   CFD2FIFOSTA1 __attribute__((section("sfrs"), address(0xBF823060)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA1bits_t;
extern volatile __CFD2FIFOSTA1bits_t CFD2FIFOSTA1bits __asm__ ("CFD2FIFOSTA1") __attribute__((section("sfrs"), address(0xBF823060)));
#define CFD2FIFOUA1 CFD2FIFOUA1
extern volatile uint32_t   CFD2FIFOUA1 __attribute__((section("sfrs"), address(0xBF823064)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA1bits_t;
extern volatile __CFD2FIFOUA1bits_t CFD2FIFOUA1bits __asm__ ("CFD2FIFOUA1") __attribute__((section("sfrs"), address(0xBF823064)));
#define CFD2FIFOCON2 CFD2FIFOCON2
extern volatile uint32_t   CFD2FIFOCON2 __attribute__((section("sfrs"), address(0xBF823068)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON2bits_t;
extern volatile __CFD2FIFOCON2bits_t CFD2FIFOCON2bits __asm__ ("CFD2FIFOCON2") __attribute__((section("sfrs"), address(0xBF823068)));
#define CFD2FIFOSTA2 CFD2FIFOSTA2
extern volatile uint32_t   CFD2FIFOSTA2 __attribute__((section("sfrs"), address(0xBF82306C)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA2bits_t;
extern volatile __CFD2FIFOSTA2bits_t CFD2FIFOSTA2bits __asm__ ("CFD2FIFOSTA2") __attribute__((section("sfrs"), address(0xBF82306C)));
#define CFD2FIFOUA2 CFD2FIFOUA2
extern volatile uint32_t   CFD2FIFOUA2 __attribute__((section("sfrs"), address(0xBF823070)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA2bits_t;
