Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __CFD2FIFOCON7bits_t CFD2FIFOCON7bits __asm__ ("CFD2FIFOCON7") __attribute__((section("sfrs"), address(0xBF8230A4)));
#define CFD2FIFOSTA7 CFD2FIFOSTA7
extern volatile uint32_t   CFD2FIFOSTA7 __attribute__((section("sfrs"), address(0xBF8230A8)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA7bits_t;
extern volatile __CFD2FIFOSTA7bits_t CFD2FIFOSTA7bits __asm__ ("CFD2FIFOSTA7") __attribute__((section("sfrs"), address(0xBF8230A8)));
#define CFD2FIFOUA7 CFD2FIFOUA7
extern volatile uint32_t   CFD2FIFOUA7 __attribute__((section("sfrs"), address(0xBF8230AC)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA7bits_t;
extern volatile __CFD2FIFOUA7bits_t CFD2FIFOUA7bits __asm__ ("CFD2FIFOUA7") __attribute__((section("sfrs"), address(0xBF8230AC)));
#define CFD2FIFOCON8 CFD2FIFOCON8
extern volatile uint32_t   CFD2FIFOCON8 __attribute__((section("sfrs"), address(0xBF8230B0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON8bits_t;
extern volatile __CFD2FIFOCON8bits_t CFD2FIFOCON8bits __asm__ ("CFD2FIFOCON8") __attribute__((section("sfrs"), address(0xBF8230B0)));
#define CFD2FIFOSTA8 CFD2FIFOSTA8
extern volatile uint32_t   CFD2FIFOSTA8 __attribute__((section("sfrs"), address(0xBF8230B4)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA8bits_t;
extern volatile __CFD2FIFOSTA8bits_t CFD2FIFOSTA8bits __asm__ ("CFD2FIFOSTA8") __attribute__((section("sfrs"), address(0xBF8230B4)));
#define CFD2FIFOUA8 CFD2FIFOUA8
extern volatile uint32_t   CFD2FIFOUA8 __attribute__((section("sfrs"), address(0xBF8230B8)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA8bits_t;
extern volatile __CFD2FIFOUA8bits_t CFD2FIFOUA8bits __asm__ ("CFD2FIFOUA8") __attribute__((section("sfrs"), address(0xBF8230B8)));
#define CFD2FIFOCON9 CFD2FIFOCON9
extern volatile uint32_t   CFD2FIFOCON9 __attribute__((section("sfrs"), address(0xBF8230BC)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON9bits_t;
extern volatile __CFD2FIFOCON9bits_t CFD2FIFOCON9bits __asm__ ("CFD2FIFOCON9") __attribute__((section("sfrs"), address(0xBF8230BC)));
#define CFD2FIFOSTA9 CFD2FIFOSTA9
extern volatile uint32_t   CFD2FIFOSTA9 __attribute__((section("sfrs"), address(0xBF8230C0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA9bits_t;
extern volatile __CFD2FIFOSTA9bits_t CFD2FIFOSTA9bits __asm__ ("CFD2FIFOSTA9") __attribute__((section("sfrs"), address(0xBF8230C0)));
#define CFD2FIFOUA9 CFD2FIFOUA9
extern volatile uint32_t   CFD2FIFOUA9 __attribute__((section("sfrs"), address(0xBF8230C4)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA9bits_t;
extern volatile __CFD2FIFOUA9bits_t CFD2FIFOUA9bits __asm__ ("CFD2FIFOUA9") __attribute__((section("sfrs"), address(0xBF8230C4)));
#define CFD2FIFOCON10 CFD2FIFOCON10
extern volatile uint32_t   CFD2FIFOCON10 __attribute__((section("sfrs"), address(0xBF8230C8)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON10bits_t;
extern volatile __CFD2FIFOCON10bits_t CFD2FIFOCON10bits __asm__ ("CFD2FIFOCON10") __attribute__((section("sfrs"), address(0xBF8230C8)));
#define CFD2FIFOSTA10 CFD2FIFOSTA10
extern volatile uint32_t   CFD2FIFOSTA10 __attribute__((section("sfrs"), address(0xBF8230CC)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA10bits_t;
extern volatile __CFD2FIFOSTA10bits_t CFD2FIFOSTA10bits __asm__ ("CFD2FIFOSTA10") __attribute__((section("sfrs"), address(0xBF8230CC)));
#define CFD2FIFOUA10 CFD2FIFOUA10
extern volatile uint32_t   CFD2FIFOUA10 __attribute__((section("sfrs"), address(0xBF8230D0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA10bits_t;
extern volatile __CFD2FIFOUA10bits_t CFD2FIFOUA10bits __asm__ ("CFD2FIFOUA10") __attribute__((section("sfrs"), address(0xBF8230D0)));
#define CFD2FIFOCON11 CFD2FIFOCON11
extern volatile uint32_t   CFD2FIFOCON11 __attribute__((section("sfrs"), address(0xBF8230D4)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON11bits_t;
extern volatile __CFD2FIFOCON11bits_t CFD2FIFOCON11bits __asm__ ("CFD2FIFOCON11") __attribute__((section("sfrs"), address(0xBF8230D4)));
#define CFD2FIFOSTA11 CFD2FIFOSTA11
extern volatile uint32_t   CFD2FIFOSTA11 __attribute__((section("sfrs"), address(0xBF8230D8)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA11bits_t;
extern volatile __CFD2FIFOSTA11bits_t CFD2FIFOSTA11bits __asm__ ("CFD2FIFOSTA11") __attribute__((section("sfrs"), address(0xBF8230D8)));
#define CFD2FIFOUA11 CFD2FIFOUA11
extern volatile uint32_t   CFD2FIFOUA11 __attribute__((section("sfrs"), address(0xBF8230DC)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA11bits_t;
extern volatile __CFD2FIFOUA11bits_t CFD2FIFOUA11bits __asm__ ("CFD2FIFOUA11") __attribute__((section("sfrs"), address(0xBF8230DC)));
#define CFD2FIFOCON12 CFD2FIFOCON12
extern volatile uint32_t   CFD2FIFOCON12 __attribute__((section("sfrs"), address(0xBF8230E0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON12bits_t;
extern volatile __CFD2FIFOCON12bits_t CFD2FIFOCON12bits __asm__ ("CFD2FIFOCON12") __attribute__((section("sfrs"), address(0xBF8230E0)));
#define CFD2FIFOSTA12 CFD2FIFOSTA12
extern volatile uint32_t   CFD2FIFOSTA12 __attribute__((section("sfrs"), address(0xBF8230E4)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA12bits_t;
