Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __CFD2FIFOSTA12bits_t CFD2FIFOSTA12bits __asm__ ("CFD2FIFOSTA12") __attribute__((section("sfrs"), address(0xBF8230E4)));
#define CFD2FIFOUA12 CFD2FIFOUA12
extern volatile uint32_t   CFD2FIFOUA12 __attribute__((section("sfrs"), address(0xBF8230E8)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA12bits_t;
extern volatile __CFD2FIFOUA12bits_t CFD2FIFOUA12bits __asm__ ("CFD2FIFOUA12") __attribute__((section("sfrs"), address(0xBF8230E8)));
#define CFD2FIFOCON13 CFD2FIFOCON13
extern volatile uint32_t   CFD2FIFOCON13 __attribute__((section("sfrs"), address(0xBF8230EC)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON13bits_t;
extern volatile __CFD2FIFOCON13bits_t CFD2FIFOCON13bits __asm__ ("CFD2FIFOCON13") __attribute__((section("sfrs"), address(0xBF8230EC)));
#define CFD2FIFOSTA13 CFD2FIFOSTA13
extern volatile uint32_t   CFD2FIFOSTA13 __attribute__((section("sfrs"), address(0xBF8230F0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA13bits_t;
extern volatile __CFD2FIFOSTA13bits_t CFD2FIFOSTA13bits __asm__ ("CFD2FIFOSTA13") __attribute__((section("sfrs"), address(0xBF8230F0)));
#define CFD2FIFOUA13 CFD2FIFOUA13
extern volatile uint32_t   CFD2FIFOUA13 __attribute__((section("sfrs"), address(0xBF8230F4)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA13bits_t;
extern volatile __CFD2FIFOUA13bits_t CFD2FIFOUA13bits __asm__ ("CFD2FIFOUA13") __attribute__((section("sfrs"), address(0xBF8230F4)));
#define CFD2FIFOCON14 CFD2FIFOCON14
extern volatile uint32_t   CFD2FIFOCON14 __attribute__((section("sfrs"), address(0xBF8230F8)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON14bits_t;
extern volatile __CFD2FIFOCON14bits_t CFD2FIFOCON14bits __asm__ ("CFD2FIFOCON14") __attribute__((section("sfrs"), address(0xBF8230F8)));
#define CFD2FIFOSTA14 CFD2FIFOSTA14
extern volatile uint32_t   CFD2FIFOSTA14 __attribute__((section("sfrs"), address(0xBF8230FC)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA14bits_t;
extern volatile __CFD2FIFOSTA14bits_t CFD2FIFOSTA14bits __asm__ ("CFD2FIFOSTA14") __attribute__((section("sfrs"), address(0xBF8230FC)));
#define CFD2FIFOUA14 CFD2FIFOUA14
extern volatile uint32_t   CFD2FIFOUA14 __attribute__((section("sfrs"), address(0xBF823100)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA14bits_t;
extern volatile __CFD2FIFOUA14bits_t CFD2FIFOUA14bits __asm__ ("CFD2FIFOUA14") __attribute__((section("sfrs"), address(0xBF823100)));
#define CFD2FIFOCON15 CFD2FIFOCON15
extern volatile uint32_t   CFD2FIFOCON15 __attribute__((section("sfrs"), address(0xBF823104)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON15bits_t;
extern volatile __CFD2FIFOCON15bits_t CFD2FIFOCON15bits __asm__ ("CFD2FIFOCON15") __attribute__((section("sfrs"), address(0xBF823104)));
#define CFD2FIFOSTA15 CFD2FIFOSTA15
extern volatile uint32_t   CFD2FIFOSTA15 __attribute__((section("sfrs"), address(0xBF823108)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA15bits_t;
extern volatile __CFD2FIFOSTA15bits_t CFD2FIFOSTA15bits __asm__ ("CFD2FIFOSTA15") __attribute__((section("sfrs"), address(0xBF823108)));
#define CFD2FIFOUA15 CFD2FIFOUA15
extern volatile uint32_t   CFD2FIFOUA15 __attribute__((section("sfrs"), address(0xBF82310C)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA15bits_t;
extern volatile __CFD2FIFOUA15bits_t CFD2FIFOUA15bits __asm__ ("CFD2FIFOUA15") __attribute__((section("sfrs"), address(0xBF82310C)));
#define CFD2FLTCON0 CFD2FLTCON0
extern volatile uint32_t   CFD2FLTCON0 __attribute__((section("sfrs"), address(0xBF823110)));
typedef struct {
  uint32_t F0BP:5;
  uint32_t :2;
  uint32_t FLTEN0:1;
  uint32_t F1BP:5;
  uint32_t :2;
  uint32_t FLTEN1:1;
  uint32_t F2BP:5;
  uint32_t :2;
  uint32_t FLTEN2:1;
  uint32_t F3BP:5;
  uint32_t :2;
  uint32_t FLTEN3:1;
} __CFD2FLTCON0bits_t;
extern volatile __CFD2FLTCON0bits_t CFD2FLTCON0bits __asm__ ("CFD2FLTCON0") __attribute__((section("sfrs"), address(0xBF823110)));
#define CFD2FLTCON1 CFD2FLTCON1
extern volatile uint32_t   CFD2FLTCON1 __attribute__((section("sfrs"), address(0xBF823114)));
typedef struct {
  uint32_t F4BP:5;
  uint32_t :2;
  uint32_t FLTEN4:1;
  uint32_t F5BP:5;
  uint32_t :2;
  uint32_t FLTEN5:1;
  uint32_t F6BP:5;
  uint32_t :2;
  uint32_t FLTEN6:1;
  uint32_t F7BP:5;
  uint32_t :2;
  uint32_t FLTEN7:1;
} __CFD2FLTCON1bits_t;
extern volatile __CFD2FLTCON1bits_t CFD2FLTCON1bits __asm__ ("CFD2FLTCON1") __attribute__((section("sfrs"), address(0xBF823114)));
#define CFD2FLTCON2 CFD2FLTCON2
extern volatile uint32_t   CFD2FLTCON2 __attribute__((section("sfrs"), address(0xBF823118)));
typedef struct {
  uint32_t F8BP:5;
  uint32_t :2;
  uint32_t FLTEN8:1;
  uint32_t F9BP:5;
  uint32_t :2;
  uint32_t FLTEN9:1;
  uint32_t F10BP:5;
  uint32_t :2;
  uint32_t FLTEN10:1;
  uint32_t F11BP:5;
  uint32_t :2;
  uint32_t FLTEN11:1;
} __CFD2FLTCON2bits_t;
