Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __CFD2FLTCON2bits_t CFD2FLTCON2bits __asm__ ("CFD2FLTCON2") __attribute__((section("sfrs"), address(0xBF823118)));
#define CFD2FLTCON3 CFD2FLTCON3
extern volatile uint32_t   CFD2FLTCON3 __attribute__((section("sfrs"), address(0xBF82311C)));
typedef struct {
  uint32_t F12BP:5;
  uint32_t :2;
  uint32_t FLTEN12:1;
  uint32_t F13BP:5;
  uint32_t :2;
  uint32_t FLTEN13:1;
  uint32_t F14BP:5;
  uint32_t :2;
  uint32_t FLTEN14:1;
  uint32_t F15BP:5;
  uint32_t :2;
  uint32_t FLTEN15:1;
} __CFD2FLTCON3bits_t;
extern volatile __CFD2FLTCON3bits_t CFD2FLTCON3bits __asm__ ("CFD2FLTCON3") __attribute__((section("sfrs"), address(0xBF82311C)));
#define CFD2FLTOBJ0 CFD2FLTOBJ0
extern volatile uint32_t   CFD2FLTOBJ0 __attribute__((section("sfrs"), address(0xBF823120)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ0bits_t;
extern volatile __CFD2FLTOBJ0bits_t CFD2FLTOBJ0bits __asm__ ("CFD2FLTOBJ0") __attribute__((section("sfrs"), address(0xBF823120)));
#define CFD2MASK0 CFD2MASK0
extern volatile uint32_t   CFD2MASK0 __attribute__((section("sfrs"), address(0xBF823124)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK0bits_t;
extern volatile __CFD2MASK0bits_t CFD2MASK0bits __asm__ ("CFD2MASK0") __attribute__((section("sfrs"), address(0xBF823124)));
#define CFD2FLTOBJ1 CFD2FLTOBJ1
extern volatile uint32_t   CFD2FLTOBJ1 __attribute__((section("sfrs"), address(0xBF823128)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ1bits_t;
extern volatile __CFD2FLTOBJ1bits_t CFD2FLTOBJ1bits __asm__ ("CFD2FLTOBJ1") __attribute__((section("sfrs"), address(0xBF823128)));
#define CFD2MASK1 CFD2MASK1
extern volatile uint32_t   CFD2MASK1 __attribute__((section("sfrs"), address(0xBF82312C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK1bits_t;
extern volatile __CFD2MASK1bits_t CFD2MASK1bits __asm__ ("CFD2MASK1") __attribute__((section("sfrs"), address(0xBF82312C)));
#define CFD2FLTOBJ2 CFD2FLTOBJ2
extern volatile uint32_t   CFD2FLTOBJ2 __attribute__((section("sfrs"), address(0xBF823130)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ2bits_t;
extern volatile __CFD2FLTOBJ2bits_t CFD2FLTOBJ2bits __asm__ ("CFD2FLTOBJ2") __attribute__((section("sfrs"), address(0xBF823130)));
#define CFD2MASK2 CFD2MASK2
extern volatile uint32_t   CFD2MASK2 __attribute__((section("sfrs"), address(0xBF823134)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK2bits_t;
extern volatile __CFD2MASK2bits_t CFD2MASK2bits __asm__ ("CFD2MASK2") __attribute__((section("sfrs"), address(0xBF823134)));
#define CFD2FLTOBJ3 CFD2FLTOBJ3
extern volatile uint32_t   CFD2FLTOBJ3 __attribute__((section("sfrs"), address(0xBF823138)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ3bits_t;
extern volatile __CFD2FLTOBJ3bits_t CFD2FLTOBJ3bits __asm__ ("CFD2FLTOBJ3") __attribute__((section("sfrs"), address(0xBF823138)));
#define CFD2MASK3 CFD2MASK3
extern volatile uint32_t   CFD2MASK3 __attribute__((section("sfrs"), address(0xBF82313C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK3bits_t;
extern volatile __CFD2MASK3bits_t CFD2MASK3bits __asm__ ("CFD2MASK3") __attribute__((section("sfrs"), address(0xBF82313C)));
#define CFD2FLTOBJ4 CFD2FLTOBJ4
extern volatile uint32_t   CFD2FLTOBJ4 __attribute__((section("sfrs"), address(0xBF823140)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ4bits_t;
extern volatile __CFD2FLTOBJ4bits_t CFD2FLTOBJ4bits __asm__ ("CFD2FLTOBJ4") __attribute__((section("sfrs"), address(0xBF823140)));
#define CFD2MASK4 CFD2MASK4
extern volatile uint32_t   CFD2MASK4 __attribute__((section("sfrs"), address(0xBF823144)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK4bits_t;
extern volatile __CFD2MASK4bits_t CFD2MASK4bits __asm__ ("CFD2MASK4") __attribute__((section("sfrs"), address(0xBF823144)));
#define CFD2FLTOBJ5 CFD2FLTOBJ5
extern volatile uint32_t   CFD2FLTOBJ5 __attribute__((section("sfrs"), address(0xBF823148)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ5bits_t;
extern volatile __CFD2FLTOBJ5bits_t CFD2FLTOBJ5bits __asm__ ("CFD2FLTOBJ5") __attribute__((section("sfrs"), address(0xBF823148)));
#define CFD2MASK5 CFD2MASK5
extern volatile uint32_t   CFD2MASK5 __attribute__((section("sfrs"), address(0xBF82314C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK5bits_t;
extern volatile __CFD2MASK5bits_t CFD2MASK5bits __asm__ ("CFD2MASK5") __attribute__((section("sfrs"), address(0xBF82314C)));
#define CFD2FLTOBJ6 CFD2FLTOBJ6
extern volatile uint32_t   CFD2FLTOBJ6 __attribute__((section("sfrs"), address(0xBF823150)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ6bits_t;
extern volatile __CFD2FLTOBJ6bits_t CFD2FLTOBJ6bits __asm__ ("CFD2FLTOBJ6") __attribute__((section("sfrs"), address(0xBF823150)));
#define CFD2MASK6 CFD2MASK6
extern volatile uint32_t   CFD2MASK6 __attribute__((section("sfrs"), address(0xBF823154)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK6bits_t;
extern volatile __CFD2MASK6bits_t CFD2MASK6bits __asm__ ("CFD2MASK6") __attribute__((section("sfrs"), address(0xBF823154)));
#define CFD2FLTOBJ7 CFD2FLTOBJ7
extern volatile uint32_t   CFD2FLTOBJ7 __attribute__((section("sfrs"), address(0xBF823158)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ7bits_t;
extern volatile __CFD2FLTOBJ7bits_t CFD2FLTOBJ7bits __asm__ ("CFD2FLTOBJ7") __attribute__((section("sfrs"), address(0xBF823158)));
#define CFD2MASK7 CFD2MASK7
extern volatile uint32_t   CFD2MASK7 __attribute__((section("sfrs"), address(0xBF82315C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK7bits_t;
extern volatile __CFD2MASK7bits_t CFD2MASK7bits __asm__ ("CFD2MASK7") __attribute__((section("sfrs"), address(0xBF82315C)));
#define CFD2FLTOBJ8 CFD2FLTOBJ8
extern volatile uint32_t   CFD2FLTOBJ8 __attribute__((section("sfrs"), address(0xBF823160)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ8bits_t;
extern volatile __CFD2FLTOBJ8bits_t CFD2FLTOBJ8bits __asm__ ("CFD2FLTOBJ8") __attribute__((section("sfrs"), address(0xBF823160)));
#define CFD2MASK8 CFD2MASK8
extern volatile uint32_t   CFD2MASK8 __attribute__((section("sfrs"), address(0xBF823164)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK8bits_t;
extern volatile __CFD2MASK8bits_t CFD2MASK8bits __asm__ ("CFD2MASK8") __attribute__((section("sfrs"), address(0xBF823164)));
#define CFD2FLTOBJ9 CFD2FLTOBJ9
extern volatile uint32_t   CFD2FLTOBJ9 __attribute__((section("sfrs"), address(0xBF823168)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ9bits_t;
extern volatile __CFD2FLTOBJ9bits_t CFD2FLTOBJ9bits __asm__ ("CFD2FLTOBJ9") __attribute__((section("sfrs"), address(0xBF823168)));
#define CFD2MASK9 CFD2MASK9
extern volatile uint32_t   CFD2MASK9 __attribute__((section("sfrs"), address(0xBF82316C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK9bits_t;
