Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __CFD2MASK9bits_t CFD2MASK9bits __asm__ ("CFD2MASK9") __attribute__((section("sfrs"), address(0xBF82316C)));
#define CFD2FLTOBJ10 CFD2FLTOBJ10
extern volatile uint32_t   CFD2FLTOBJ10 __attribute__((section("sfrs"), address(0xBF823170)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ10bits_t;
extern volatile __CFD2FLTOBJ10bits_t CFD2FLTOBJ10bits __asm__ ("CFD2FLTOBJ10") __attribute__((section("sfrs"), address(0xBF823170)));
#define CFD2MASK10 CFD2MASK10
extern volatile uint32_t   CFD2MASK10 __attribute__((section("sfrs"), address(0xBF823174)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK10bits_t;
extern volatile __CFD2MASK10bits_t CFD2MASK10bits __asm__ ("CFD2MASK10") __attribute__((section("sfrs"), address(0xBF823174)));
#define CFD2FLTOBJ11 CFD2FLTOBJ11
extern volatile uint32_t   CFD2FLTOBJ11 __attribute__((section("sfrs"), address(0xBF823178)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ11bits_t;
extern volatile __CFD2FLTOBJ11bits_t CFD2FLTOBJ11bits __asm__ ("CFD2FLTOBJ11") __attribute__((section("sfrs"), address(0xBF823178)));
#define CFD2MASK11 CFD2MASK11
extern volatile uint32_t   CFD2MASK11 __attribute__((section("sfrs"), address(0xBF82317C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK11bits_t;
extern volatile __CFD2MASK11bits_t CFD2MASK11bits __asm__ ("CFD2MASK11") __attribute__((section("sfrs"), address(0xBF82317C)));
#define CFD2FLTOBJ12 CFD2FLTOBJ12
extern volatile uint32_t   CFD2FLTOBJ12 __attribute__((section("sfrs"), address(0xBF823180)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ12bits_t;
extern volatile __CFD2FLTOBJ12bits_t CFD2FLTOBJ12bits __asm__ ("CFD2FLTOBJ12") __attribute__((section("sfrs"), address(0xBF823180)));
#define CFD2MASK12 CFD2MASK12
extern volatile uint32_t   CFD2MASK12 __attribute__((section("sfrs"), address(0xBF823184)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK12bits_t;
extern volatile __CFD2MASK12bits_t CFD2MASK12bits __asm__ ("CFD2MASK12") __attribute__((section("sfrs"), address(0xBF823184)));
#define CFD2FLTOBJ13 CFD2FLTOBJ13
extern volatile uint32_t   CFD2FLTOBJ13 __attribute__((section("sfrs"), address(0xBF823188)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ13bits_t;
extern volatile __CFD2FLTOBJ13bits_t CFD2FLTOBJ13bits __asm__ ("CFD2FLTOBJ13") __attribute__((section("sfrs"), address(0xBF823188)));
#define CFD2MASK13 CFD2MASK13
extern volatile uint32_t   CFD2MASK13 __attribute__((section("sfrs"), address(0xBF82318C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK13bits_t;
extern volatile __CFD2MASK13bits_t CFD2MASK13bits __asm__ ("CFD2MASK13") __attribute__((section("sfrs"), address(0xBF82318C)));
#define CFD2FLTOBJ14 CFD2FLTOBJ14
extern volatile uint32_t   CFD2FLTOBJ14 __attribute__((section("sfrs"), address(0xBF823190)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ14bits_t;
extern volatile __CFD2FLTOBJ14bits_t CFD2FLTOBJ14bits __asm__ ("CFD2FLTOBJ14") __attribute__((section("sfrs"), address(0xBF823190)));
#define CFD2MASK14 CFD2MASK14
extern volatile uint32_t   CFD2MASK14 __attribute__((section("sfrs"), address(0xBF823194)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK14bits_t;
extern volatile __CFD2MASK14bits_t CFD2MASK14bits __asm__ ("CFD2MASK14") __attribute__((section("sfrs"), address(0xBF823194)));
#define CFD2FLTOBJ15 CFD2FLTOBJ15
extern volatile uint32_t   CFD2FLTOBJ15 __attribute__((section("sfrs"), address(0xBF823198)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ15bits_t;
extern volatile __CFD2FLTOBJ15bits_t CFD2FLTOBJ15bits __asm__ ("CFD2FLTOBJ15") __attribute__((section("sfrs"), address(0xBF823198)));
#define CFD2MASK15 CFD2MASK15
extern volatile uint32_t   CFD2MASK15 __attribute__((section("sfrs"), address(0xBF82319C)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK15bits_t;
extern volatile __CFD2MASK15bits_t CFD2MASK15bits __asm__ ("CFD2MASK15") __attribute__((section("sfrs"), address(0xBF82319C)));
#define CVDCON CVDCON
extern volatile uint32_t   CVDCON __attribute__((section("sfrs"), address(0xBF824000)));
typedef struct {
  uint32_t TRIGGER:4;
  uint32_t CLKSEL:2;
  uint32_t :2;
  uint32_t FIFOTH:10;
  uint32_t FIFOIEN:1;
  uint32_t CVDIEN:1;
  uint32_t :3;
  uint32_t THSTR:1;
  uint32_t SWTRIG:1;
  uint32_t ABORT:1;
  uint32_t :1;
  uint32_t SDHOLD:1;
  uint32_t ORDER:1;
  uint32_t SIDL:1;
  uint32_t FRZ:1;
  uint32_t ON:1;
} __CVDCONbits_t;
extern volatile __CVDCONbits_t CVDCONbits __asm__ ("CVDCON") __attribute__((section("sfrs"), address(0xBF824000)));
#define CVDADC CVDADC
extern volatile uint32_t   CVDADC __attribute__((section("sfrs"), address(0xBF824004)));
typedef struct {
  uint32_t SELRES:2;
  uint32_t DIFFPEN:1;
  uint32_t DIGEN7:1;
} __CVDADCbits_t;
extern volatile __CVDADCbits_t CVDADCbits __asm__ ("CVDADC") __attribute__((section("sfrs"), address(0xBF824004)));
#define CVDSTAT CVDSTAT
extern volatile uint32_t   CVDSTAT __attribute__((section("sfrs"), address(0xBF824008)));
typedef struct {
  uint32_t SD1BUSY:1;
  uint32_t SD1DONE:1;
  uint32_t SD1INT:1;
  uint32_t :1;
  uint32_t SD2BUSY:1;
  uint32_t SD2DONE:1;
  uint32_t SD2INT:1;
  uint32_t :1;
  uint32_t SD3BUSY:1;
  uint32_t SD3DONE:1;
  uint32_t SD3INT:1;
  uint32_t :1;
  uint32_t SD4BUSY:1;
  uint32_t SD4DONE:1;
  uint32_t SD4INT:1;
  uint32_t :1;
  uint32_t FIFOCNT:10;
  uint32_t :3;
  uint32_t FIFOMT:1;
  uint32_t FIFOWM:1;
  uint32_t FIFOFULL:1;
} __CVDSTATbits_t;
