Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __CVDSTATbits_t CVDSTATbits __asm__ ("CVDSTAT") __attribute__((section("sfrs"), address(0xBF824008)));
#define CVDRES0H CVDRES0H
extern volatile uint32_t   CVDRES0H __attribute__((section("sfrs"), address(0xBF824010)));
typedef struct {
  uint32_t POS:24;
} __CVDRES0Hbits_t;
extern volatile __CVDRES0Hbits_t CVDRES0Hbits __asm__ ("CVDRES0H") __attribute__((section("sfrs"), address(0xBF824010)));
#define CVDRES0L CVDRES0L
extern volatile uint32_t   CVDRES0L __attribute__((section("sfrs"), address(0xBF824014)));
typedef struct {
  uint32_t NEG:24;
} __CVDRES0Lbits_t;
extern volatile __CVDRES0Lbits_t CVDRES0Lbits __asm__ ("CVDRES0L") __attribute__((section("sfrs"), address(0xBF824014)));
#define CVDRES0D CVDRES0D
extern volatile uint32_t   CVDRES0D __attribute__((section("sfrs"), address(0xBF824018)));
typedef struct {
  uint32_t DELTA:18;
  uint32_t :1;
  uint32_t RXINDEX:5;
  uint32_t SDNUM:2;
  uint32_t :1;
  uint32_t TXINDEX:5;
} __CVDRES0Dbits_t;
extern volatile __CVDRES0Dbits_t CVDRES0Dbits __asm__ ("CVDRES0D") __attribute__((section("sfrs"), address(0xBF824018)));
#define CVDRX0 CVDRX0
extern volatile uint32_t   CVDRX0 __attribute__((section("sfrs"), address(0xBF824080)));
typedef struct {
  uint32_t RXAN0:6;
  uint32_t :2;
  uint32_t RXAN1:6;
  uint32_t :2;
  uint32_t RXAN2:6;
  uint32_t :2;
  uint32_t RXAN3:6;
} __CVDRX0bits_t;
extern volatile __CVDRX0bits_t CVDRX0bits __asm__ ("CVDRX0") __attribute__((section("sfrs"), address(0xBF824080)));
#define CVDRX1 CVDRX1
extern volatile uint32_t   CVDRX1 __attribute__((section("sfrs"), address(0xBF824084)));
typedef struct {
  uint32_t RXAN4:6;
  uint32_t :2;
  uint32_t RXAN5:6;
  uint32_t :2;
  uint32_t RXAN6:6;
  uint32_t :2;
  uint32_t RXAN7:6;
} __CVDRX1bits_t;
extern volatile __CVDRX1bits_t CVDRX1bits __asm__ ("CVDRX1") __attribute__((section("sfrs"), address(0xBF824084)));
#define CVDRX2 CVDRX2
extern volatile uint32_t   CVDRX2 __attribute__((section("sfrs"), address(0xBF824088)));
typedef struct {
  uint32_t RXAN8:6;
  uint32_t :2;
  uint32_t RXAN9:6;
  uint32_t :2;
  uint32_t RXAN10:6;
  uint32_t :2;
  uint32_t RXAN11:6;
} __CVDRX2bits_t;
extern volatile __CVDRX2bits_t CVDRX2bits __asm__ ("CVDRX2") __attribute__((section("sfrs"), address(0xBF824088)));
#define CVDRX3 CVDRX3
extern volatile uint32_t   CVDRX3 __attribute__((section("sfrs"), address(0xBF82408C)));
typedef struct {
  uint32_t RXAN12:6;
  uint32_t :2;
  uint32_t RXAN13:6;
  uint32_t :2;
  uint32_t RXAN14:6;
  uint32_t :2;
  uint32_t RXAN15:6;
} __CVDRX3bits_t;
extern volatile __CVDRX3bits_t CVDRX3bits __asm__ ("CVDRX3") __attribute__((section("sfrs"), address(0xBF82408C)));
#define CVDTX0 CVDTX0
extern volatile uint32_t   CVDTX0 __attribute__((section("sfrs"), address(0xBF8240C0)));
typedef struct {
  uint32_t TXAN0:6;
  uint32_t :2;
  uint32_t TXAN1:6;
  uint32_t :2;
  uint32_t TXAN2:6;
  uint32_t :2;
  uint32_t TXAN3:6;
} __CVDTX0bits_t;
extern volatile __CVDTX0bits_t CVDTX0bits __asm__ ("CVDTX0") __attribute__((section("sfrs"), address(0xBF8240C0)));
#define CVDTX1 CVDTX1
extern volatile uint32_t   CVDTX1 __attribute__((section("sfrs"), address(0xBF8240C4)));
typedef struct {
  uint32_t TXAN4:6;
  uint32_t :2;
  uint32_t TXAN5:6;
  uint32_t :2;
  uint32_t TXAN6:6;
  uint32_t :2;
  uint32_t TXAN7:6;
} __CVDTX1bits_t;
extern volatile __CVDTX1bits_t CVDTX1bits __asm__ ("CVDTX1") __attribute__((section("sfrs"), address(0xBF8240C4)));
#define CVDTX2 CVDTX2
extern volatile uint32_t   CVDTX2 __attribute__((section("sfrs"), address(0xBF8240C8)));
typedef struct {
  uint32_t TXAN8:6;
  uint32_t :2;
  uint32_t TXAN9:6;
  uint32_t :2;
  uint32_t TXAN10:6;
  uint32_t :2;
  uint32_t TXAN11:6;
} __CVDTX2bits_t;
extern volatile __CVDTX2bits_t CVDTX2bits __asm__ ("CVDTX2") __attribute__((section("sfrs"), address(0xBF8240C8)));
#define CVDTX3 CVDTX3
extern volatile uint32_t   CVDTX3 __attribute__((section("sfrs"), address(0xBF8240CC)));
typedef struct {
  uint32_t TXAN12:6;
  uint32_t :2;
  uint32_t TXAN13:6;
  uint32_t :2;
  uint32_t TXAN14:6;
  uint32_t :2;
  uint32_t TXAN15:6;
} __CVDTX3bits_t;
extern volatile __CVDTX3bits_t CVDTX3bits __asm__ ("CVDTX3") __attribute__((section("sfrs"), address(0xBF8240CC)));
#define CVDSD0C1 CVDSD0C1
extern volatile uint32_t   CVDSD0C1 __attribute__((section("sfrs"), address(0xBF824100)));
typedef struct {
  uint32_t SD0OVRSAMP:8;
  uint32_t SD0THRESH:24;
} __CVDSD0C1bits_t;
extern volatile __CVDSD0C1bits_t CVDSD0C1bits __asm__ ("CVDSD0C1") __attribute__((section("sfrs"), address(0xBF824100)));
#define CVDSD0C2 CVDSD0C2
extern volatile uint32_t   CVDSD0C2 __attribute__((section("sfrs"), address(0xBF824104)));
typedef struct {
  uint32_t SD0RXBEG:6;
  uint32_t SD0RXSTRIDE1:2;
  uint32_t SD0RXEND:6;
  uint32_t SD0RXSTRIDE2:2;
  uint32_t SD0TXBEG:6;
  uint32_t SD0TXSTRIDE1:2;
  uint32_t SD0TXEND:6;
  uint32_t SD0TXSTRIDE2:2;
} __CVDSD0C2bits_t;
extern volatile __CVDSD0C2bits_t CVDSD0C2bits __asm__ ("CVDSD0C2") __attribute__((section("sfrs"), address(0xBF824104)));
#define CVDSD0C3 CVDSD0C3
extern volatile uint32_t   CVDSD0C3 __attribute__((section("sfrs"), address(0xBF824108)));
typedef struct {
  uint32_t SD0CHGTIME:7;
  uint32_t :1;
  uint32_t SD0ACQTIME:7;
  uint32_t :1;
  uint32_t CVDCPL:3;
  uint32_t CVDEN:1;
  uint32_t :4;
  uint32_t SD0MUT:1;
  uint32_t SD0SELF:1;
  uint32_t SD0IEN:1;
  uint32_t SD0BUF:1;
  uint32_t :2;
  uint32_t SD0EN:2;
} __CVDSD0C3bits_t;
extern volatile __CVDSD0C3bits_t CVDSD0C3bits __asm__ ("CVDSD0C3") __attribute__((section("sfrs"), address(0xBF824108)));
#define CVDSD0T2 CVDSD0T2
extern volatile uint32_t   CVDSD0T2 __attribute__((section("sfrs"), address(0xBF82410C)));
typedef struct {
  uint32_t SD0CONTIME:7;
  uint32_t :1;
  uint32_t SD0POLTIME:7;
  uint32_t :1;
  uint32_t SD0OVRTIME:7;
  uint32_t :1;
  uint32_t SD0CHNTIME:7;
} __CVDSD0T2bits_t;
extern volatile __CVDSD0T2bits_t CVDSD0T2bits __asm__ ("CVDSD0T2") __attribute__((section("sfrs"), address(0xBF82410C)));
#define CVDSD1C1 CVDSD1C1
extern volatile uint32_t   CVDSD1C1 __attribute__((section("sfrs"), address(0xBF824110)));
typedef struct {
  uint32_t SD1OVRSAMP:8;
  uint32_t SD1THRESH:24;
} __CVDSD1C1bits_t;
extern volatile __CVDSD1C1bits_t CVDSD1C1bits __asm__ ("CVDSD1C1") __attribute__((section("sfrs"), address(0xBF824110)));
#define CVDSD1C2 CVDSD1C2
extern volatile uint32_t   CVDSD1C2 __attribute__((section("sfrs"), address(0xBF824114)));
typedef struct {
  uint32_t SD1RXBEG:6;
  uint32_t SD1RXSTRIDE1:2;
  uint32_t SD1RXEND:6;
  uint32_t SD1RXSTRIDE2:2;
  uint32_t SD1TXBEG:6;
  uint32_t SD1TXSTRIDE1:2;
  uint32_t SD1TXEND:6;
  uint32_t SD1TXSTRIDE2:2;
} __CVDSD1C2bits_t;
extern volatile __CVDSD1C2bits_t CVDSD1C2bits __asm__ ("CVDSD1C2") __attribute__((section("sfrs"), address(0xBF824114)));
#define CVDSD1C3 CVDSD1C3
extern volatile uint32_t   CVDSD1C3 __attribute__((section("sfrs"), address(0xBF824118)));
typedef struct {
  uint32_t SD1CHGTIME:7;
  uint32_t :1;
  uint32_t SD1ACQTIME:7;
  uint32_t :1;
  uint32_t CVDCPL:3;
  uint32_t CVDEN:1;
  uint32_t :4;
  uint32_t SD1MUT:1;
  uint32_t SD1SELF:1;
  uint32_t SD1IEN:1;
  uint32_t SD1BUF:1;
  uint32_t :2;
  uint32_t SD1EN:2;
} __CVDSD1C3bits_t;
extern volatile __CVDSD1C3bits_t CVDSD1C3bits __asm__ ("CVDSD1C3") __attribute__((section("sfrs"), address(0xBF824118)));
#define CVDSD1T2 CVDSD1T2
extern volatile uint32_t   CVDSD1T2 __attribute__((section("sfrs"), address(0xBF82411C)));
typedef struct {
  uint32_t SD1CONTIME:7;
  uint32_t :1;
  uint32_t SD1POLTIME:7;
  uint32_t :1;
  uint32_t SD1OVRTIME:7;
  uint32_t :1;
  uint32_t SD1CHNTIME:7;
} __CVDSD1T2bits_t;
