Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __CVDSD1T2bits_t CVDSD1T2bits __asm__ ("CVDSD1T2") __attribute__((section("sfrs"), address(0xBF82411C)));
#define CVDSD2C1 CVDSD2C1
extern volatile uint32_t   CVDSD2C1 __attribute__((section("sfrs"), address(0xBF824120)));
typedef struct {
  uint32_t SD2OVRSAMP:8;
  uint32_t SD2THRESH:24;
} __CVDSD2C1bits_t;
extern volatile __CVDSD2C1bits_t CVDSD2C1bits __asm__ ("CVDSD2C1") __attribute__((section("sfrs"), address(0xBF824120)));
#define CVDSD2C2 CVDSD2C2
extern volatile uint32_t   CVDSD2C2 __attribute__((section("sfrs"), address(0xBF824124)));
typedef struct {
  uint32_t SD2RXBEG:6;
  uint32_t SD2RXSTRIDE1:2;
  uint32_t SD2RXEND:6;
  uint32_t SD2RXSTRIDE2:2;
  uint32_t SD2TXBEG:6;
  uint32_t SD2TXSTRIDE1:2;
  uint32_t SD2TXEND:6;
  uint32_t SD2TXSTRIDE2:2;
} __CVDSD2C2bits_t;
extern volatile __CVDSD2C2bits_t CVDSD2C2bits __asm__ ("CVDSD2C2") __attribute__((section("sfrs"), address(0xBF824124)));
#define CVDSD2C3 CVDSD2C3
extern volatile uint32_t   CVDSD2C3 __attribute__((section("sfrs"), address(0xBF824128)));
typedef struct {
  uint32_t SD2CHGTIME:7;
  uint32_t :1;
  uint32_t SD2ACQTIME:7;
  uint32_t :1;
  uint32_t CVDCPL:3;
  uint32_t CVDEN:1;
  uint32_t :4;
  uint32_t SD2MUT:1;
  uint32_t SD2SELF:1;
  uint32_t SD2IEN:1;
  uint32_t SD2BUF:1;
  uint32_t :2;
  uint32_t SD2EN:2;
} __CVDSD2C3bits_t;
extern volatile __CVDSD2C3bits_t CVDSD2C3bits __asm__ ("CVDSD2C3") __attribute__((section("sfrs"), address(0xBF824128)));
#define CVDSD2T2 CVDSD2T2
extern volatile uint32_t   CVDSD2T2 __attribute__((section("sfrs"), address(0xBF82412C)));
typedef struct {
  uint32_t SD2CONTIME:7;
  uint32_t :1;
  uint32_t SD2POLTIME:7;
  uint32_t :1;
  uint32_t SD2OVRTIME:7;
  uint32_t :1;
  uint32_t SD2CHNTIME:7;
} __CVDSD2T2bits_t;
extern volatile __CVDSD2T2bits_t CVDSD2T2bits __asm__ ("CVDSD2T2") __attribute__((section("sfrs"), address(0xBF82412C)));
#define CVDSD3C1 CVDSD3C1
extern volatile uint32_t   CVDSD3C1 __attribute__((section("sfrs"), address(0xBF824130)));
typedef struct {
  uint32_t SD3OVRSAMP:8;
  uint32_t SD3THRESH:24;
} __CVDSD3C1bits_t;
extern volatile __CVDSD3C1bits_t CVDSD3C1bits __asm__ ("CVDSD3C1") __attribute__((section("sfrs"), address(0xBF824130)));
#define CVDSD3C2 CVDSD3C2
extern volatile uint32_t   CVDSD3C2 __attribute__((section("sfrs"), address(0xBF824134)));
typedef struct {
  uint32_t SD3RXBEG:6;
  uint32_t SD3RXSTRIDE1:2;
  uint32_t SD3RXEND:6;
  uint32_t SD3RXSTRIDE2:2;
  uint32_t SD3TXBEG:6;
  uint32_t SD3TXSTRIDE1:2;
  uint32_t SD3TXEND:6;
  uint32_t SD3TXSTRIDE2:2;
} __CVDSD3C2bits_t;
extern volatile __CVDSD3C2bits_t CVDSD3C2bits __asm__ ("CVDSD3C2") __attribute__((section("sfrs"), address(0xBF824134)));
#define CVDSD3C3 CVDSD3C3
extern volatile uint32_t   CVDSD3C3 __attribute__((section("sfrs"), address(0xBF824138)));
typedef struct {
  uint32_t SD3CHGTIME:7;
  uint32_t :1;
  uint32_t SD3ACQTIME:7;
  uint32_t :1;
  uint32_t CVDCPL:3;
  uint32_t CVDEN:1;
  uint32_t :4;
  uint32_t SD3MUT:1;
  uint32_t SD3SELF:1;
  uint32_t SD3IEN:1;
  uint32_t SD3BUF:1;
  uint32_t :2;
  uint32_t SD3EN:2;
} __CVDSD3C3bits_t;
extern volatile __CVDSD3C3bits_t CVDSD3C3bits __asm__ ("CVDSD3C3") __attribute__((section("sfrs"), address(0xBF824138)));
#define CVDSD3T2 CVDSD3T2
extern volatile uint32_t   CVDSD3T2 __attribute__((section("sfrs"), address(0xBF82413C)));
typedef struct {
  uint32_t SD3CONTIME:7;
  uint32_t :1;
  uint32_t SD3POLTIME:7;
  uint32_t :1;
  uint32_t SD3OVRTIME:7;
  uint32_t :1;
  uint32_t SD3CHNTIME:7;
} __CVDSD3T2bits_t;
extern volatile __CVDSD3T2bits_t CVDSD3T2bits __asm__ ("CVDSD3T2") __attribute__((section("sfrs"), address(0xBF82413C)));
#define I2C2CON I2C2CON
extern volatile uint32_t   I2C2CON __attribute__((section("sfrs"), address(0xBF840400)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t DHEN:1;
    uint32_t AHEN:1;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C2CONbits_t;
extern volatile __I2C2CONbits_t I2C2CONbits __asm__ ("I2C2CON") __attribute__((section("sfrs"), address(0xBF840400)));
extern volatile uint32_t        I2C2CONCLR __attribute__((section("sfrs"),address(0xBF840404)));
extern volatile uint32_t        I2C2CONSET __attribute__((section("sfrs"),address(0xBF840408)));
extern volatile uint32_t        I2C2CONINV __attribute__((section("sfrs"),address(0xBF84040C)));
#define I2C2STAT I2C2STAT
extern volatile uint32_t   I2C2STAT __attribute__((section("sfrs"), address(0xBF840410)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C2STATbits_t;
extern volatile __I2C2STATbits_t I2C2STATbits __asm__ ("I2C2STAT") __attribute__((section("sfrs"), address(0xBF840410)));
extern volatile uint32_t        I2C2STATCLR __attribute__((section("sfrs"),address(0xBF840414)));
extern volatile uint32_t        I2C2STATSET __attribute__((section("sfrs"),address(0xBF840418)));
extern volatile uint32_t        I2C2STATINV __attribute__((section("sfrs"),address(0xBF84041C)));
#define I2C2ADD I2C2ADD
extern volatile uint32_t   I2C2ADD __attribute__((section("sfrs"), address(0xBF840420)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C2ADDbits_t;
extern volatile __I2C2ADDbits_t I2C2ADDbits __asm__ ("I2C2ADD") __attribute__((section("sfrs"), address(0xBF840420)));
extern volatile uint32_t        I2C2ADDCLR __attribute__((section("sfrs"),address(0xBF840424)));
extern volatile uint32_t        I2C2ADDSET __attribute__((section("sfrs"),address(0xBF840428)));
extern volatile uint32_t        I2C2ADDINV __attribute__((section("sfrs"),address(0xBF84042C)));
#define I2C2MSK I2C2MSK
extern volatile uint32_t   I2C2MSK __attribute__((section("sfrs"), address(0xBF840430)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C2MSKbits_t;
extern volatile __I2C2MSKbits_t I2C2MSKbits __asm__ ("I2C2MSK") __attribute__((section("sfrs"), address(0xBF840430)));
extern volatile uint32_t        I2C2MSKCLR __attribute__((section("sfrs"),address(0xBF840434)));
extern volatile uint32_t        I2C2MSKSET __attribute__((section("sfrs"),address(0xBF840438)));
extern volatile uint32_t        I2C2MSKINV __attribute__((section("sfrs"),address(0xBF84043C)));
#define I2C2BRG I2C2BRG
extern volatile uint32_t   I2C2BRG __attribute__((section("sfrs"), address(0xBF840440)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C2BRGbits_t;
extern volatile __I2C2BRGbits_t I2C2BRGbits __asm__ ("I2C2BRG") __attribute__((section("sfrs"), address(0xBF840440)));
extern volatile uint32_t        I2C2BRGCLR __attribute__((section("sfrs"),address(0xBF840444)));
extern volatile uint32_t        I2C2BRGSET __attribute__((section("sfrs"),address(0xBF840448)));
extern volatile uint32_t        I2C2BRGINV __attribute__((section("sfrs"),address(0xBF84044C)));
#define I2C2TRN I2C2TRN
extern volatile uint32_t   I2C2TRN __attribute__((section("sfrs"), address(0xBF840450)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C2TRNbits_t;
extern volatile __I2C2TRNbits_t I2C2TRNbits __asm__ ("I2C2TRN") __attribute__((section("sfrs"), address(0xBF840450)));
extern volatile uint32_t        I2C2TRNCLR __attribute__((section("sfrs"),address(0xBF840454)));
extern volatile uint32_t        I2C2TRNSET __attribute__((section("sfrs"),address(0xBF840458)));
extern volatile uint32_t        I2C2TRNINV __attribute__((section("sfrs"),address(0xBF84045C)));
#define I2C2RCV I2C2RCV
extern volatile uint32_t   I2C2RCV __attribute__((section("sfrs"), address(0xBF840460)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C2RCVbits_t;
extern volatile __I2C2RCVbits_t I2C2RCVbits __asm__ ("I2C2RCV") __attribute__((section("sfrs"), address(0xBF840460)));
extern volatile uint32_t        I2C2RCVCLR __attribute__((section("sfrs"),address(0xBF840464)));
extern volatile uint32_t        I2C2RCVSET __attribute__((section("sfrs"),address(0xBF840468)));
extern volatile uint32_t        I2C2RCVINV __attribute__((section("sfrs"),address(0xBF84046C)));
#define U1MODE U1MODE
extern volatile uint32_t   U1MODE __attribute__((section("sfrs"), address(0xBF840600)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U1MODEbits_t;
extern volatile __U1MODEbits_t U1MODEbits __asm__ ("U1MODE") __attribute__((section("sfrs"), address(0xBF840600)));
extern volatile uint32_t        U1MODECLR __attribute__((section("sfrs"),address(0xBF840604)));
extern volatile uint32_t        U1MODESET __attribute__((section("sfrs"),address(0xBF840608)));
extern volatile uint32_t        U1MODEINV __attribute__((section("sfrs"),address(0xBF84060C)));
#define U1STA U1STA
extern volatile uint32_t   U1STA __attribute__((section("sfrs"), address(0xBF840610)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U1STAbits_t;
extern volatile __U1STAbits_t U1STAbits __asm__ ("U1STA") __attribute__((section("sfrs"), address(0xBF840610)));
extern volatile uint32_t        U1STACLR __attribute__((section("sfrs"),address(0xBF840614)));
extern volatile uint32_t        U1STASET __attribute__((section("sfrs"),address(0xBF840618)));
extern volatile uint32_t        U1STAINV __attribute__((section("sfrs"),address(0xBF84061C)));
#define U1TXREG U1TXREG
extern volatile uint32_t   U1TXREG __attribute__((section("sfrs"), address(0xBF840620)));
#define U1RXREG U1RXREG
extern volatile uint32_t   U1RXREG __attribute__((section("sfrs"), address(0xBF840630)));
#define U1BRG U1BRG
extern volatile uint32_t   U1BRG __attribute__((section("sfrs"), address(0xBF840640)));
typedef struct {
  uint32_t BRG:20;
} __U1BRGbits_t;
extern volatile __U1BRGbits_t U1BRGbits __asm__ ("U1BRG") __attribute__((section("sfrs"), address(0xBF840640)));
extern volatile uint32_t        U1BRGCLR __attribute__((section("sfrs"),address(0xBF840644)));
extern volatile uint32_t        U1BRGSET __attribute__((section("sfrs"),address(0xBF840648)));
extern volatile uint32_t        U1BRGINV __attribute__((section("sfrs"),address(0xBF84064C)));
#define U2MODE U2MODE
extern volatile uint32_t   U2MODE __attribute__((section("sfrs"), address(0xBF840800)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U2MODEbits_t;
extern volatile __U2MODEbits_t U2MODEbits __asm__ ("U2MODE") __attribute__((section("sfrs"), address(0xBF840800)));
extern volatile uint32_t        U2MODECLR __attribute__((section("sfrs"),address(0xBF840804)));
extern volatile uint32_t        U2MODESET __attribute__((section("sfrs"),address(0xBF840808)));
extern volatile uint32_t        U2MODEINV __attribute__((section("sfrs"),address(0xBF84080C)));
#define U2STA U2STA
extern volatile uint32_t   U2STA __attribute__((section("sfrs"), address(0xBF840810)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U2STAbits_t;
extern volatile __U2STAbits_t U2STAbits __asm__ ("U2STA") __attribute__((section("sfrs"), address(0xBF840810)));
extern volatile uint32_t        U2STACLR __attribute__((section("sfrs"),address(0xBF840814)));
extern volatile uint32_t        U2STASET __attribute__((section("sfrs"),address(0xBF840818)));
extern volatile uint32_t        U2STAINV __attribute__((section("sfrs"),address(0xBF84081C)));
#define U2TXREG U2TXREG
extern volatile uint32_t   U2TXREG __attribute__((section("sfrs"), address(0xBF840820)));
#define U2RXREG U2RXREG
extern volatile uint32_t   U2RXREG __attribute__((section("sfrs"), address(0xBF840830)));
#define U2BRG U2BRG
extern volatile uint32_t   U2BRG __attribute__((section("sfrs"), address(0xBF840840)));
typedef struct {
  uint32_t BRG:20;
} __U2BRGbits_t;
