Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __ETHCON1bits_t ETHCON1bits __asm__ ("ETHCON1") __attribute__((section("sfrs"), address(0xBF843000)));
extern volatile uint32_t        ETHCON1CLR __attribute__((section("sfrs"),address(0xBF843004)));
extern volatile uint32_t        ETHCON1SET __attribute__((section("sfrs"),address(0xBF843008)));
extern volatile uint32_t        ETHCON1INV __attribute__((section("sfrs"),address(0xBF84300C)));
#define ETHCON2 ETHCON2
extern volatile uint32_t   ETHCON2 __attribute__((section("sfrs"), address(0xBF843010)));
typedef union {
  struct {
    uint32_t :4;
    uint32_t RXBUF_SZ:7;
  };
  struct {
    uint32_t w:32;
  };
} __ETHCON2bits_t;
extern volatile __ETHCON2bits_t ETHCON2bits __asm__ ("ETHCON2") __attribute__((section("sfrs"), address(0xBF843010)));
extern volatile uint32_t        ETHCON2CLR __attribute__((section("sfrs"),address(0xBF843014)));
extern volatile uint32_t        ETHCON2SET __attribute__((section("sfrs"),address(0xBF843018)));
extern volatile uint32_t        ETHCON2INV __attribute__((section("sfrs"),address(0xBF84301C)));
#define ETHTXST ETHTXST
extern volatile uint32_t   ETHTXST __attribute__((section("sfrs"), address(0xBF843020)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t TXSTADDR:30;
  };
  struct {
    uint32_t w:32;
  };
} __ETHTXSTbits_t;
extern volatile __ETHTXSTbits_t ETHTXSTbits __asm__ ("ETHTXST") __attribute__((section("sfrs"), address(0xBF843020)));
extern volatile uint32_t        ETHTXSTCLR __attribute__((section("sfrs"),address(0xBF843024)));
extern volatile uint32_t        ETHTXSTSET __attribute__((section("sfrs"),address(0xBF843028)));
extern volatile uint32_t        ETHTXSTINV __attribute__((section("sfrs"),address(0xBF84302C)));
#define ETHRXST ETHRXST
extern volatile uint32_t   ETHRXST __attribute__((section("sfrs"), address(0xBF843030)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t RXSTADDR:30;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXSTbits_t;
extern volatile __ETHRXSTbits_t ETHRXSTbits __asm__ ("ETHRXST") __attribute__((section("sfrs"), address(0xBF843030)));
extern volatile uint32_t        ETHRXSTCLR __attribute__((section("sfrs"),address(0xBF843034)));
extern volatile uint32_t        ETHRXSTSET __attribute__((section("sfrs"),address(0xBF843038)));
extern volatile uint32_t        ETHRXSTINV __attribute__((section("sfrs"),address(0xBF84303C)));
#define ETHHT0 ETHHT0
extern volatile uint32_t   ETHHT0 __attribute__((section("sfrs"), address(0xBF843040)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t HTLOWER:32;
  };
} __ETHHT0bits_t;
extern volatile __ETHHT0bits_t ETHHT0bits __asm__ ("ETHHT0") __attribute__((section("sfrs"), address(0xBF843040)));
extern volatile uint32_t        ETHHT0CLR __attribute__((section("sfrs"),address(0xBF843044)));
extern volatile uint32_t        ETHHT0SET __attribute__((section("sfrs"),address(0xBF843048)));
extern volatile uint32_t        ETHHT0INV __attribute__((section("sfrs"),address(0xBF84304C)));
#define ETHHT1 ETHHT1
extern volatile uint32_t   ETHHT1 __attribute__((section("sfrs"), address(0xBF843050)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t HTUPPER:32;
  };
} __ETHHT1bits_t;
extern volatile __ETHHT1bits_t ETHHT1bits __asm__ ("ETHHT1") __attribute__((section("sfrs"), address(0xBF843050)));
extern volatile uint32_t        ETHHT1CLR __attribute__((section("sfrs"),address(0xBF843054)));
extern volatile uint32_t        ETHHT1SET __attribute__((section("sfrs"),address(0xBF843058)));
extern volatile uint32_t        ETHHT1INV __attribute__((section("sfrs"),address(0xBF84305C)));
#define ETHPMM0 ETHPMM0
extern volatile uint32_t   ETHPMM0 __attribute__((section("sfrs"), address(0xBF843060)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t PMMLOWER:32;
  };
} __ETHPMM0bits_t;
extern volatile __ETHPMM0bits_t ETHPMM0bits __asm__ ("ETHPMM0") __attribute__((section("sfrs"), address(0xBF843060)));
extern volatile uint32_t        ETHPMM0CLR __attribute__((section("sfrs"),address(0xBF843064)));
extern volatile uint32_t        ETHPMM0SET __attribute__((section("sfrs"),address(0xBF843068)));
extern volatile uint32_t        ETHPMM0INV __attribute__((section("sfrs"),address(0xBF84306C)));
#define ETHPMM1 ETHPMM1
extern volatile uint32_t   ETHPMM1 __attribute__((section("sfrs"), address(0xBF843070)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t PMMUPPER:32;
  };
} __ETHPMM1bits_t;
extern volatile __ETHPMM1bits_t ETHPMM1bits __asm__ ("ETHPMM1") __attribute__((section("sfrs"), address(0xBF843070)));
extern volatile uint32_t        ETHPMM1CLR __attribute__((section("sfrs"),address(0xBF843074)));
extern volatile uint32_t        ETHPMM1SET __attribute__((section("sfrs"),address(0xBF843078)));
extern volatile uint32_t        ETHPMM1INV __attribute__((section("sfrs"),address(0xBF84307C)));
#define ETHPMCS ETHPMCS
extern volatile uint32_t   ETHPMCS __attribute__((section("sfrs"), address(0xBF843080)));
typedef union {
  struct {
    uint32_t PMCS:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHPMCSbits_t;
extern volatile __ETHPMCSbits_t ETHPMCSbits __asm__ ("ETHPMCS") __attribute__((section("sfrs"), address(0xBF843080)));
extern volatile uint32_t        ETHPMCSCLR __attribute__((section("sfrs"),address(0xBF843084)));
extern volatile uint32_t        ETHPMCSSET __attribute__((section("sfrs"),address(0xBF843088)));
extern volatile uint32_t        ETHPMCSINV __attribute__((section("sfrs"),address(0xBF84308C)));
#define ETHPMO ETHPMO
extern volatile uint32_t   ETHPMO __attribute__((section("sfrs"), address(0xBF843090)));
typedef union {
  struct {
    uint32_t PMO:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHPMObits_t;
extern volatile __ETHPMObits_t ETHPMObits __asm__ ("ETHPMO") __attribute__((section("sfrs"), address(0xBF843090)));
extern volatile uint32_t        ETHPMOCLR __attribute__((section("sfrs"),address(0xBF843094)));
extern volatile uint32_t        ETHPMOSET __attribute__((section("sfrs"),address(0xBF843098)));
extern volatile uint32_t        ETHPMOINV __attribute__((section("sfrs"),address(0xBF84309C)));
#define ETHRXFC ETHRXFC
extern volatile uint32_t   ETHRXFC __attribute__((section("sfrs"), address(0xBF8430A0)));
typedef union {
  struct {
    uint32_t BCEN:1;
    uint32_t MCEN:1;
    uint32_t NOTMEEN:1;
    uint32_t UCEN:1;
    uint32_t RUNTEN:1;
    uint32_t RUNTERREN:1;
    uint32_t CRCOKEN:1;
    uint32_t CRCERREN:1;
    uint32_t PMMODE:4;
    uint32_t NOTPM:1;
    uint32_t :1;
    uint32_t MPEN:1;
    uint32_t HTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXFCbits_t;
extern volatile __ETHRXFCbits_t ETHRXFCbits __asm__ ("ETHRXFC") __attribute__((section("sfrs"), address(0xBF8430A0)));
extern volatile uint32_t        ETHRXFCCLR __attribute__((section("sfrs"),address(0xBF8430A4)));
extern volatile uint32_t        ETHRXFCSET __attribute__((section("sfrs"),address(0xBF8430A8)));
extern volatile uint32_t        ETHRXFCINV __attribute__((section("sfrs"),address(0xBF8430AC)));
#define ETHRXWM ETHRXWM
extern volatile uint32_t   ETHRXWM __attribute__((section("sfrs"), address(0xBF8430B0)));
typedef union {
  struct {
    uint32_t RXEWM:8;
    uint32_t :8;
    uint32_t RXFWM:8;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXWMbits_t;
extern volatile __ETHRXWMbits_t ETHRXWMbits __asm__ ("ETHRXWM") __attribute__((section("sfrs"), address(0xBF8430B0)));
extern volatile uint32_t        ETHRXWMCLR __attribute__((section("sfrs"),address(0xBF8430B4)));
extern volatile uint32_t        ETHRXWMSET __attribute__((section("sfrs"),address(0xBF8430B8)));
extern volatile uint32_t        ETHRXWMINV __attribute__((section("sfrs"),address(0xBF8430BC)));
#define ETHIEN ETHIEN
extern volatile uint32_t   ETHIEN __attribute__((section("sfrs"), address(0xBF8430C0)));
typedef union {
  struct {
    uint32_t RXOVFLWIE:1;
    uint32_t RXBUFNAIE:1;
    uint32_t TXABORTIE:1;
    uint32_t TXDONEIE:1;
    uint32_t :1;
    uint32_t RXACTIE:1;
    uint32_t PKTPENDIE:1;
    uint32_t RXDONEIE:1;
    uint32_t FWMARKIE:1;
    uint32_t EWMARKIE:1;
    uint32_t :3;
    uint32_t RXBUSEIE:1;
    uint32_t TXBUSEIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHIENbits_t;
extern volatile __ETHIENbits_t ETHIENbits __asm__ ("ETHIEN") __attribute__((section("sfrs"), address(0xBF8430C0)));
extern volatile uint32_t        ETHIENCLR __attribute__((section("sfrs"),address(0xBF8430C4)));
extern volatile uint32_t        ETHIENSET __attribute__((section("sfrs"),address(0xBF8430C8)));
extern volatile uint32_t        ETHIENINV __attribute__((section("sfrs"),address(0xBF8430CC)));
#define ETHIRQ ETHIRQ
extern volatile uint32_t   ETHIRQ __attribute__((section("sfrs"), address(0xBF8430D0)));
typedef union {
  struct {
    uint32_t RXOVFLW:1;
    uint32_t RXBUFNA:1;
    uint32_t TXABORT:1;
    uint32_t TXDONE:1;
    uint32_t :1;
    uint32_t RXACT:1;
    uint32_t PKTPEND:1;
    uint32_t RXDONE:1;
    uint32_t FWMARK:1;
    uint32_t EWMARK:1;
    uint32_t :3;
    uint32_t RXBUSE:1;
    uint32_t TXBUSE:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHIRQbits_t;
extern volatile __ETHIRQbits_t ETHIRQbits __asm__ ("ETHIRQ") __attribute__((section("sfrs"), address(0xBF8430D0)));
extern volatile uint32_t        ETHIRQCLR __attribute__((section("sfrs"),address(0xBF8430D4)));
extern volatile uint32_t        ETHIRQSET __attribute__((section("sfrs"),address(0xBF8430D8)));
extern volatile uint32_t        ETHIRQINV __attribute__((section("sfrs"),address(0xBF8430DC)));
#define ETHSTAT ETHSTAT
extern volatile uint32_t   ETHSTAT __attribute__((section("sfrs"), address(0xBF8430E0)));
typedef union {
  struct {
    uint32_t :5;
    uint32_t RXBUSY:1;
    uint32_t TXBUSY:1;
    uint32_t BUSY:1;
    uint32_t :8;
    uint32_t BUFCNT:8;
  };
  struct {
    uint32_t :7;
    uint32_t ETHBUSY:1;
  };
  struct {
    uint32_t w:32;
  };
} __ETHSTATbits_t;
extern volatile __ETHSTATbits_t ETHSTATbits __asm__ ("ETHSTAT") __attribute__((section("sfrs"), address(0xBF8430E0)));
extern volatile uint32_t        ETHSTATCLR __attribute__((section("sfrs"),address(0xBF8430E4)));
extern volatile uint32_t        ETHSTATSET __attribute__((section("sfrs"),address(0xBF8430E8)));
extern volatile uint32_t        ETHSTATINV __attribute__((section("sfrs"),address(0xBF8430EC)));
#define ETHRXOVFLOW ETHRXOVFLOW
extern volatile uint32_t   ETHRXOVFLOW __attribute__((section("sfrs"), address(0xBF843100)));
typedef union {
  struct {
    uint32_t RXOVFLWCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXOVFLOWbits_t;
extern volatile __ETHRXOVFLOWbits_t ETHRXOVFLOWbits __asm__ ("ETHRXOVFLOW") __attribute__((section("sfrs"), address(0xBF843100)));
extern volatile uint32_t        ETHRXOVFLOWCLR __attribute__((section("sfrs"),address(0xBF843104)));
extern volatile uint32_t        ETHRXOVFLOWSET __attribute__((section("sfrs"),address(0xBF843108)));
extern volatile uint32_t        ETHRXOVFLOWINV __attribute__((section("sfrs"),address(0xBF84310C)));
#define ETHFRMTXOK ETHFRMTXOK
extern volatile uint32_t   ETHFRMTXOK __attribute__((section("sfrs"), address(0xBF843110)));
typedef union {
  struct {
    uint32_t FRMTXOKCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHFRMTXOKbits_t;
