Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __ETHFRMTXOKbits_t ETHFRMTXOKbits __asm__ ("ETHFRMTXOK") __attribute__((section("sfrs"), address(0xBF843110)));
extern volatile uint32_t        ETHFRMTXOKCLR __attribute__((section("sfrs"),address(0xBF843114)));
extern volatile uint32_t        ETHFRMTXOKSET __attribute__((section("sfrs"),address(0xBF843118)));
extern volatile uint32_t        ETHFRMTXOKINV __attribute__((section("sfrs"),address(0xBF84311C)));
#define ETHSCOLFRM ETHSCOLFRM
extern volatile uint32_t   ETHSCOLFRM __attribute__((section("sfrs"), address(0xBF843120)));
typedef union {
  struct {
    uint32_t SCOLFRMCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHSCOLFRMbits_t;
extern volatile __ETHSCOLFRMbits_t ETHSCOLFRMbits __asm__ ("ETHSCOLFRM") __attribute__((section("sfrs"), address(0xBF843120)));
extern volatile uint32_t        ETHSCOLFRMCLR __attribute__((section("sfrs"),address(0xBF843124)));
extern volatile uint32_t        ETHSCOLFRMSET __attribute__((section("sfrs"),address(0xBF843128)));
extern volatile uint32_t        ETHSCOLFRMINV __attribute__((section("sfrs"),address(0xBF84312C)));
#define ETHMCOLFRM ETHMCOLFRM
extern volatile uint32_t   ETHMCOLFRM __attribute__((section("sfrs"), address(0xBF843130)));
typedef union {
  struct {
    uint32_t MCOLFRMCNT:16;
  };
  struct {
    uint32_t MCOLFRM_CNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHMCOLFRMbits_t;
extern volatile __ETHMCOLFRMbits_t ETHMCOLFRMbits __asm__ ("ETHMCOLFRM") __attribute__((section("sfrs"), address(0xBF843130)));
extern volatile uint32_t        ETHMCOLFRMCLR __attribute__((section("sfrs"),address(0xBF843134)));
extern volatile uint32_t        ETHMCOLFRMSET __attribute__((section("sfrs"),address(0xBF843138)));
extern volatile uint32_t        ETHMCOLFRMINV __attribute__((section("sfrs"),address(0xBF84313C)));
#define ETHFRMRXOK ETHFRMRXOK
extern volatile uint32_t   ETHFRMRXOK __attribute__((section("sfrs"), address(0xBF843140)));
typedef union {
  struct {
    uint32_t FRMRXOKCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHFRMRXOKbits_t;
extern volatile __ETHFRMRXOKbits_t ETHFRMRXOKbits __asm__ ("ETHFRMRXOK") __attribute__((section("sfrs"), address(0xBF843140)));
extern volatile uint32_t        ETHFRMRXOKCLR __attribute__((section("sfrs"),address(0xBF843144)));
extern volatile uint32_t        ETHFRMRXOKSET __attribute__((section("sfrs"),address(0xBF843148)));
extern volatile uint32_t        ETHFRMRXOKINV __attribute__((section("sfrs"),address(0xBF84314C)));
#define ETHFCSERR ETHFCSERR
extern volatile uint32_t   ETHFCSERR __attribute__((section("sfrs"), address(0xBF843150)));
typedef union {
  struct {
    uint32_t FCSERRCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHFCSERRbits_t;
extern volatile __ETHFCSERRbits_t ETHFCSERRbits __asm__ ("ETHFCSERR") __attribute__((section("sfrs"), address(0xBF843150)));
extern volatile uint32_t        ETHFCSERRCLR __attribute__((section("sfrs"),address(0xBF843154)));
extern volatile uint32_t        ETHFCSERRSET __attribute__((section("sfrs"),address(0xBF843158)));
extern volatile uint32_t        ETHFCSERRINV __attribute__((section("sfrs"),address(0xBF84315C)));
#define ETHALGNERR ETHALGNERR
extern volatile uint32_t   ETHALGNERR __attribute__((section("sfrs"), address(0xBF843160)));
typedef union {
  struct {
    uint32_t ALGNERRCNT:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHALGNERRbits_t;
extern volatile __ETHALGNERRbits_t ETHALGNERRbits __asm__ ("ETHALGNERR") __attribute__((section("sfrs"), address(0xBF843160)));
extern volatile uint32_t        ETHALGNERRCLR __attribute__((section("sfrs"),address(0xBF843164)));
extern volatile uint32_t        ETHALGNERRSET __attribute__((section("sfrs"),address(0xBF843168)));
extern volatile uint32_t        ETHALGNERRINV __attribute__((section("sfrs"),address(0xBF84316C)));
#define EMAC1CFG1 EMAC1CFG1
extern volatile uint32_t   EMAC1CFG1 __attribute__((section("sfrs"), address(0xBF843200)));
typedef union {
  struct {
    uint32_t RXENABLE:1;
    uint32_t PASSALL:1;
    uint32_t RXPAUSE:1;
    uint32_t TXPAUSE:1;
    uint32_t LOOPBACK:1;
    uint32_t :3;
    uint32_t RESETTFUN:1;
    uint32_t RESETTMCS:1;
    uint32_t RESETRFUN:1;
    uint32_t RESETRMCS:1;
    uint32_t :2;
    uint32_t SIMRESET:1;
    uint32_t SOFTRESET:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1CFG1bits_t;
extern volatile __EMAC1CFG1bits_t EMAC1CFG1bits __asm__ ("EMAC1CFG1") __attribute__((section("sfrs"), address(0xBF843200)));
#define EMACxCFG1 EMACxCFG1
extern volatile uint32_t   EMACxCFG1 __attribute__((section("sfrs"), address(0xBF843200)));
typedef union {
  struct {
    uint32_t RXENABLE:1;
    uint32_t PASSALL:1;
    uint32_t RXPAUSE:1;
    uint32_t TXPAUSE:1;
    uint32_t LOOPBACK:1;
    uint32_t :3;
    uint32_t RESETTFUN:1;
    uint32_t RESETTMCS:1;
    uint32_t RESETRFUN:1;
    uint32_t RESETRMCS:1;
    uint32_t :2;
    uint32_t SIMRESET:1;
    uint32_t SOFTRESET:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxCFG1bits_t;
extern volatile __EMACxCFG1bits_t EMACxCFG1bits __asm__ ("EMACxCFG1") __attribute__((section("sfrs"), address(0xBF843200)));
extern volatile uint32_t        EMAC1CFG1CLR __attribute__((section("sfrs"),address(0xBF843204)));
extern volatile uint32_t        EMACxCFG1CLR __attribute__((section("sfrs"),address(0xBF843204)));
extern volatile uint32_t        EMAC1CFG1SET __attribute__((section("sfrs"),address(0xBF843208)));
extern volatile uint32_t        EMACxCFG1SET __attribute__((section("sfrs"),address(0xBF843208)));
extern volatile uint32_t        EMAC1CFG1INV __attribute__((section("sfrs"),address(0xBF84320C)));
extern volatile uint32_t        EMACxCFG1INV __attribute__((section("sfrs"),address(0xBF84320C)));
#define EMAC1CFG2 EMAC1CFG2
extern volatile uint32_t   EMAC1CFG2 __attribute__((section("sfrs"), address(0xBF843210)));
typedef union {
  struct {
    uint32_t FULLDPLX:1;
    uint32_t LENGTHCK:1;
    uint32_t HUGEFRM:1;
    uint32_t DELAYCRC:1;
    uint32_t CRCENABLE:1;
    uint32_t PADENABLE:1;
    uint32_t VLANPAD:1;
    uint32_t AUTOPAD:1;
    uint32_t PUREPRE:1;
    uint32_t LONGPRE:1;
    uint32_t :2;
    uint32_t NOBKOFF:1;
    uint32_t BPNOBKOFF:1;
    uint32_t EXCESSDFR:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1CFG2bits_t;
extern volatile __EMAC1CFG2bits_t EMAC1CFG2bits __asm__ ("EMAC1CFG2") __attribute__((section("sfrs"), address(0xBF843210)));
#define EMACxCFG2 EMACxCFG2
extern volatile uint32_t   EMACxCFG2 __attribute__((section("sfrs"), address(0xBF843210)));
typedef union {
  struct {
    uint32_t FULLDPLX:1;
    uint32_t LENGTHCK:1;
    uint32_t HUGEFRM:1;
    uint32_t DELAYCRC:1;
    uint32_t CRCENABLE:1;
    uint32_t PADENABLE:1;
    uint32_t VLANPAD:1;
    uint32_t AUTOPAD:1;
    uint32_t PUREPRE:1;
    uint32_t LONGPRE:1;
    uint32_t :2;
    uint32_t NOBKOFF:1;
    uint32_t BPNOBKOFF:1;
    uint32_t EXCESSDFR:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxCFG2bits_t;
