Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __U1EP13bits_t U1EP13bits __asm__ ("U1EP13") __attribute__((section("sfrs"), address(0xBF8443D0)));
extern volatile uint32_t        U1EP13CLR __attribute__((section("sfrs"),address(0xBF8443D4)));
extern volatile uint32_t        U1EP13SET __attribute__((section("sfrs"),address(0xBF8443D8)));
extern volatile uint32_t        U1EP13INV __attribute__((section("sfrs"),address(0xBF8443DC)));
#define U1EP14 U1EP14
extern volatile uint32_t   U1EP14 __attribute__((section("sfrs"), address(0xBF8443E0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP14bits_t;
extern volatile __U1EP14bits_t U1EP14bits __asm__ ("U1EP14") __attribute__((section("sfrs"), address(0xBF8443E0)));
extern volatile uint32_t        U1EP14CLR __attribute__((section("sfrs"),address(0xBF8443E4)));
extern volatile uint32_t        U1EP14SET __attribute__((section("sfrs"),address(0xBF8443E8)));
extern volatile uint32_t        U1EP14INV __attribute__((section("sfrs"),address(0xBF8443EC)));
#define U1EP15 U1EP15
extern volatile uint32_t   U1EP15 __attribute__((section("sfrs"), address(0xBF8443F0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP15bits_t;
extern volatile __U1EP15bits_t U1EP15bits __asm__ ("U1EP15") __attribute__((section("sfrs"), address(0xBF8443F0)));
extern volatile uint32_t        U1EP15CLR __attribute__((section("sfrs"),address(0xBF8443F4)));
extern volatile uint32_t        U1EP15SET __attribute__((section("sfrs"),address(0xBF8443F8)));
extern volatile uint32_t        U1EP15INV __attribute__((section("sfrs"),address(0xBF8443FC)));
#define RTCCON RTCCON
extern volatile uint32_t   RTCCON __attribute__((section("sfrs"), address(0xBF870000)));
typedef union {
  struct {
    uint32_t RTCOE:1;
    uint32_t HALFSEC:1;
    uint32_t RTCSYNC:1;
    uint32_t RTCWREN:1;
    uint32_t :2;
    uint32_t RTCCLKON:1;
    uint32_t RTCOUTSEL:2;
    uint32_t RTCCLKSEL:2;
    uint32_t :2;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t CAL:10;
  };
  struct {
    uint32_t w:32;
  };
} __RTCCONbits_t;
extern volatile __RTCCONbits_t RTCCONbits __asm__ ("RTCCON") __attribute__((section("sfrs"), address(0xBF870000)));
extern volatile uint32_t        RTCCONCLR __attribute__((section("sfrs"),address(0xBF870004)));
extern volatile uint32_t        RTCCONSET __attribute__((section("sfrs"),address(0xBF870008)));
extern volatile uint32_t        RTCCONINV __attribute__((section("sfrs"),address(0xBF87000C)));
#define RTCALRM RTCALRM
extern volatile uint32_t   RTCALRM __attribute__((section("sfrs"), address(0xBF870010)));
typedef union {
  struct {
    uint32_t ARPT:8;
    uint32_t AMASK:4;
    uint32_t ALRMSYNC:1;
    uint32_t PIV:1;
    uint32_t CHIME:1;
    uint32_t ALRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __RTCALRMbits_t;
extern volatile __RTCALRMbits_t RTCALRMbits __asm__ ("RTCALRM") __attribute__((section("sfrs"), address(0xBF870010)));
extern volatile uint32_t        RTCALRMCLR __attribute__((section("sfrs"),address(0xBF870014)));
extern volatile uint32_t        RTCALRMSET __attribute__((section("sfrs"),address(0xBF870018)));
extern volatile uint32_t        RTCALRMINV __attribute__((section("sfrs"),address(0xBF87001C)));
#define RTCTIME RTCTIME
extern volatile uint32_t   RTCTIME __attribute__((section("sfrs"), address(0xBF870020)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCTIMEbits_t;
extern volatile __RTCTIMEbits_t RTCTIMEbits __asm__ ("RTCTIME") __attribute__((section("sfrs"), address(0xBF870020)));
extern volatile uint32_t        RTCTIMECLR __attribute__((section("sfrs"),address(0xBF870024)));
extern volatile uint32_t        RTCTIMESET __attribute__((section("sfrs"),address(0xBF870028)));
extern volatile uint32_t        RTCTIMEINV __attribute__((section("sfrs"),address(0xBF87002C)));
#define RTCDATE RTCDATE
extern volatile uint32_t   RTCDATE __attribute__((section("sfrs"), address(0xBF870030)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
    uint32_t YEAR01:4;
    uint32_t YEAR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCDATEbits_t;
extern volatile __RTCDATEbits_t RTCDATEbits __asm__ ("RTCDATE") __attribute__((section("sfrs"), address(0xBF870030)));
extern volatile uint32_t        RTCDATECLR __attribute__((section("sfrs"),address(0xBF870034)));
extern volatile uint32_t        RTCDATESET __attribute__((section("sfrs"),address(0xBF870038)));
extern volatile uint32_t        RTCDATEINV __attribute__((section("sfrs"),address(0xBF87003C)));
#define ALRMTIME ALRMTIME
extern volatile uint32_t   ALRMTIME __attribute__((section("sfrs"), address(0xBF870040)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMTIMEbits_t;
extern volatile __ALRMTIMEbits_t ALRMTIMEbits __asm__ ("ALRMTIME") __attribute__((section("sfrs"), address(0xBF870040)));
extern volatile uint32_t        ALRMTIMECLR __attribute__((section("sfrs"),address(0xBF870044)));
extern volatile uint32_t        ALRMTIMESET __attribute__((section("sfrs"),address(0xBF870048)));
extern volatile uint32_t        ALRMTIMEINV __attribute__((section("sfrs"),address(0xBF87004C)));
#define ALRMDATE ALRMDATE
extern volatile uint32_t   ALRMDATE __attribute__((section("sfrs"), address(0xBF870050)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMDATEbits_t;
extern volatile __ALRMDATEbits_t ALRMDATEbits __asm__ ("ALRMDATE") __attribute__((section("sfrs"), address(0xBF870050)));
extern volatile uint32_t        ALRMDATECLR __attribute__((section("sfrs"),address(0xBF870054)));
extern volatile uint32_t        ALRMDATESET __attribute__((section("sfrs"),address(0xBF870058)));
extern volatile uint32_t        ALRMDATEINV __attribute__((section("sfrs"),address(0xBF87005C)));
#define DSCON DSCON
extern volatile uint32_t   DSCON __attribute__((section("sfrs"), address(0xBF871000)));
typedef struct {
  uint32_t RELEASE:1;
  uint32_t DSBOR:1;
  uint32_t :6;
  uint32_t RTCCWDIS:1;
  uint32_t :3;
  uint32_t RTCDIS:1;
  uint32_t DSGPREN:1;
  uint32_t :1;
  uint32_t DSEN:1;
} __DSCONbits_t;
extern volatile __DSCONbits_t DSCONbits __asm__ ("DSCON") __attribute__((section("sfrs"), address(0xBF871000)));
#define DSWAKE DSWAKE
extern volatile uint32_t   DSWAKE __attribute__((section("sfrs"), address(0xBF871004)));
typedef struct {
  uint32_t :1;
  uint32_t ICD:1;
  uint32_t DSMCLR:1;
  uint32_t DSRTC:1;
  uint32_t DSWDT:1;
  uint32_t EXT:1;
  uint32_t :1;
  uint32_t DSFLT:1;
  uint32_t DSINT0:1;
} __DSWAKEbits_t;
