Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __DSWAKEbits_t DSWAKEbits __asm__ ("DSWAKE") __attribute__((section("sfrs"), address(0xBF871004)));
#define DSGPR0 DSGPR0
extern volatile uint32_t   DSGPR0 __attribute__((section("sfrs"), address(0xBF871008)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR0bits_t;
extern volatile __DSGPR0bits_t DSGPR0bits __asm__ ("DSGPR0") __attribute__((section("sfrs"), address(0xBF871008)));
#define DSGPR1 DSGPR1
extern volatile uint32_t   DSGPR1 __attribute__((section("sfrs"), address(0xBF871010)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR1bits_t;
extern volatile __DSGPR1bits_t DSGPR1bits __asm__ ("DSGPR1") __attribute__((section("sfrs"), address(0xBF871010)));
#define DSGPR2 DSGPR2
extern volatile uint32_t   DSGPR2 __attribute__((section("sfrs"), address(0xBF871014)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR2bits_t;
extern volatile __DSGPR2bits_t DSGPR2bits __asm__ ("DSGPR2") __attribute__((section("sfrs"), address(0xBF871014)));
#define DSGPR3 DSGPR3
extern volatile uint32_t   DSGPR3 __attribute__((section("sfrs"), address(0xBF871018)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR3bits_t;
extern volatile __DSGPR3bits_t DSGPR3bits __asm__ ("DSGPR3") __attribute__((section("sfrs"), address(0xBF871018)));
#define DSGPR4 DSGPR4
extern volatile uint32_t   DSGPR4 __attribute__((section("sfrs"), address(0xBF87101C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR4bits_t;
extern volatile __DSGPR4bits_t DSGPR4bits __asm__ ("DSGPR4") __attribute__((section("sfrs"), address(0xBF87101C)));
#define DSGPR5 DSGPR5
extern volatile uint32_t   DSGPR5 __attribute__((section("sfrs"), address(0xBF871020)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR5bits_t;
extern volatile __DSGPR5bits_t DSGPR5bits __asm__ ("DSGPR5") __attribute__((section("sfrs"), address(0xBF871020)));
#define DSGPR6 DSGPR6
extern volatile uint32_t   DSGPR6 __attribute__((section("sfrs"), address(0xBF871024)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR6bits_t;
extern volatile __DSGPR6bits_t DSGPR6bits __asm__ ("DSGPR6") __attribute__((section("sfrs"), address(0xBF871024)));
#define DSGPR7 DSGPR7
extern volatile uint32_t   DSGPR7 __attribute__((section("sfrs"), address(0xBF871028)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR7bits_t;
extern volatile __DSGPR7bits_t DSGPR7bits __asm__ ("DSGPR7") __attribute__((section("sfrs"), address(0xBF871028)));
#define DSGPR8 DSGPR8
extern volatile uint32_t   DSGPR8 __attribute__((section("sfrs"), address(0xBF87102C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR8bits_t;
extern volatile __DSGPR8bits_t DSGPR8bits __asm__ ("DSGPR8") __attribute__((section("sfrs"), address(0xBF87102C)));
#define DSGPR9 DSGPR9
extern volatile uint32_t   DSGPR9 __attribute__((section("sfrs"), address(0xBF871030)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR9bits_t;
extern volatile __DSGPR9bits_t DSGPR9bits __asm__ ("DSGPR9") __attribute__((section("sfrs"), address(0xBF871030)));
#define DSGPR10 DSGPR10
extern volatile uint32_t   DSGPR10 __attribute__((section("sfrs"), address(0xBF871034)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR10bits_t;
extern volatile __DSGPR10bits_t DSGPR10bits __asm__ ("DSGPR10") __attribute__((section("sfrs"), address(0xBF871034)));
#define DSGPR11 DSGPR11
extern volatile uint32_t   DSGPR11 __attribute__((section("sfrs"), address(0xBF871038)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR11bits_t;
extern volatile __DSGPR11bits_t DSGPR11bits __asm__ ("DSGPR11") __attribute__((section("sfrs"), address(0xBF871038)));
#define DSGPR12 DSGPR12
extern volatile uint32_t   DSGPR12 __attribute__((section("sfrs"), address(0xBF87103C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR12bits_t;
extern volatile __DSGPR12bits_t DSGPR12bits __asm__ ("DSGPR12") __attribute__((section("sfrs"), address(0xBF87103C)));
#define DSGPR13 DSGPR13
extern volatile uint32_t   DSGPR13 __attribute__((section("sfrs"), address(0xBF871040)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR13bits_t;
extern volatile __DSGPR13bits_t DSGPR13bits __asm__ ("DSGPR13") __attribute__((section("sfrs"), address(0xBF871040)));
#define DSGPR14 DSGPR14
extern volatile uint32_t   DSGPR14 __attribute__((section("sfrs"), address(0xBF871044)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR14bits_t;
extern volatile __DSGPR14bits_t DSGPR14bits __asm__ ("DSGPR14") __attribute__((section("sfrs"), address(0xBF871044)));
#define DSGPR15 DSGPR15
extern volatile uint32_t   DSGPR15 __attribute__((section("sfrs"), address(0xBF871048)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR15bits_t;
extern volatile __DSGPR15bits_t DSGPR15bits __asm__ ("DSGPR15") __attribute__((section("sfrs"), address(0xBF871048)));
#define DSGPR16 DSGPR16
extern volatile uint32_t   DSGPR16 __attribute__((section("sfrs"), address(0xBF87104C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR16bits_t;
extern volatile __DSGPR16bits_t DSGPR16bits __asm__ ("DSGPR16") __attribute__((section("sfrs"), address(0xBF87104C)));
#define DSGPR17 DSGPR17
extern volatile uint32_t   DSGPR17 __attribute__((section("sfrs"), address(0xBF871050)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR17bits_t;
extern volatile __DSGPR17bits_t DSGPR17bits __asm__ ("DSGPR17") __attribute__((section("sfrs"), address(0xBF871050)));
#define DSGPR18 DSGPR18
extern volatile uint32_t   DSGPR18 __attribute__((section("sfrs"), address(0xBF871054)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR18bits_t;
extern volatile __DSGPR18bits_t DSGPR18bits __asm__ ("DSGPR18") __attribute__((section("sfrs"), address(0xBF871054)));
#define DSGPR19 DSGPR19
extern volatile uint32_t   DSGPR19 __attribute__((section("sfrs"), address(0xBF871058)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR19bits_t;
extern volatile __DSGPR19bits_t DSGPR19bits __asm__ ("DSGPR19") __attribute__((section("sfrs"), address(0xBF871058)));
#define DSGPR20 DSGPR20
extern volatile uint32_t   DSGPR20 __attribute__((section("sfrs"), address(0xBF87105C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR20bits_t;
extern volatile __DSGPR20bits_t DSGPR20bits __asm__ ("DSGPR20") __attribute__((section("sfrs"), address(0xBF87105C)));
#define DSGPR21 DSGPR21
extern volatile uint32_t   DSGPR21 __attribute__((section("sfrs"), address(0xBF871060)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR21bits_t;
extern volatile __DSGPR21bits_t DSGPR21bits __asm__ ("DSGPR21") __attribute__((section("sfrs"), address(0xBF871060)));
#define DSGPR22 DSGPR22
extern volatile uint32_t   DSGPR22 __attribute__((section("sfrs"), address(0xBF871064)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR22bits_t;
extern volatile __DSGPR22bits_t DSGPR22bits __asm__ ("DSGPR22") __attribute__((section("sfrs"), address(0xBF871064)));
#define DSGPR23 DSGPR23
extern volatile uint32_t   DSGPR23 __attribute__((section("sfrs"), address(0xBF871068)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR23bits_t;
extern volatile __DSGPR23bits_t DSGPR23bits __asm__ ("DSGPR23") __attribute__((section("sfrs"), address(0xBF871068)));
#define DSGPR24 DSGPR24
extern volatile uint32_t   DSGPR24 __attribute__((section("sfrs"), address(0xBF87106C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR24bits_t;
