Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __DSGPR24bits_t DSGPR24bits __asm__ ("DSGPR24") __attribute__((section("sfrs"), address(0xBF87106C)));
#define DSGPR25 DSGPR25
extern volatile uint32_t   DSGPR25 __attribute__((section("sfrs"), address(0xBF871070)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR25bits_t;
extern volatile __DSGPR25bits_t DSGPR25bits __asm__ ("DSGPR25") __attribute__((section("sfrs"), address(0xBF871070)));
#define DSGPR26 DSGPR26
extern volatile uint32_t   DSGPR26 __attribute__((section("sfrs"), address(0xBF871074)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR26bits_t;
extern volatile __DSGPR26bits_t DSGPR26bits __asm__ ("DSGPR26") __attribute__((section("sfrs"), address(0xBF871074)));
#define DSGPR27 DSGPR27
extern volatile uint32_t   DSGPR27 __attribute__((section("sfrs"), address(0xBF871078)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR27bits_t;
extern volatile __DSGPR27bits_t DSGPR27bits __asm__ ("DSGPR27") __attribute__((section("sfrs"), address(0xBF871078)));
#define DSGPR28 DSGPR28
extern volatile uint32_t   DSGPR28 __attribute__((section("sfrs"), address(0xBF87107C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR28bits_t;
extern volatile __DSGPR28bits_t DSGPR28bits __asm__ ("DSGPR28") __attribute__((section("sfrs"), address(0xBF87107C)));
#define DSGPR29 DSGPR29
extern volatile uint32_t   DSGPR29 __attribute__((section("sfrs"), address(0xBF871080)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR29bits_t;
extern volatile __DSGPR29bits_t DSGPR29bits __asm__ ("DSGPR29") __attribute__((section("sfrs"), address(0xBF871080)));
#define DSGPR30 DSGPR30
extern volatile uint32_t   DSGPR30 __attribute__((section("sfrs"), address(0xBF871084)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR30bits_t;
extern volatile __DSGPR30bits_t DSGPR30bits __asm__ ("DSGPR30") __attribute__((section("sfrs"), address(0xBF871084)));
#define DSGPR31 DSGPR31
extern volatile uint32_t   DSGPR31 __attribute__((section("sfrs"), address(0xBF871088)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR31bits_t;
extern volatile __DSGPR31bits_t DSGPR31bits __asm__ ("DSGPR31") __attribute__((section("sfrs"), address(0xBF871088)));
#define DSGPR32 DSGPR32
extern volatile uint32_t   DSGPR32 __attribute__((section("sfrs"), address(0xBF87108C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR32bits_t;
extern volatile __DSGPR32bits_t DSGPR32bits __asm__ ("DSGPR32") __attribute__((section("sfrs"), address(0xBF87108C)));
#define SQI1XCON1 SQI1XCON1
extern volatile uint32_t   SQI1XCON1 __attribute__((section("sfrs"), address(0xBF8E1000)));
typedef struct {
  uint32_t TYPECMD:2;
  uint32_t TYPEADDR:2;
  uint32_t TYPEMODE:2;
  uint32_t TYPEDUMMY:2;
  uint32_t TYPEDATA:2;
  uint32_t READOPCODE:8;
  uint32_t ADDRBYTES:3;
  uint32_t DUMMYBYTES:3;
  uint32_t DDRCMD:1;
  uint32_t DDRADDR:1;
  uint32_t DDRMODE:1;
  uint32_t DDRDUMMY:1;
  uint32_t DDRDATA:1;
  uint32_t SDRCMD:1;
} __SQI1XCON1bits_t;
extern volatile __SQI1XCON1bits_t SQI1XCON1bits __asm__ ("SQI1XCON1") __attribute__((section("sfrs"), address(0xBF8E1000)));
#define SQI1XCON2 SQI1XCON2
extern volatile uint32_t   SQI1XCON2 __attribute__((section("sfrs"), address(0xBF8E1004)));
typedef struct {
  uint32_t MODECODE:8;
  uint32_t MODEBYTES:2;
  uint32_t DEVSEL:2;
} __SQI1XCON2bits_t;
extern volatile __SQI1XCON2bits_t SQI1XCON2bits __asm__ ("SQI1XCON2") __attribute__((section("sfrs"), address(0xBF8E1004)));
#define SQI1CFG SQI1CFG
extern volatile uint32_t   SQI1CFG __attribute__((section("sfrs"), address(0xBF8E1008)));
typedef struct {
  uint32_t MODE:3;
  uint32_t CPHA:1;
  uint32_t CPOL:1;
  uint32_t LSBF:1;
  uint32_t :3;
  uint32_t WP:1;
  uint32_t HOLD:1;
  uint32_t :1;
  uint32_t BURSTEN:1;
  uint32_t :3;
  uint32_t RESET:1;
  uint32_t TXBUFRST:1;
  uint32_t RXBUFRST:1;
  uint32_t CONBUFRST:1;
  uint32_t DATAEN:2;
  uint32_t :1;
  uint32_t SQIEN:1;
  uint32_t CSEN:2;
} __SQI1CFGbits_t;
extern volatile __SQI1CFGbits_t SQI1CFGbits __asm__ ("SQI1CFG") __attribute__((section("sfrs"), address(0xBF8E1008)));
#define SQI1CON SQI1CON
extern volatile uint32_t   SQI1CON __attribute__((section("sfrs"), address(0xBF8E100C)));
typedef struct {
  uint32_t TXRXCOUNT:16;
  uint32_t CMDINIT:2;
  uint32_t LANEMODE:2;
  uint32_t DEVSEL:2;
  uint32_t DASSERT:1;
  uint32_t DDRMODE:1;
  uint32_t SCHECK:1;
} __SQI1CONbits_t;
extern volatile __SQI1CONbits_t SQI1CONbits __asm__ ("SQI1CON") __attribute__((section("sfrs"), address(0xBF8E100C)));
#define SQI1CLKCON SQI1CLKCON
extern volatile uint32_t   SQI1CLKCON __attribute__((section("sfrs"), address(0xBF8E1010)));
typedef struct {
  uint32_t EN:1;
  uint32_t STABLE:1;
  uint32_t :6;
  uint32_t CLKDIV:11;
} __SQI1CLKCONbits_t;
extern volatile __SQI1CLKCONbits_t SQI1CLKCONbits __asm__ ("SQI1CLKCON") __attribute__((section("sfrs"), address(0xBF8E1010)));
#define SQI1CMDTHR SQI1CMDTHR
extern volatile uint32_t   SQI1CMDTHR __attribute__((section("sfrs"), address(0xBF8E1014)));
typedef struct {
  uint32_t RXCMDTHR:6;
  uint32_t :2;
  uint32_t TXCMDTHR:6;
} __SQI1CMDTHRbits_t;
extern volatile __SQI1CMDTHRbits_t SQI1CMDTHRbits __asm__ ("SQI1CMDTHR") __attribute__((section("sfrs"), address(0xBF8E1014)));
#define SQI1INTTHR SQI1INTTHR
extern volatile uint32_t   SQI1INTTHR __attribute__((section("sfrs"), address(0xBF8E1018)));
typedef struct {
  uint32_t RXINTTHR:6;
  uint32_t :2;
  uint32_t TXINTTHR:6;
} __SQI1INTTHRbits_t;
extern volatile __SQI1INTTHRbits_t SQI1INTTHRbits __asm__ ("SQI1INTTHR") __attribute__((section("sfrs"), address(0xBF8E1018)));
#define SQI1INTEN SQI1INTEN
extern volatile uint32_t   SQI1INTEN __attribute__((section("sfrs"), address(0xBF8E101C)));
typedef struct {
  uint32_t TXEMPTYIE:1;
  uint32_t TXFULLIE:1;
  uint32_t TXTHRIE:1;
  uint32_t RXEMPTYIE:1;
  uint32_t RXFULLIE:1;
  uint32_t RXTHRIE:1;
  uint32_t CONFULLIE:1;
  uint32_t CONEMPTYIE:1;
  uint32_t CONTHRIE:1;
  uint32_t BDDONEIE:1;
  uint32_t PKTCOMPIE:1;
  uint32_t DMAEIE:1;
} __SQI1INTENbits_t;
extern volatile __SQI1INTENbits_t SQI1INTENbits __asm__ ("SQI1INTEN") __attribute__((section("sfrs"), address(0xBF8E101C)));
#define SQI1INTSTAT SQI1INTSTAT
extern volatile uint32_t   SQI1INTSTAT __attribute__((section("sfrs"), address(0xBF8E1020)));
typedef struct {
  uint32_t TXEMPTYIF:1;
  uint32_t TXFULLIF:1;
  uint32_t TXTHRIF:1;
  uint32_t RXEMPTYIF:1;
  uint32_t RXFULLIF:1;
  uint32_t RXTHRIF:1;
  uint32_t CONFULLIF:1;
  uint32_t CONEMPTYIF:1;
  uint32_t CONTHRIF:1;
  uint32_t BDDONEIF:1;
  uint32_t PKTCOMPIF:1;
  uint32_t DMAEIF:1;
} __SQI1INTSTATbits_t;
extern volatile __SQI1INTSTATbits_t SQI1INTSTATbits __asm__ ("SQI1INTSTAT") __attribute__((section("sfrs"), address(0xBF8E1020)));
#define SQI1TXDATA SQI1TXDATA
extern volatile uint32_t   SQI1TXDATA __attribute__((section("sfrs"), address(0xBF8E1024)));
typedef struct {
  uint32_t TXDATA:32;
} __SQI1TXDATAbits_t;
extern volatile __SQI1TXDATAbits_t SQI1TXDATAbits __asm__ ("SQI1TXDATA") __attribute__((section("sfrs"), address(0xBF8E1024)));
#define SQI1RXDATA SQI1RXDATA
extern volatile uint32_t   SQI1RXDATA __attribute__((section("sfrs"), address(0xBF8E1028)));
typedef struct {
  uint32_t RXDATA:32;
} __SQI1RXDATAbits_t;
extern volatile __SQI1RXDATAbits_t SQI1RXDATAbits __asm__ ("SQI1RXDATA") __attribute__((section("sfrs"), address(0xBF8E1028)));
#define SQI1STAT1 SQI1STAT1
extern volatile uint32_t   SQI1STAT1 __attribute__((section("sfrs"), address(0xBF8E102C)));
typedef struct {
  uint32_t RXBUFCNT:6;
  uint32_t :10;
  uint32_t TXBUFFREE:6;
} __SQI1STAT1bits_t;
