Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __SQI1STAT1bits_t SQI1STAT1bits __asm__ ("SQI1STAT1") __attribute__((section("sfrs"), address(0xBF8E102C)));
#define SQI1STAT2 SQI1STAT2
extern volatile uint32_t   SQI1STAT2 __attribute__((section("sfrs"), address(0xBF8E1030)));
typedef struct {
  uint32_t TXOV:1;
  uint32_t RXUN:1;
  uint32_t :1;
  uint32_t SQID0:1;
  uint32_t SQID1:1;
  uint32_t SQID2:1;
  uint32_t SQID3:1;
  uint32_t CONAVAIL:4;
  uint32_t :5;
  uint32_t CMDSTAT:2;
} __SQI1STAT2bits_t;
extern volatile __SQI1STAT2bits_t SQI1STAT2bits __asm__ ("SQI1STAT2") __attribute__((section("sfrs"), address(0xBF8E1030)));
#define SQI1BDCON SQI1BDCON
extern volatile uint32_t   SQI1BDCON __attribute__((section("sfrs"), address(0xBF8E1034)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t POLLEN:1;
  uint32_t START:1;
} __SQI1BDCONbits_t;
extern volatile __SQI1BDCONbits_t SQI1BDCONbits __asm__ ("SQI1BDCON") __attribute__((section("sfrs"), address(0xBF8E1034)));
#define SQI1BDCURADD SQI1BDCURADD
extern volatile uint32_t   SQI1BDCURADD __attribute__((section("sfrs"), address(0xBF8E1038)));
typedef struct {
  uint32_t BDCURRADDR:32;
} __SQI1BDCURADDbits_t;
extern volatile __SQI1BDCURADDbits_t SQI1BDCURADDbits __asm__ ("SQI1BDCURADD") __attribute__((section("sfrs"), address(0xBF8E1038)));
#define SQI1BDBASEADD SQI1BDBASEADD
extern volatile uint32_t   SQI1BDBASEADD __attribute__((section("sfrs"), address(0xBF8E1040)));
typedef struct {
  uint32_t BDADDR:32;
} __SQI1BDBASEADDbits_t;
extern volatile __SQI1BDBASEADDbits_t SQI1BDBASEADDbits __asm__ ("SQI1BDBASEADD") __attribute__((section("sfrs"), address(0xBF8E1040)));
#define SQI1BDSTAT SQI1BDSTAT
extern volatile uint32_t   SQI1BDSTAT __attribute__((section("sfrs"), address(0xBF8E1044)));
typedef struct {
  uint32_t BDCON:16;
  uint32_t DMAACTV:1;
  uint32_t DMASTART:1;
  uint32_t BDSTATE:4;
} __SQI1BDSTATbits_t;
extern volatile __SQI1BDSTATbits_t SQI1BDSTATbits __asm__ ("SQI1BDSTAT") __attribute__((section("sfrs"), address(0xBF8E1044)));
#define SQI1BDPOLLCON SQI1BDPOLLCON
extern volatile uint32_t   SQI1BDPOLLCON __attribute__((section("sfrs"), address(0xBF8E1048)));
typedef struct {
  uint32_t POLLCON:16;
} __SQI1BDPOLLCONbits_t;
extern volatile __SQI1BDPOLLCONbits_t SQI1BDPOLLCONbits __asm__ ("SQI1BDPOLLCON") __attribute__((section("sfrs"), address(0xBF8E1048)));
#define SQI1BDTXDSTAT SQI1BDTXDSTAT
extern volatile uint32_t   SQI1BDTXDSTAT __attribute__((section("sfrs"), address(0xBF8E104C)));
typedef struct {
  uint32_t TXCURBUFLEN:9;
  uint32_t :7;
  uint32_t TXBUFCNT:5;
  uint32_t :4;
  uint32_t TXSTATE:4;
} __SQI1BDTXDSTATbits_t;
extern volatile __SQI1BDTXDSTATbits_t SQI1BDTXDSTATbits __asm__ ("SQI1BDTXDSTAT") __attribute__((section("sfrs"), address(0xBF8E104C)));
#define SQI1BDRXDSTAT SQI1BDRXDSTAT
extern volatile uint32_t   SQI1BDRXDSTAT __attribute__((section("sfrs"), address(0xBF8E1050)));
typedef struct {
  uint32_t RXCURBUFLEN:9;
  uint32_t :7;
  uint32_t RXBUFCNT:5;
  uint32_t :4;
  uint32_t RXSTATE:4;
} __SQI1BDRXDSTATbits_t;
extern volatile __SQI1BDRXDSTATbits_t SQI1BDRXDSTATbits __asm__ ("SQI1BDRXDSTAT") __attribute__((section("sfrs"), address(0xBF8E1050)));
#define SQI1THR SQI1THR
extern volatile uint32_t   SQI1THR __attribute__((section("sfrs"), address(0xBF8E1054)));
typedef struct {
  uint32_t THRES:4;
} __SQI1THRbits_t;
extern volatile __SQI1THRbits_t SQI1THRbits __asm__ ("SQI1THR") __attribute__((section("sfrs"), address(0xBF8E1054)));
#define SQI1INTSIGEN SQI1INTSIGEN
extern volatile uint32_t   SQI1INTSIGEN __attribute__((section("sfrs"), address(0xBF8E1058)));
typedef struct {
  uint32_t TXEMPTYISE:1;
  uint32_t TXFULLISE:1;
  uint32_t TXTHRISE:1;
  uint32_t RXEMPTYISE:1;
  uint32_t RXFULLISE:1;
  uint32_t RXTHRISE:1;
  uint32_t CONFULLISE:1;
  uint32_t CONEMPTYISE:1;
  uint32_t CONTHRISE:1;
  uint32_t BDDONEISE:1;
  uint32_t PKTCOMPISE:1;
  uint32_t DMAEISE:1;
} __SQI1INTSIGENbits_t;
extern volatile __SQI1INTSIGENbits_t SQI1INTSIGENbits __asm__ ("SQI1INTSIGEN") __attribute__((section("sfrs"), address(0xBF8E1058)));
#define SQI1TAPCON SQI1TAPCON
extern volatile uint32_t   SQI1TAPCON __attribute__((section("sfrs"), address(0xBF8E105C)));
typedef struct {
  uint32_t CLKOUTDLY:4;
  uint32_t DATAOUTDLY:4;
  uint32_t SDRCLKINDLY:6;
  uint32_t :2;
  uint32_t DDRDATINDLY:4;
  uint32_t SDRDATINDLY:4;
  uint32_t DDRCLKINDLY:6;
} __SQI1TAPCONbits_t;
extern volatile __SQI1TAPCONbits_t SQI1TAPCONbits __asm__ ("SQI1TAPCON") __attribute__((section("sfrs"), address(0xBF8E105C)));
#define SQI1MEMSTAT SQI1MEMSTAT
extern volatile uint32_t   SQI1MEMSTAT __attribute__((section("sfrs"), address(0xBF8E1060)));
typedef struct {
  uint32_t STATCMD:16;
  uint32_t STATBYTES:2;
  uint32_t STATTYPE:2;
  uint32_t STATPOS:1;
} __SQI1MEMSTATbits_t;
extern volatile __SQI1MEMSTATbits_t SQI1MEMSTATbits __asm__ ("SQI1MEMSTAT") __attribute__((section("sfrs"), address(0xBF8E1060)));
#define SQI1XCON3 SQI1XCON3
extern volatile uint32_t   SQI1XCON3 __attribute__((section("sfrs"), address(0xBF8E1064)));
typedef struct {
  uint32_t INIT1CMD1:8;
  uint32_t INIT1CMD2:8;
  uint32_t INIT1CMD3:8;
  uint32_t INIT1TYPE:2;
  uint32_t INIT1COUNT:2;
  uint32_t INIT1SCHECK:1;
} __SQI1XCON3bits_t;
extern volatile __SQI1XCON3bits_t SQI1XCON3bits __asm__ ("SQI1XCON3") __attribute__((section("sfrs"), address(0xBF8E1064)));
#define SQI1XCON4 SQI1XCON4
extern volatile uint32_t   SQI1XCON4 __attribute__((section("sfrs"), address(0xBF8E1068)));
typedef struct {
  uint32_t INIT2CMD1:8;
  uint32_t INIT2CMD2:8;
  uint32_t INIT2CMD3:8;
  uint32_t INIT2TYPE:2;
  uint32_t INIT2COUNT:2;
  uint32_t INIT2SCHECK:1;
} __SQI1XCON4bits_t;
extern volatile __SQI1XCON4bits_t SQI1XCON4bits __asm__ ("SQI1XCON4") __attribute__((section("sfrs"), address(0xBF8E1068)));
#define CEVER CEVER
extern volatile uint32_t   CEVER __attribute__((section("sfrs"), address(0xBF8E4000)));
typedef struct {
  uint32_t ID:16;
  uint32_t VERSION:8;
  uint32_t REVISION:8;
} __CEVERbits_t;
extern volatile __CEVERbits_t CEVERbits __asm__ ("CEVER") __attribute__((section("sfrs"), address(0xBF8E4000)));
#define CECON CECON
extern volatile uint32_t   CECON __attribute__((section("sfrs"), address(0xBF8E4004)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t BDPPLEN:1;
  uint32_t BDPCHST:1;
  uint32_t :2;
  uint32_t SWAPEN:1;
  uint32_t SWRST:1;
  uint32_t SWAPOEN:1;
} __CECONbits_t;
