Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
extern volatile __CEDSACONbits_t CEDSACONbits __asm__ ("CEDSACON") __attribute__((section("sfrs"), address(0xBF8E4050)));
#define CEDCSTATE CEDCSTATE
extern volatile uint32_t   CEDCSTATE __attribute__((section("sfrs"), address(0xBF8E4054)));
typedef struct {
  uint32_t CSTATE:4;
} __CEDCSTATEbits_t;
extern volatile __CEDCSTATEbits_t CEDCSTATEbits __asm__ ("CEDCSTATE") __attribute__((section("sfrs"), address(0xBF8E4054)));
#define CEDTXBCNT CEDTXBCNT
extern volatile uint32_t   CEDTXBCNT __attribute__((section("sfrs"), address(0xBF8E4058)));
typedef struct {
  uint32_t CTXBCNT:5;
} __CEDTXBCNTbits_t;
extern volatile __CEDTXBCNTbits_t CEDTXBCNTbits __asm__ ("CEDTXBCNT") __attribute__((section("sfrs"), address(0xBF8E4058)));
#define CEDRXBCNT CEDRXBCNT
extern volatile uint32_t   CEDRXBCNT __attribute__((section("sfrs"), address(0xBF8E405C)));
typedef struct {
  uint32_t DRXBCNT:7;
} __CEDRXBCNTbits_t;
extern volatile __CEDRXBCNTbits_t CEDRXBCNTbits __asm__ ("CEDRXBCNT") __attribute__((section("sfrs"), address(0xBF8E405C)));
#define CEREV CEREV
extern volatile uint32_t   CEREV __attribute__((section("sfrs"), address(0xBF8E4060)));
typedef struct {
  uint32_t MAJOR:8;
  uint32_t MINOR:8;
  uint32_t MAINTENANCE:8;
} __CEREVbits_t;
extern volatile __CEREVbits_t CEREVbits __asm__ ("CEREV") __attribute__((section("sfrs"), address(0xBF8E4060)));
#define RNGVER RNGVER
extern volatile uint32_t   RNGVER __attribute__((section("sfrs"), address(0xBF8E5000)));
typedef struct {
  uint32_t REVISION:7;
  uint32_t VERSION:9;
  uint32_t ID:16;
} __RNGVERbits_t;
extern volatile __RNGVERbits_t RNGVERbits __asm__ ("RNGVER") __attribute__((section("sfrs"), address(0xBF8E5000)));
#define RNGCON RNGCON
extern volatile uint32_t   RNGCON __attribute__((section("sfrs"), address(0xBF8E5004)));
typedef struct {
  uint32_t PLEN:8;
  uint32_t TRNGEN:1;
  uint32_t PRNGEN:1;
  uint32_t CONT:1;
  uint32_t TRNGMODE:1;
  uint32_t LOAD:1;
} __RNGCONbits_t;
extern volatile __RNGCONbits_t RNGCONbits __asm__ ("RNGCON") __attribute__((section("sfrs"), address(0xBF8E5004)));
#define RNGPOLY1 RNGPOLY1
extern volatile uint32_t   RNGPOLY1 __attribute__((section("sfrs"), address(0xBF8E5008)));
typedef struct {
  uint32_t POLY:32;
} __RNGPOLY1bits_t;
extern volatile __RNGPOLY1bits_t RNGPOLY1bits __asm__ ("RNGPOLY1") __attribute__((section("sfrs"), address(0xBF8E5008)));
#define RNGPOLY2 RNGPOLY2
extern volatile uint32_t   RNGPOLY2 __attribute__((section("sfrs"), address(0xBF8E500C)));
typedef struct {
  uint32_t POLY:32;
} __RNGPOLY2bits_t;
extern volatile __RNGPOLY2bits_t RNGPOLY2bits __asm__ ("RNGPOLY2") __attribute__((section("sfrs"), address(0xBF8E500C)));
#define RNGNUMGEN1 RNGNUMGEN1
extern volatile uint32_t   RNGNUMGEN1 __attribute__((section("sfrs"), address(0xBF8E5010)));
typedef struct {
  uint32_t RNG:32;
} __RNGNUMGEN1bits_t;
extern volatile __RNGNUMGEN1bits_t RNGNUMGEN1bits __asm__ ("RNGNUMGEN1") __attribute__((section("sfrs"), address(0xBF8E5010)));
#define RNGNUMGEN2 RNGNUMGEN2
extern volatile uint32_t   RNGNUMGEN2 __attribute__((section("sfrs"), address(0xBF8E5014)));
typedef struct {
  uint32_t RNG:32;
} __RNGNUMGEN2bits_t;
extern volatile __RNGNUMGEN2bits_t RNGNUMGEN2bits __asm__ ("RNGNUMGEN2") __attribute__((section("sfrs"), address(0xBF8E5014)));
#define RNGSEED1 RNGSEED1
extern volatile uint32_t   RNGSEED1 __attribute__((section("sfrs"), address(0xBF8E5018)));
typedef struct {
  uint32_t SEED:32;
} __RNGSEED1bits_t;
extern volatile __RNGSEED1bits_t RNGSEED1bits __asm__ ("RNGSEED1") __attribute__((section("sfrs"), address(0xBF8E5018)));
#define RNGSEED2 RNGSEED2
extern volatile uint32_t   RNGSEED2 __attribute__((section("sfrs"), address(0xBF8E501C)));
typedef struct {
  uint32_t SEED:32;
} __RNGSEED2bits_t;
extern volatile __RNGSEED2bits_t RNGSEED2bits __asm__ ("RNGSEED2") __attribute__((section("sfrs"), address(0xBF8E501C)));
#define RNGCNT RNGCNT
extern volatile uint32_t   RNGCNT __attribute__((section("sfrs"), address(0xBF8E5020)));
typedef struct {
  uint32_t RCNT:7;
} __RNGCNTbits_t;
extern volatile __RNGCNTbits_t RNGCNTbits __asm__ ("RNGCNT") __attribute__((section("sfrs"), address(0xBF8E5020)));
#define PKCONFIG PKCONFIG
extern volatile uint32_t   PKCONFIG __attribute__((section("sfrs"), address(0xBF920000)));
typedef struct {
  uint32_t OPPTRA:5;
  uint32_t :3;
  uint32_t OPPTRB:5;
  uint32_t :3;
  uint32_t OPPTRC:5;
} __PKCONFIGbits_t;
extern volatile __PKCONFIGbits_t PKCONFIGbits __asm__ ("PKCONFIG") __attribute__((section("sfrs"), address(0xBF920000)));
#define PKCOMMAND PKCOMMAND
extern volatile uint32_t   PKCOMMAND __attribute__((section("sfrs"), address(0xBF920004)));
typedef struct {
  uint32_t OPERATION:7;
  uint32_t FIELD:1;
  uint32_t OPSIZE:8;
  uint32_t :13;
  uint32_t SIGNA:1;
  uint32_t SIGNB:1;
  uint32_t CALCR2:1;
} __PKCOMMANDbits_t;
extern volatile __PKCOMMANDbits_t PKCOMMANDbits __asm__ ("PKCOMMAND") __attribute__((section("sfrs"), address(0xBF920004)));
#define PKCONTROL PKCONTROL
extern volatile uint32_t   PKCONTROL __attribute__((section("sfrs"), address(0xBF920008)));
typedef struct {
  uint32_t START:1;
} __PKCONTROLbits_t;
extern volatile __PKCONTROLbits_t PKCONTROLbits __asm__ ("PKCONTROL") __attribute__((section("sfrs"), address(0xBF920008)));
#define PKSTATUS PKSTATUS
extern volatile uint32_t   PKSTATUS __attribute__((section("sfrs"), address(0xBF92000C)));
typedef struct {
  uint32_t EADDR:4;
  uint32_t PXNOC:1;
  uint32_t PXINF:1;
  uint32_t CPLINVAL:1;
  uint32_t PNINVAL:1;
  uint32_t :1;
  uint32_t SIGINVAL:1;
  uint32_t PABINVAL:1;
  uint32_t NONINV:1;
  uint32_t PRIME:1;
  uint32_t :3;
  uint32_t BUSY:1;
} __PKSTATUSbits_t;
extern volatile __PKSTATUSbits_t PKSTATUSbits __asm__ ("PKSTATUS") __attribute__((section("sfrs"), address(0xBF92000C)));
#define PKVERSION PKVERSION
extern volatile uint32_t   PKVERSION __attribute__((section("sfrs"), address(0xBF920010)));
typedef struct {
  uint32_t SWVER:8;
  uint32_t HWVER:8;
} __PKVERSIONbits_t;
extern volatile __PKVERSIONbits_t PKVERSIONbits __asm__ ("PKVERSION") __attribute__((section("sfrs"), address(0xBF920010)));
#define FUSERID FUSERID
extern volatile uint32_t   FUSERID __attribute__((section("sfrs"), address(0xBFC55F88)));
typedef union {
  struct {
    uint32_t USERID:16;
  };
  struct {
    uint32_t w:32;
  };
} __FUSERIDbits_t;
extern volatile __FUSERIDbits_t FUSERIDbits __asm__ ("FUSERID") __attribute__((section("sfrs"), address(0xBFC55F88)));
#define DEVCFG4 DEVCFG4
extern volatile uint32_t   DEVCFG4 __attribute__((section("sfrs"), address(0xBFC55F8C)));
typedef union {
  struct {
    uint32_t SOSCCFG:8;
    uint32_t :11;
    uint32_t VBZPBOREN:1;
    uint32_t DSZPBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t DSEN:1;
    uint32_t :1;
    uint32_t SOSCEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG4bits_t;
extern volatile __DEVCFG4bits_t DEVCFG4bits __asm__ ("DEVCFG4") __attribute__((section("sfrs"), address(0xBFC55F8C)));
#define DEVCFG2 DEVCFG2
extern volatile uint32_t   DEVCFG2 __attribute__((section("sfrs"), address(0xBFC55F90)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t DMTINTV:3;
    uint32_t :2;
    uint32_t POSCMOD:2;
    uint32_t WDTRMCS:2;
    uint32_t SOSCSEL:1;
    uint32_t WAKE2SPD:1;
    uint32_t CKSWEN:1;
    uint32_t FSCMEN:1;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t WDTEN:1;
    uint32_t WDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t DMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG2bits_t;
extern volatile __DEVCFG2bits_t DEVCFG2bits __asm__ ("DEVCFG2") __attribute__((section("sfrs"), address(0xBFC55F90)));
#define DEVCFG1 DEVCFG1
extern volatile uint32_t   DEVCFG1 __attribute__((section("sfrs"), address(0xBFC55F94)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t :1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t :2;
    uint32_t FMIIEN:1;
    uint32_t ETHEXEREF:1;
    uint32_t CLASSBDIS:1;
    uint32_t USBIDIO:1;
    uint32_t VBUSIO:1;
    uint32_t HSSPIEN:1;
    uint32_t SMCLR:1;
    uint32_t HSUARTEN:1;
    uint32_t USBDMTRIM:4;
    uint32_t USBDPTRIM:4;
    uint32_t WDTPSS:5;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG1bits_t;
extern volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1") __attribute__((section("sfrs"), address(0xBFC55F94)));
#define DEVCFG0 DEVCFG0
extern volatile uint32_t   DEVCFG0 __attribute__((section("sfrs"), address(0xBFC55F98)));
typedef union {
  struct {
    uint32_t TDOEN:1;
    uint32_t :1;
    uint32_t TROEN:1;
    uint32_t JTAGEN:1;
    uint32_t :1;
    uint32_t FCPRI:1;
    uint32_t DMAPRI:1;
    uint32_t EXLPRI:1;
    uint32_t USBSSEN:1;
    uint32_t :1;
    uint32_t PMULOCK:1;
    uint32_t PGLOCK:1;
    uint32_t PMDLOCK:1;
    uint32_t IOLOCK:1;
    uint32_t CFGLOCK:2;
    uint32_t OC_ACLK:1;
    uint32_t IC_ACLK:1;
    uint32_t :2;
    uint32_t CANFDDIV:2;
    uint32_t :1;
    uint32_t PCM:1;
    uint32_t UPLLHWMD:1;
    uint32_t SPLLHWMD:1;
    uint32_t BTPLLHWMD:1;
    uint32_t ETHPLLHWMD:1;
    uint32_t FECCCON:2;
    uint32_t ETHTPSF:1;
    uint32_t EPGMCLK:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG0bits_t;
