Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
  .extern DCH2SSIZCLR      /* 0xBF811234 */
  .extern DCH2SSIZSET      /* 0xBF811238 */
  .extern DCH2SSIZINV      /* 0xBF81123C */
  .extern DCH2DSIZ         /* 0xBF811240 */
  .extern DCH2DSIZCLR      /* 0xBF811244 */
  .extern DCH2DSIZSET      /* 0xBF811248 */
  .extern DCH2DSIZINV      /* 0xBF81124C */
  .extern DCH2SPTR         /* 0xBF811250 */
  .extern DCH2SPTRCLR      /* 0xBF811254 */
  .extern DCH2SPTRSET      /* 0xBF811258 */
  .extern DCH2SPTRINV      /* 0xBF81125C */
  .extern DCH2DPTR         /* 0xBF811260 */
  .extern DCH2DPTRCLR      /* 0xBF811264 */
  .extern DCH2DPTRSET      /* 0xBF811268 */
  .extern DCH2DPTRINV      /* 0xBF81126C */
  .extern DCH2CSIZ         /* 0xBF811270 */
  .extern DCH2CSIZCLR      /* 0xBF811274 */
  .extern DCH2CSIZSET      /* 0xBF811278 */
  .extern DCH2CSIZINV      /* 0xBF81127C */
  .extern DCH2CPTR         /* 0xBF811280 */
  .extern DCS2CPTR         /* 0xBF811280 */
  .extern DCH2CPTRCLR      /* 0xBF811284 */
  .extern DCS2CPTRCLR      /* 0xBF811284 */
  .extern DCH2CPTRSET      /* 0xBF811288 */
  .extern DCS2CPTRSET      /* 0xBF811288 */
  .extern DCH2CPTRINV      /* 0xBF81128C */
  .extern DCS2CPTRINV      /* 0xBF81128C */
  .extern DCH2DAT          /* 0xBF811290 */
  .extern DCH2DATCLR       /* 0xBF811294 */
  .extern DCH2DATSET       /* 0xBF811298 */
  .extern DCH2DATINV       /* 0xBF81129C */
  .extern DCH3CON          /* 0xBF8112A0 */
  .extern DCH3CONCLR       /* 0xBF8112A4 */
  .extern DCH3CONSET       /* 0xBF8112A8 */
  .extern DCH3CONINV       /* 0xBF8112AC */
  .extern DCH3ECON         /* 0xBF8112B0 */
  .extern DCH3ECONCLR      /* 0xBF8112B4 */
  .extern DCH3ECONSET      /* 0xBF8112B8 */
  .extern DCH3ECONINV      /* 0xBF8112BC */
  .extern DCH3INT          /* 0xBF8112C0 */
  .extern DCH3INTCLR       /* 0xBF8112C4 */
  .extern DCH3INTSET       /* 0xBF8112C8 */
  .extern DCH3INTINV       /* 0xBF8112CC */
  .extern DCH3SSA          /* 0xBF8112D0 */
  .extern DCH3SSACLR       /* 0xBF8112D4 */
  .extern DCH3SSASET       /* 0xBF8112D8 */
  .extern DCH3SSAINV       /* 0xBF8112DC */
  .extern DCH3DSA          /* 0xBF8112E0 */
  .extern DCH3DSACLR       /* 0xBF8112E4 */
  .extern DCH3DSASET       /* 0xBF8112E8 */
  .extern DCH3DSAINV       /* 0xBF8112EC */
  .extern DCH3SSIZ         /* 0xBF8112F0 */
  .extern DCH3SSIZCLR      /* 0xBF8112F4 */
  .extern DCH3SSIZSET      /* 0xBF8112F8 */
  .extern DCH3SSIZINV      /* 0xBF8112FC */
  .extern DCH3DSIZ         /* 0xBF811300 */
  .extern DCH3DSIZCLR      /* 0xBF811304 */
  .extern DCH3DSIZSET      /* 0xBF811308 */
  .extern DCH3DSIZINV      /* 0xBF81130C */
  .extern DCH3SPTR         /* 0xBF811310 */
  .extern DCH3SPTRCLR      /* 0xBF811314 */
  .extern DCH3SPTRSET      /* 0xBF811318 */
  .extern DCH3SPTRINV      /* 0xBF81131C */
  .extern DCH3DPTR         /* 0xBF811320 */
  .extern DCH3DPTRCLR      /* 0xBF811324 */
  .extern DCH3DPTRSET      /* 0xBF811328 */
  .extern DCH3DPTRINV      /* 0xBF81132C */
  .extern DCH3CSIZ         /* 0xBF811330 */
  .extern DCH3CSIZCLR      /* 0xBF811334 */
  .extern DCH3CSIZSET      /* 0xBF811338 */
  .extern DCH3CSIZINV      /* 0xBF81133C */
  .extern DCH3CPTR         /* 0xBF811340 */
  .extern DCS3CPTR         /* 0xBF811340 */
  .extern DCH3CPTRCLR      /* 0xBF811344 */
  .extern DCS3CPTRCLR      /* 0xBF811344 */
  .extern DCH3CPTRSET      /* 0xBF811348 */
  .extern DCS3CPTRSET      /* 0xBF811348 */
  .extern DCH3CPTRINV      /* 0xBF81134C */
  .extern DCS3CPTRINV      /* 0xBF81134C */
  .extern DCH3DAT          /* 0xBF811350 */
  .extern DCH3DATCLR       /* 0xBF811354 */
  .extern DCH3DATSET       /* 0xBF811358 */
  .extern DCH3DATINV       /* 0xBF81135C */
  .extern DCH4CON          /* 0xBF811360 */
  .extern DCH4CONCLR       /* 0xBF811364 */
  .extern DCH4CONSET       /* 0xBF811368 */
  .extern DCH4CONINV       /* 0xBF81136C */
  .extern DCH4ECON         /* 0xBF811370 */
  .extern DCH4ECONCLR      /* 0xBF811374 */
  .extern DCH4ECONSET      /* 0xBF811378 */
  .extern DCH4ECONINV      /* 0xBF81137C */
  .extern DCH4INT          /* 0xBF811380 */
  .extern DCH4INTCLR       /* 0xBF811384 */
  .extern DCH4INTSET       /* 0xBF811388 */
  .extern DCH4INTINV       /* 0xBF81138C */
  .extern DCH4SSA          /* 0xBF811390 */
  .extern DCH4SSACLR       /* 0xBF811394 */
  .extern DCH4SSASET       /* 0xBF811398 */
  .extern DCH4SSAINV       /* 0xBF81139C */
  .extern DCH4DSA          /* 0xBF8113A0 */
  .extern DCH4DSACLR       /* 0xBF8113A4 */
  .extern DCH4DSASET       /* 0xBF8113A8 */
  .extern DCH4DSAINV       /* 0xBF8113AC */
  .extern DCH4SSIZ         /* 0xBF8113B0 */
  .extern DCH4SSIZCLR      /* 0xBF8113B4 */
  .extern DCH4SSIZSET      /* 0xBF8113B8 */
  .extern DCH4SSIZINV      /* 0xBF8113BC */
  .extern DCH4DSIZ         /* 0xBF8113C0 */
  .extern DCH4DSIZCLR      /* 0xBF8113C4 */
  .extern DCH4DSIZSET      /* 0xBF8113C8 */
  .extern DCH4DSIZINV      /* 0xBF8113CC */
  .extern DCH4SPTR         /* 0xBF8113D0 */
  .extern DCH4SPTRCLR      /* 0xBF8113D4 */
  .extern DCH4SPTRSET      /* 0xBF8113D8 */
  .extern DCH4SPTRINV      /* 0xBF8113DC */
  .extern DCH4DPTR         /* 0xBF8113E0 */
  .extern DCH4DPTRCLR      /* 0xBF8113E4 */
  .extern DCH4DPTRSET      /* 0xBF8113E8 */
  .extern DCH4DPTRINV      /* 0xBF8113EC */
  .extern DCH4CSIZ         /* 0xBF8113F0 */
  .extern DCH4CSIZCLR      /* 0xBF8113F4 */
  .extern DCH4CSIZSET      /* 0xBF8113F8 */
  .extern DCH4CSIZINV      /* 0xBF8113FC */
  .extern DCH4CPTR         /* 0xBF811400 */
  .extern DCS4CPTR         /* 0xBF811400 */
  .extern DCH4CPTRCLR      /* 0xBF811404 */
  .extern DCS4CPTRCLR      /* 0xBF811404 */
  .extern DCH4CPTRSET      /* 0xBF811408 */
  .extern DCS4CPTRSET      /* 0xBF811408 */
  .extern DCH4CPTRINV      /* 0xBF81140C */
  .extern DCS4CPTRINV      /* 0xBF81140C */
  .extern DCH4DAT          /* 0xBF811410 */
  .extern DCH4DATCLR       /* 0xBF811414 */
  .extern DCH4DATSET       /* 0xBF811418 */
  .extern DCH4DATINV       /* 0xBF81141C */
  .extern DCH5CON          /* 0xBF811420 */
  .extern DCH5CONCLR       /* 0xBF811424 */
  .extern DCH5CONSET       /* 0xBF811428 */
  .extern DCH5CONINV       /* 0xBF81142C */
  .extern DCH5ECON         /* 0xBF811430 */
  .extern DCH5ECONCLR      /* 0xBF811434 */
  .extern DCH5ECONSET      /* 0xBF811438 */
  .extern DCH5ECONINV      /* 0xBF81143C */
  .extern DCH5INT          /* 0xBF811440 */
  .extern DCH5INTCLR       /* 0xBF811444 */
  .extern DCH5INTSET       /* 0xBF811448 */
  .extern DCH5INTINV       /* 0xBF81144C */
  .extern DCH5SSA          /* 0xBF811450 */
  .extern DCH5SSACLR       /* 0xBF811454 */
  .extern DCH5SSASET       /* 0xBF811458 */
  .extern DCH5SSAINV       /* 0xBF81145C */
  .extern DCH5DSA          /* 0xBF811460 */
  .extern DCH5DSACLR       /* 0xBF811464 */
  .extern DCH5DSASET       /* 0xBF811468 */
  .extern DCH5DSAINV       /* 0xBF81146C */
  .extern DCH5SSIZ         /* 0xBF811470 */
  .extern DCH5SSIZCLR      /* 0xBF811474 */
  .extern DCH5SSIZSET      /* 0xBF811478 */
  .extern DCH5SSIZINV      /* 0xBF81147C */
  .extern DCH5DSIZ         /* 0xBF811480 */
  .extern DCH5DSIZCLR      /* 0xBF811484 */
  .extern DCH5DSIZSET      /* 0xBF811488 */
  .extern DCH5DSIZINV      /* 0xBF81148C */
  .extern DCH5SPTR         /* 0xBF811490 */
  .extern DCH5SPTRCLR      /* 0xBF811494 */
  .extern DCH5SPTRSET      /* 0xBF811498 */
  .extern DCH5SPTRINV      /* 0xBF81149C */
  .extern DCH5DPTR         /* 0xBF8114A0 */
  .extern DCH5DPTRCLR      /* 0xBF8114A4 */
  .extern DCH5DPTRSET      /* 0xBF8114A8 */
  .extern DCH5DPTRINV      /* 0xBF8114AC */
  .extern DCH5CSIZ         /* 0xBF8114B0 */
  .extern DCH5CSIZCLR      /* 0xBF8114B4 */
  .extern DCH5CSIZSET      /* 0xBF8114B8 */
  .extern DCH5CSIZINV      /* 0xBF8114BC */
  .extern DCH5CPTR         /* 0xBF8114C0 */
  .extern DCS5CPTR         /* 0xBF8114C0 */
  .extern DCH5CPTRCLR      /* 0xBF8114C4 */
  .extern DCS5CPTRCLR      /* 0xBF8114C4 */
  .extern DCH5CPTRSET      /* 0xBF8114C8 */
  .extern DCS5CPTRSET      /* 0xBF8114C8 */
  .extern DCH5CPTRINV      /* 0xBF8114CC */
  .extern DCS5CPTRINV      /* 0xBF8114CC */
  .extern DCH5DAT          /* 0xBF8114D0 */
  .extern DCH5DATCLR       /* 0xBF8114D4 */
  .extern DCH5DATSET       /* 0xBF8114D8 */
  .extern DCH5DATINV       /* 0xBF8114DC */
  .extern DCH6CON          /* 0xBF8114E0 */
  .extern DCH6CONCLR       /* 0xBF8114E4 */
  .extern DCH6CONSET       /* 0xBF8114E8 */
  .extern DCH6CONINV       /* 0xBF8114EC */
  .extern DCH6ECON         /* 0xBF8114F0 */
  .extern DCH6ECONCLR      /* 0xBF8114F4 */
  .extern DCH6ECONSET      /* 0xBF8114F8 */
  .extern DCH6ECONINV      /* 0xBF8114FC */
  .extern DCH6INT          /* 0xBF811500 */
  .extern DCH6INTCLR       /* 0xBF811504 */
  .extern DCH6INTSET       /* 0xBF811508 */
  .extern DCH6INTINV       /* 0xBF81150C */
  .extern DCH6SSA          /* 0xBF811510 */
  .extern DCH6SSACLR       /* 0xBF811514 */
  .extern DCH6SSASET       /* 0xBF811518 */
  .extern DCH6SSAINV       /* 0xBF81151C */
  .extern DCH6DSA          /* 0xBF811520 */
  .extern DCH6DSACLR       /* 0xBF811524 */
  .extern DCH6DSASET       /* 0xBF811528 */
  .extern DCH6DSAINV       /* 0xBF81152C */
  .extern DCH6SSIZ         /* 0xBF811530 */
  .extern DCH6SSIZCLR      /* 0xBF811534 */
  .extern DCH6SSIZSET      /* 0xBF811538 */
  .extern DCH6SSIZINV      /* 0xBF81153C */
  .extern DCH6DSIZ         /* 0xBF811540 */
  .extern DCH6DSIZCLR      /* 0xBF811544 */
  .extern DCH6DSIZSET      /* 0xBF811548 */
  .extern DCH6DSIZINV      /* 0xBF81154C */
  .extern DCH6SPTR         /* 0xBF811550 */
  .extern DCH6SPTRCLR      /* 0xBF811554 */
  .extern DCH6SPTRSET      /* 0xBF811558 */
  .extern DCH6SPTRINV      /* 0xBF81155C */
  .extern DCH6DPTR         /* 0xBF811560 */
  .extern DCH6DPTRCLR      /* 0xBF811564 */
  .extern DCH6DPTRSET      /* 0xBF811568 */
  .extern DCH6DPTRINV      /* 0xBF81156C */
  .extern DCH6CSIZ         /* 0xBF811570 */
  .extern DCH6CSIZCLR      /* 0xBF811574 */
  .extern DCH6CSIZSET      /* 0xBF811578 */
  .extern DCH6CSIZINV      /* 0xBF81157C */
  .extern DCH6CPTR         /* 0xBF811580 */
  .extern DCS6CPTR         /* 0xBF811580 */
  .extern DCH6CPTRCLR      /* 0xBF811584 */
  .extern DCS6CPTRCLR      /* 0xBF811584 */
  .extern DCH6CPTRSET      /* 0xBF811588 */
  .extern DCS6CPTRSET      /* 0xBF811588 */
  .extern DCH6CPTRINV      /* 0xBF81158C */
  .extern DCS6CPTRINV      /* 0xBF81158C */
  .extern DCH6DAT          /* 0xBF811590 */
  .extern DCH6DATCLR       /* 0xBF811594 */
  .extern DCH6DATSET       /* 0xBF811598 */
  .extern DCH6DATINV       /* 0xBF81159C */
  .extern DCH7CON          /* 0xBF8115A0 */
  .extern DCH7CONCLR       /* 0xBF8115A4 */
  .extern DCH7CONSET       /* 0xBF8115A8 */
  .extern DCH7CONINV       /* 0xBF8115AC */
  .extern DCH7ECON         /* 0xBF8115B0 */
  .extern DCH7ECONCLR      /* 0xBF8115B4 */
  .extern DCH7ECONSET      /* 0xBF8115B8 */
  .extern DCH7ECONINV      /* 0xBF8115BC */
  .extern DCH7INT          /* 0xBF8115C0 */
  .extern DCH7INTCLR       /* 0xBF8115C4 */
  .extern DCH7INTSET       /* 0xBF8115C8 */
  .extern DCH7INTINV       /* 0xBF8115CC */
  .extern DCH7SSA          /* 0xBF8115D0 */
  .extern DCH7SSACLR       /* 0xBF8115D4 */
  .extern DCH7SSASET       /* 0xBF8115D8 */
  .extern DCH7SSAINV       /* 0xBF8115DC */
  .extern DCH7DSA          /* 0xBF8115E0 */
  .extern DCH7DSACLR       /* 0xBF8115E4 */
  .extern DCH7DSASET       /* 0xBF8115E8 */
  .extern DCH7DSAINV       /* 0xBF8115EC */
  .extern DCH7SSIZ         /* 0xBF8115F0 */
  .extern DCH7SSIZCLR      /* 0xBF8115F4 */
  .extern DCH7SSIZSET      /* 0xBF8115F8 */
  .extern DCH7SSIZINV      /* 0xBF8115FC */
  .extern DCH7DSIZ         /* 0xBF811600 */
  .extern DCH7DSIZCLR      /* 0xBF811604 */
  .extern DCH7DSIZSET      /* 0xBF811608 */
  .extern DCH7DSIZINV      /* 0xBF81160C */
  .extern DCH7SPTR         /* 0xBF811610 */
  .extern DCH7SPTRCLR      /* 0xBF811614 */
  .extern DCH7SPTRSET      /* 0xBF811618 */
  .extern DCH7SPTRINV      /* 0xBF81161C */
  .extern DCH7DPTR         /* 0xBF811620 */
  .extern DCH7DPTRCLR      /* 0xBF811624 */
  .extern DCH7DPTRSET      /* 0xBF811628 */
  .extern DCH7DPTRINV      /* 0xBF81162C */
  .extern DCH7CSIZ         /* 0xBF811630 */
  .extern DCH7CSIZCLR      /* 0xBF811634 */
  .extern DCH7CSIZSET      /* 0xBF811638 */
  .extern DCH7CSIZINV      /* 0xBF81163C */
  .extern DCH7CPTR         /* 0xBF811640 */
  .extern DCS7CPTR         /* 0xBF811640 */
  .extern DCH7CPTRCLR      /* 0xBF811644 */
  .extern DCS7CPTRCLR      /* 0xBF811644 */
  .extern DCH7CPTRSET      /* 0xBF811648 */
  .extern DCS7CPTRSET      /* 0xBF811648 */
  .extern DCH7CPTRINV      /* 0xBF81164C */
  .extern DCS7CPTRINV      /* 0xBF81164C */
  .extern DCH7DAT          /* 0xBF811650 */
  .extern DCH7DATCLR       /* 0xBF811654 */
  .extern DCH7DATSET       /* 0xBF811658 */
  .extern DCH7DATINV       /* 0xBF81165C */
  .extern _ICDCON          /* 0xBF812000 */
  .extern _ICDSTAT         /* 0xBF812010 */
  .extern PRECON           /* 0xBF812400 */
  .extern PRECONCLR        /* 0xBF812404 */
  .extern PRECONSET        /* 0xBF812408 */
  .extern PRECONINV        /* 0xBF81240C */
  .extern PRESTAT          /* 0xBF812410 */
  .extern PREHIT           /* 0xBF812420 */
  .extern PREMIS           /* 0xBF812430 */
  .extern PMUSPICTRL       /* 0xBF813E00 */
  .extern PMUSPISTAT       /* 0xBF813E04 */
  .extern PMUCLKCTRL       /* 0xBF813E08 */
  .extern PMUMODECTRL1     /* 0xBF813E0C */
  .extern PMUMODECTRL2     /* 0xBF813E10 */
  .extern PMUMODECTRL3     /* 0xBF813E14 */
  .extern PMUMODECTRL4     /* 0xBF813E18 */
  .extern PMUOVERCTRL      /* 0xBF813E1C */
  .extern PMUCMODE         /* 0xBF813E20 */
  .extern PMUSTATUS        /* 0xBF813E24 */
  .extern PMUSEQ1          /* 0xBF813E28 */
  .extern PMUSEQ2          /* 0xBF813E2C */
  .extern PMUSEQ3          /* 0xBF813E30 */
  .extern PMUSEQ4          /* 0xBF813E34 */
  .extern PMUCFG           /* 0xBF813E38 */
  .extern PMUWCMCMD        /* 0xBF813E3C */
  .extern PMUWCMWDATA      /* 0xBF813E40 */
  .extern PMUWCMRDATA      /* 0xBF813E44 */
  .extern PMUVBCCMD        /* 0xBF813E48 */
  .extern PMUVCBWDATA      /* 0xBF813E4C */
  .extern PMUVCBRDATA      /* 0xBF813E50 */
  .extern WCMCFG           /* 0xBF813E54 */
  .extern PMUIENB          /* 0xBF813E58 */
  .extern PMUISTAT         /* 0xBF813E5C */
  .extern WCMSIZ           /* 0xBF813E60 */
  .extern PMUWCM           /* 0xBF814000 */
  .extern ANSELA           /* 0xBF820000 */
  .extern ANSELACLR        /* 0xBF820004 */
  .extern ANSELASET        /* 0xBF820008 */
  .extern ANSELAINV        /* 0xBF82000C */
  .extern TRISA            /* 0xBF820010 */
  .extern TRISACLR         /* 0xBF820014 */
  .extern TRISASET         /* 0xBF820018 */
  .extern TRISAINV         /* 0xBF82001C */
  .extern PORTA            /* 0xBF820020 */
  .extern PORTACLR         /* 0xBF820024 */
  .extern PORTASET         /* 0xBF820028 */
  .extern PORTAINV         /* 0xBF82002C */
  .extern LATA             /* 0xBF820030 */
  .extern LATACLR          /* 0xBF820034 */
  .extern LATASET          /* 0xBF820038 */
  .extern LATAINV          /* 0xBF82003C */
  .extern ODCA             /* 0xBF820040 */
  .extern ODCACLR          /* 0xBF820044 */
  .extern ODCASET          /* 0xBF820048 */
  .extern ODCAINV          /* 0xBF82004C */
  .extern CNPUA            /* 0xBF820050 */
  .extern CNPUACLR         /* 0xBF820054 */
  .extern CNPUASET         /* 0xBF820058 */
  .extern CNPUAINV         /* 0xBF82005C */
  .extern CNPDA            /* 0xBF820060 */
  .extern CNPDACLR         /* 0xBF820064 */
  .extern CNPDASET         /* 0xBF820068 */
  .extern CNPDAINV         /* 0xBF82006C */
  .extern CNCONA           /* 0xBF820070 */
  .extern CNCONACLR        /* 0xBF820074 */
  .extern CNCONASET        /* 0xBF820078 */
  .extern CNCONAINV        /* 0xBF82007C */
  .extern CNENA            /* 0xBF820080 */
  .extern CNENACLR         /* 0xBF820084 */
  .extern CNENASET         /* 0xBF820088 */
  .extern CNENAINV         /* 0xBF82008C */
  .extern CNSTATA          /* 0xBF820090 */
  .extern CNSTATACLR       /* 0xBF820094 */
  .extern CNSTATASET       /* 0xBF820098 */
  .extern CNSTATAINV       /* 0xBF82009C */
  .extern CNNEA            /* 0xBF8200A0 */
  .extern CNNEACLR         /* 0xBF8200A4 */
  .extern CNNEASET         /* 0xBF8200A8 */
  .extern CNNEAINV         /* 0xBF8200AC */
  .extern CNFA             /* 0xBF8200B0 */
  .extern CNFACLR          /* 0xBF8200B4 */
  .extern CNFASET          /* 0xBF8200B8 */
  .extern CNFAINV          /* 0xBF8200BC */
  .extern SRCON0A          /* 0xBF8200C0 */
  .extern SRCON0ACLR       /* 0xBF8200C4 */
  .extern SRCON0ASET       /* 0xBF8200C8 */
  .extern SRCON0AINV       /* 0xBF8200CC */
  .extern SRCON1A          /* 0xBF8200D0 */
  .extern SRCON1ACLR       /* 0xBF8200D4 */
  .extern SRCON1ASET       /* 0xBF8200D8 */
  .extern SRCON1AINV       /* 0xBF8200DC */
  .extern ANSELB           /* 0xBF820100 */
  .extern ANSELBCLR        /* 0xBF820104 */
  .extern ANSELBSET        /* 0xBF820108 */
  .extern ANSELBINV        /* 0xBF82010C */
  .extern TRISB            /* 0xBF820110 */
  .extern TRISBCLR         /* 0xBF820114 */
  .extern TRISBSET         /* 0xBF820118 */
  .extern TRISBINV         /* 0xBF82011C */
  .extern PORTB            /* 0xBF820120 */
  .extern PORTBCLR         /* 0xBF820124 */
  .extern PORTBSET         /* 0xBF820128 */
  .extern PORTBINV         /* 0xBF82012C */
  .extern LATB             /* 0xBF820130 */
  .extern LATBCLR          /* 0xBF820134 */
  .extern LATBSET          /* 0xBF820138 */
  .extern LATBINV          /* 0xBF82013C */
  .extern ODCB             /* 0xBF820140 */
  .extern ODCBCLR          /* 0xBF820144 */
  .extern ODCBSET          /* 0xBF820148 */
  .extern ODCBINV          /* 0xBF82014C */
  .extern CNPUB            /* 0xBF820150 */
  .extern CNPUBCLR         /* 0xBF820154 */
  .extern CNPUBSET         /* 0xBF820158 */
  .extern CNPUBINV         /* 0xBF82015C */
  .extern CNPDB            /* 0xBF820160 */
  .extern CNPDBCLR         /* 0xBF820164 */
  .extern CNPDBSET         /* 0xBF820168 */
  .extern CNPDBINV         /* 0xBF82016C */
  .extern CNCONB           /* 0xBF820170 */
  .extern CNCONBCLR        /* 0xBF820174 */
  .extern CNCONBSET        /* 0xBF820178 */
  .extern CNCONBINV        /* 0xBF82017C */
  .extern CNENB            /* 0xBF820180 */
  .extern CNENBCLR         /* 0xBF820184 */
  .extern CNENBSET         /* 0xBF820188 */
  .extern CNENBINV         /* 0xBF82018C */
  .extern CNSTATB          /* 0xBF820190 */
  .extern CNSTATBCLR       /* 0xBF820194 */
  .extern CNSTATBSET       /* 0xBF820198 */
  .extern CNSTATBINV       /* 0xBF82019C */
  .extern CNNEB            /* 0xBF8201A0 */
  .extern CNNEBCLR         /* 0xBF8201A4 */
  .extern CNNEBSET         /* 0xBF8201A8 */
  .extern CNNEBINV         /* 0xBF8201AC */
  .extern CNFB             /* 0xBF8201B0 */
  .extern CNFBCLR          /* 0xBF8201B4 */
  .extern CNFBSET          /* 0xBF8201B8 */
  .extern CNFBINV          /* 0xBF8201BC */
  .extern TRISC            /* 0xBF820210 */
  .extern TRISCCLR         /* 0xBF820214 */
  .extern TRISCSET         /* 0xBF820218 */
  .extern TRISCINV         /* 0xBF82021C */
  .extern PORTC            /* 0xBF820220 */
  .extern PORTCCLR         /* 0xBF820224 */
  .extern PORTCSET         /* 0xBF820228 */
  .extern PORTCINV         /* 0xBF82022C */
  .extern LATC             /* 0xBF820230 */
  .extern LATCCLR          /* 0xBF820234 */
  .extern LATCSET          /* 0xBF820238 */
  .extern LATCINV          /* 0xBF82023C */
  .extern ODCC             /* 0xBF820240 */
  .extern ODCCCLR          /* 0xBF820244 */
  .extern ODCCSET          /* 0xBF820248 */
  .extern ODCCINV          /* 0xBF82024C */
  .extern CNPUC            /* 0xBF820250 */
  .extern CNPUCCLR         /* 0xBF820254 */
  .extern CNPUCSET         /* 0xBF820258 */
  .extern CNPUCINV         /* 0xBF82025C */
  .extern CNPDC            /* 0xBF820260 */
  .extern CNPDCCLR         /* 0xBF820264 */
  .extern CNPDCSET         /* 0xBF820268 */
  .extern CNPDCINV         /* 0xBF82026C */
  .extern CNCONC           /* 0xBF820270 */
  .extern CNCONCCLR        /* 0xBF820274 */
  .extern CNCONCSET        /* 0xBF820278 */
  .extern CNCONCINV        /* 0xBF82027C */
  .extern CNENC            /* 0xBF820280 */
  .extern CNENCCLR         /* 0xBF820284 */
  .extern CNENCSET         /* 0xBF820288 */
  .extern CNENCINV         /* 0xBF82028C */
  .extern CNSTATC          /* 0xBF820290 */
  .extern CNSTATCCLR       /* 0xBF820294 */
  .extern CNSTATCSET       /* 0xBF820298 */
  .extern CNSTATCINV       /* 0xBF82029C */
  .extern CNNEC            /* 0xBF8202A0 */
  .extern CNNECCLR         /* 0xBF8202A4 */
  .extern CNNECSET         /* 0xBF8202A8 */
  .extern CNNECINV         /* 0xBF8202AC */
  .extern CNFC             /* 0xBF8202B0 */
  .extern CNFCCLR          /* 0xBF8202B4 */
  .extern CNFCSET          /* 0xBF8202B8 */
  .extern CNFCINV          /* 0xBF8202BC */
  .extern SRCON0C          /* 0xBF8202C0 */
  .extern SRCON0CCLR       /* 0xBF8202C4 */
  .extern SRCON0CSET       /* 0xBF8202C8 */
  .extern SRCON0CINV       /* 0xBF8202CC */
  .extern SRCON1C          /* 0xBF8202D0 */
  .extern SRCON1CCLR       /* 0xBF8202D4 */
  .extern SRCON1CSET       /* 0xBF8202D8 */
  .extern SRCON1CINV       /* 0xBF8202DC */
  .extern ANSELK           /* 0xBF820300 */
  .extern ANSELKCLR        /* 0xBF820304 */
  .extern ANSELKSET        /* 0xBF820308 */
  .extern ANSELKINV        /* 0xBF82030C */
  .extern TRISK            /* 0xBF820310 */
  .extern TRISKCLR         /* 0xBF820314 */
  .extern TRISKSET         /* 0xBF820318 */
  .extern TRISKINV         /* 0xBF82031C */
  .extern PORTK            /* 0xBF820320 */
  .extern PORTKCLR         /* 0xBF820324 */
  .extern PORTKSET         /* 0xBF820328 */
  .extern PORTKINV         /* 0xBF82032C */
  .extern LATK             /* 0xBF820330 */
  .extern LATKCLR          /* 0xBF820334 */
  .extern LATKSET          /* 0xBF820338 */
  .extern LATKINV          /* 0xBF82033C */
  .extern ODCK             /* 0xBF820340 */
  .extern ODCKCLR          /* 0xBF820344 */
  .extern ODCKSET          /* 0xBF820348 */
  .extern ODCKINV          /* 0xBF82034C */
  .extern CNPUK            /* 0xBF820350 */
  .extern CNPUKCLR         /* 0xBF820354 */
  .extern CNPUKSET         /* 0xBF820358 */
  .extern CNPUKINV         /* 0xBF82035C */
  .extern CNPDK            /* 0xBF820360 */
  .extern CNPDKCLR         /* 0xBF820364 */
  .extern CNPDKSET         /* 0xBF820368 */
  .extern CNPDKINV         /* 0xBF82036C */
  .extern CNCONK           /* 0xBF820370 */
  .extern CNCONKCLR        /* 0xBF820374 */
  .extern CNCONKSET        /* 0xBF820378 */
  .extern CNCONKINV        /* 0xBF82037C */
  .extern CNENK            /* 0xBF820380 */
  .extern CNENKCLR         /* 0xBF820384 */
  .extern CNENKSET         /* 0xBF820388 */
  .extern CNENKINV         /* 0xBF82038C */
  .extern CNSTATK          /* 0xBF820390 */
  .extern CNSTATKCLR       /* 0xBF820394 */
  .extern CNSTATKSET       /* 0xBF820398 */
  .extern CNSTATKINV       /* 0xBF82039C */
  .extern CNNEK            /* 0xBF8203A0 */
  .extern CNNEKCLR         /* 0xBF8203A4 */
  .extern CNNEKSET         /* 0xBF8203A8 */
  .extern CNNEKINV         /* 0xBF8203AC */
  .extern CNFK             /* 0xBF8203B0 */
  .extern CNFKCLR          /* 0xBF8203B4 */
  .extern CNFKSET          /* 0xBF8203B8 */
  .extern CNFKINV          /* 0xBF8203BC */
  .extern SRCON0K          /* 0xBF8203C0 */
  .extern SRCON0KCLR       /* 0xBF8203C4 */
  .extern SRCON0KSET       /* 0xBF8203C8 */
  .extern SRCON0KINV       /* 0xBF8203CC */
  .extern SRCON1K          /* 0xBF8203D0 */
  .extern SRCON1KCLR       /* 0xBF8203D4 */
  .extern SRCON1KSET       /* 0xBF8203D8 */
  .extern SRCON1KINV       /* 0xBF8203DC */
  .extern I2C1CON          /* 0xBF820400 */
  .extern I2C1CONCLR       /* 0xBF820404 */
  .extern I2C1CONSET       /* 0xBF820408 */
  .extern I2C1CONINV       /* 0xBF82040C */
  .extern I2C1STAT         /* 0xBF820410 */
  .extern I2C1STATCLR      /* 0xBF820414 */
  .extern I2C1STATSET      /* 0xBF820418 */
