Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
  .extern I2C1STATINV      /* 0xBF82041C */
  .extern I2C1ADD          /* 0xBF820420 */
  .extern I2C1ADDCLR       /* 0xBF820424 */
  .extern I2C1ADDSET       /* 0xBF820428 */
  .extern I2C1ADDINV       /* 0xBF82042C */
  .extern I2C1MSK          /* 0xBF820430 */
  .extern I2C1MSKCLR       /* 0xBF820434 */
  .extern I2C1MSKSET       /* 0xBF820438 */
  .extern I2C1MSKINV       /* 0xBF82043C */
  .extern I2C1BRG          /* 0xBF820440 */
  .extern I2C1BRGCLR       /* 0xBF820444 */
  .extern I2C1BRGSET       /* 0xBF820448 */
  .extern I2C1BRGINV       /* 0xBF82044C */
  .extern I2C1TRN          /* 0xBF820450 */
  .extern I2C1TRNCLR       /* 0xBF820454 */
  .extern I2C1TRNSET       /* 0xBF820458 */
  .extern I2C1TRNINV       /* 0xBF82045C */
  .extern I2C1RCV          /* 0xBF820460 */
  .extern I2C1RCVCLR       /* 0xBF820464 */
  .extern I2C1RCVSET       /* 0xBF820468 */
  .extern I2C1RCVINV       /* 0xBF82046C */
  .extern ADCCON1          /* 0xBF821000 */
  .extern ADCCON1CLR       /* 0xBF821004 */
  .extern ADCCON1SET       /* 0xBF821008 */
  .extern ADCCON1INV       /* 0xBF82100C */
  .extern ADCCON2          /* 0xBF821010 */
  .extern ADCCON2CLR       /* 0xBF821014 */
  .extern ADCCON2SET       /* 0xBF821018 */
  .extern ADCCON2INV       /* 0xBF82101C */
  .extern ADCCON3          /* 0xBF821020 */
  .extern ADCCON3CLR       /* 0xBF821024 */
  .extern ADCCON3SET       /* 0xBF821028 */
  .extern ADCCON3INV       /* 0xBF82102C */
  .extern ADCTRGMODE       /* 0xBF821030 */
  .extern ADCTRGMODECLR    /* 0xBF821034 */
  .extern ADCTRGMODESET    /* 0xBF821038 */
  .extern ADCTRGMODEINV    /* 0xBF82103C */
  .extern ADCIMCON1        /* 0xBF821040 */
  .extern ADCIMCON1CLR     /* 0xBF821044 */
  .extern ADCIMCON1SET     /* 0xBF821048 */
  .extern ADCIMCON1INV     /* 0xBF82104C */
  .extern ADCIMCON2        /* 0xBF821050 */
  .extern ADCIMCON2CLR     /* 0xBF821054 */
  .extern ADCIMCON2SET     /* 0xBF821058 */
  .extern ADCIMCON2INV     /* 0xBF82105C */
  .extern ADCGIRQEN1       /* 0xBF821080 */
  .extern ADCGIRQEN1CLR    /* 0xBF821084 */
  .extern ADCGIRQEN1SET    /* 0xBF821088 */
  .extern ADCGIRQEN1INV    /* 0xBF82108C */
  .extern ADCCSS1          /* 0xBF8210A0 */
  .extern ADCCSS1CLR       /* 0xBF8210A4 */
  .extern ADCCSS1SET       /* 0xBF8210A8 */
  .extern ADCCSS1INV       /* 0xBF8210AC */
  .extern ADCDSTAT1        /* 0xBF8210C0 */
  .extern ADCDSTAT1CLR     /* 0xBF8210C4 */
  .extern ADCDSTAT1SET     /* 0xBF8210C8 */
  .extern ADCDSTAT1INV     /* 0xBF8210CC */
  .extern ADCCMPEN1        /* 0xBF8210E0 */
  .extern ADCCMPEN1CLR     /* 0xBF8210E4 */
  .extern ADCCMPEN1SET     /* 0xBF8210E8 */
  .extern ADCCMPEN1INV     /* 0xBF8210EC */
  .extern ADCCMP1          /* 0xBF8210F0 */
  .extern ADCCMP1CLR       /* 0xBF8210F4 */
  .extern ADCCMP1SET       /* 0xBF8210F8 */
  .extern ADCCMP1INV       /* 0xBF8210FC */
  .extern ADCCMPEN2        /* 0xBF821100 */
  .extern ADCCMPEN2CLR     /* 0xBF821104 */
  .extern ADCCMPEN2SET     /* 0xBF821108 */
  .extern ADCCMPEN2INV     /* 0xBF82110C */
  .extern ADCCMP2          /* 0xBF821110 */
  .extern ADCCMP2CLR       /* 0xBF821114 */
  .extern ADCCMP2SET       /* 0xBF821118 */
  .extern ADCCMP2INV       /* 0xBF82111C */
  .extern ADCFLTR1         /* 0xBF8211A0 */
  .extern ADCFLTR1CLR      /* 0xBF8211A4 */
  .extern ADCFLTR1SET      /* 0xBF8211A8 */
  .extern ADCFLTR1INV      /* 0xBF8211AC */
  .extern ADCFLTR2         /* 0xBF8211B0 */
  .extern ADCFLTR2CLR      /* 0xBF8211B4 */
  .extern ADCFLTR2SET      /* 0xBF8211B8 */
  .extern ADCFLTR2INV      /* 0xBF8211BC */
  .extern ADCTRG1          /* 0xBF821200 */
  .extern ADCTRG1CLR       /* 0xBF821204 */
  .extern ADCTRG1SET       /* 0xBF821208 */
  .extern ADCTRG1INV       /* 0xBF82120C */
  .extern ADCTRG2          /* 0xBF821210 */
  .extern ADCTRG2CLR       /* 0xBF821214 */
  .extern ADCTRG2SET       /* 0xBF821218 */
  .extern ADCTRG2INV       /* 0xBF82121C */
  .extern ADCCMPCON1       /* 0xBF821280 */
  .extern ADCCMPCON1CLR    /* 0xBF821284 */
  .extern ADCCMPCON1SET    /* 0xBF821288 */
  .extern ADCCMPCON1INV    /* 0xBF82128C */
  .extern ADCCMPCON2       /* 0xBF821290 */
  .extern ADCCMPCON2CLR    /* 0xBF821294 */
  .extern ADCCMPCON2SET    /* 0xBF821298 */
  .extern ADCCMPCON2INV    /* 0xBF82129C */
  .extern ADCFSTAT         /* 0xBF8212E0 */
  .extern ADCFSTATCLR      /* 0xBF8212E4 */
  .extern ADCFSTATSET      /* 0xBF8212E8 */
  .extern ADCFSTATINV      /* 0xBF8212EC */
  .extern ADCFIFO          /* 0xBF8212F0 */
  .extern ADCFIFOCLR       /* 0xBF8212F4 */
  .extern ADCFIFOSET       /* 0xBF8212F8 */
  .extern ADCFIFOINV       /* 0xBF8212FC */
  .extern ADCBASE          /* 0xBF821300 */
  .extern ADCBASECLR       /* 0xBF821304 */
  .extern ADCBASESET       /* 0xBF821308 */
  .extern ADCBASEINV       /* 0xBF82130C */
  .extern ADCDMAST         /* 0xBF821310 */
  .extern ADCDMASTCLR      /* 0xBF821314 */
  .extern ADCDMASTSET      /* 0xBF821318 */
  .extern ADCDMASTINV      /* 0xBF82131C */
  .extern ADCCNTB          /* 0xBF821320 */
  .extern ADCCNTBCLR       /* 0xBF821324 */
  .extern ADCCNTBSET       /* 0xBF821328 */
  .extern ADCCNTBINV       /* 0xBF82132C */
  .extern ADCDMAB          /* 0xBF821330 */
  .extern ADCDMABCLR       /* 0xBF821334 */
  .extern ADCDMABSET       /* 0xBF821338 */
  .extern ADCDMABINV       /* 0xBF82133C */
  .extern ADCTRGSNS        /* 0xBF821340 */
  .extern ADCTRGSNSCLR     /* 0xBF821344 */
  .extern ADCTRGSNSSET     /* 0xBF821348 */
  .extern ADCTRGSNSINV     /* 0xBF82134C */
  .extern ADC0TIME         /* 0xBF821350 */
  .extern ADC0TIMECLR      /* 0xBF821354 */
  .extern ADC0TIMESET      /* 0xBF821358 */
  .extern ADC0TIMEINV      /* 0xBF82135C */
  .extern ADCANCON         /* 0xBF821400 */
  .extern ADCANCONCLR      /* 0xBF821404 */
  .extern ADCANCONSET      /* 0xBF821408 */
  .extern ADCANCONINV      /* 0xBF82140C */
  .extern ADC0CFG          /* 0xBF821600 */
  .extern ADC0CFGCLR       /* 0xBF821604 */
  .extern ADC0CFGSET       /* 0xBF821608 */
  .extern ADC0CFGINV       /* 0xBF82160C */
  .extern ADC7CFG          /* 0xBF821670 */
  .extern ADC7CFGCLR       /* 0xBF821674 */
  .extern ADC7CFGSET       /* 0xBF821678 */
  .extern ADC7CFGINV       /* 0xBF82167C */
  .extern ADCSYSCFG0       /* 0xBF821700 */
  .extern ADCSYSCFG0CLR    /* 0xBF821704 */
  .extern ADCSYSCFG0SET    /* 0xBF821708 */
  .extern ADCSYSCFG0INV    /* 0xBF82170C */
  .extern ADCDATA0         /* 0xBF821A00 */
  .extern ADCDATA1         /* 0xBF821A10 */
  .extern ADCDATA2         /* 0xBF821A20 */
  .extern ADCDATA3         /* 0xBF821A30 */
  .extern ADCDATA4         /* 0xBF821A40 */
  .extern ADCDATA5         /* 0xBF821A50 */
  .extern ADCDATA6         /* 0xBF821A60 */
  .extern ADCDATA7         /* 0xBF821A70 */
  .extern ADCDATA8         /* 0xBF821A80 */
  .extern ADCDATA9         /* 0xBF821A90 */
  .extern ADCDATA10        /* 0xBF821AA0 */
  .extern ADCDATA11        /* 0xBF821AB0 */
  .extern ADCDATA12        /* 0xBF821AC0 */
  .extern ADCDATA13        /* 0xBF821AD0 */
  .extern ADCDATA14        /* 0xBF821AE0 */
  .extern ADCDATA15        /* 0xBF821AF0 */
  .extern ADCDATA16        /* 0xBF821B00 */
  .extern ADCDATA17        /* 0xBF821B10 */
  .extern ADCDATA18        /* 0xBF821B20 */
  .extern ADCDATA19        /* 0xBF821B30 */
  .extern ADCDATA20        /* 0xBF821B40 */
  .extern ADCDATA21        /* 0xBF821B50 */
  .extern ADCDATA22        /* 0xBF821B60 */
  .extern ADCDATA23        /* 0xBF821B70 */
  .extern C1CON            /* 0xBF822000 */
  .extern C1CONCLR         /* 0xBF822004 */
  .extern C1CONSET         /* 0xBF822008 */
  .extern C1CONINV         /* 0xBF82200C */
  .extern C1CFG            /* 0xBF822010 */
  .extern C1CFGCLR         /* 0xBF822014 */
  .extern C1CFGSET         /* 0xBF822018 */
  .extern C1CFGINV         /* 0xBF82201C */
  .extern C1INT            /* 0xBF822020 */
  .extern C1INTCLR         /* 0xBF822024 */
  .extern C1INTSET         /* 0xBF822028 */
  .extern C1INTINV         /* 0xBF82202C */
  .extern C1VEC            /* 0xBF822030 */
  .extern C1VECCLR         /* 0xBF822034 */
  .extern C1VECSET         /* 0xBF822038 */
  .extern C1VECINV         /* 0xBF82203C */
  .extern C1TREC           /* 0xBF822040 */
  .extern C1TRECCLR        /* 0xBF822044 */
  .extern C1TRECSET        /* 0xBF822048 */
  .extern C1TRECINV        /* 0xBF82204C */
  .extern C1FSTAT          /* 0xBF822050 */
  .extern C1FSTATCLR       /* 0xBF822054 */
  .extern C1FSTATSET       /* 0xBF822058 */
  .extern C1FSTATINV       /* 0xBF82205C */
  .extern C1RXOVF          /* 0xBF822060 */
  .extern C1RXOVFCLR       /* 0xBF822064 */
  .extern C1RXOVFSET       /* 0xBF822068 */
  .extern C1RXOVFINV       /* 0xBF82206C */
  .extern C1TMR            /* 0xBF822070 */
  .extern C1TMRCLR         /* 0xBF822074 */
  .extern C1TMRSET         /* 0xBF822078 */
  .extern C1TMRINV         /* 0xBF82207C */
  .extern C1RXM0           /* 0xBF822080 */
  .extern C1RXM0CLR        /* 0xBF822084 */
  .extern C1RXM0SET        /* 0xBF822088 */
  .extern C1RXM0INV        /* 0xBF82208C */
  .extern C1RXM1           /* 0xBF822090 */
  .extern C1RXM1CLR        /* 0xBF822094 */
  .extern C1RXM1SET        /* 0xBF822098 */
  .extern C1RXM1INV        /* 0xBF82209C */
  .extern C1RXM2           /* 0xBF8220A0 */
  .extern C1RXM2CLR        /* 0xBF8220A4 */
  .extern C1RXM2SET        /* 0xBF8220A8 */
  .extern C1RXM2INV        /* 0xBF8220AC */
  .extern C1FLTCON0        /* 0xBF8220C0 */
  .extern C1FLTCON0CLR     /* 0xBF8220C4 */
  .extern C1FLTCON0SET     /* 0xBF8220C8 */
  .extern C1FLTCON0INV     /* 0xBF8220CC */
  .extern C1FLTCON1        /* 0xBF8220D0 */
  .extern C1FLTCON1CLR     /* 0xBF8220D4 */
  .extern C1FLTCON1SET     /* 0xBF8220D8 */
  .extern C1FLTCON1INV     /* 0xBF8220DC */
  .extern C1FLTCON2        /* 0xBF8220E0 */
  .extern C1FLTCON2CLR     /* 0xBF8220E4 */
  .extern C1FLTCON2SET     /* 0xBF8220E8 */
  .extern C1FLTCON2INV     /* 0xBF8220EC */
  .extern C1FLTCON3        /* 0xBF8220F0 */
  .extern C1FLTCON3CLR     /* 0xBF8220F4 */
  .extern C1FLTCON3SET     /* 0xBF8220F8 */
  .extern C1FLTCON3INV     /* 0xBF8220FC */
  .extern C1RXF0           /* 0xBF822140 */
  .extern C1RXF0CLR        /* 0xBF822144 */
  .extern C1RXF0SET        /* 0xBF822148 */
  .extern C1RXF0INV        /* 0xBF82214C */
  .extern C1RXF1           /* 0xBF822150 */
  .extern C1RXF1CLR        /* 0xBF822154 */
  .extern C1RXF1SET        /* 0xBF822158 */
  .extern C1RXF1INV        /* 0xBF82215C */
  .extern C1RXF2           /* 0xBF822160 */
  .extern C1RXF2CLR        /* 0xBF822164 */
  .extern C1RXF2SET        /* 0xBF822168 */
  .extern C1RXF2INV        /* 0xBF82216C */
  .extern C1RXF3           /* 0xBF822170 */
  .extern C1RXF3CLR        /* 0xBF822174 */
  .extern C1RXF3SET        /* 0xBF822178 */
  .extern C1RXF3INV        /* 0xBF82217C */
  .extern C1RXF4           /* 0xBF822180 */
  .extern C1RXF4CLR        /* 0xBF822184 */
  .extern C1RXF4SET        /* 0xBF822188 */
  .extern C1RXF4INV        /* 0xBF82218C */
  .extern C1RXF5           /* 0xBF822190 */
  .extern C1RXF5CLR        /* 0xBF822194 */
  .extern C1RXF5SET        /* 0xBF822198 */
  .extern C1RXF5INV        /* 0xBF82219C */
  .extern C1RXF6           /* 0xBF8221A0 */
  .extern C1RXF6CLR        /* 0xBF8221A4 */
  .extern C1RXF6SET        /* 0xBF8221A8 */
  .extern C1RXF6INV        /* 0xBF8221AC */
  .extern C1RXF7           /* 0xBF8221B0 */
  .extern C1RXF7CLR        /* 0xBF8221B4 */
  .extern C1RXF7SET        /* 0xBF8221B8 */
  .extern C1RXF7INV        /* 0xBF8221BC */
  .extern C1RXF8           /* 0xBF8221C0 */
  .extern C1RXF8CLR        /* 0xBF8221C4 */
  .extern C1RXF8SET        /* 0xBF8221C8 */
  .extern C1RXF8INV        /* 0xBF8221CC */
  .extern C1RXF9           /* 0xBF8221D0 */
  .extern C1RXF9CLR        /* 0xBF8221D4 */
  .extern C1RXF9SET        /* 0xBF8221D8 */
  .extern C1RXF9INV        /* 0xBF8221DC */
  .extern C1RXF10          /* 0xBF8221E0 */
  .extern C1RXF10CLR       /* 0xBF8221E4 */
  .extern C1RXF10SET       /* 0xBF8221E8 */
  .extern C1RXF10INV       /* 0xBF8221EC */
  .extern C1RXF11          /* 0xBF8221F0 */
  .extern C1RXF11CLR       /* 0xBF8221F4 */
  .extern C1RXF11SET       /* 0xBF8221F8 */
  .extern C1RXF11INV       /* 0xBF8221FC */
  .extern C1RXF12          /* 0xBF822200 */
  .extern C1RXF12CLR       /* 0xBF822204 */
  .extern C1RXF12SET       /* 0xBF822208 */
  .extern C1RXF12INV       /* 0xBF82220C */
  .extern C1RXF13          /* 0xBF822210 */
  .extern C1RXF13CLR       /* 0xBF822214 */
  .extern C1RXF13SET       /* 0xBF822218 */
  .extern C1RXF13INV       /* 0xBF82221C */
  .extern C1RXF14          /* 0xBF822220 */
  .extern C1RXF14CLR       /* 0xBF822224 */
  .extern C1RXF14SET       /* 0xBF822228 */
  .extern C1RXF14INV       /* 0xBF82222C */
  .extern C1RXF15          /* 0xBF822230 */
  .extern C1RXF15CLR       /* 0xBF822234 */
  .extern C1RXF15SET       /* 0xBF822238 */
  .extern C1RXF15INV       /* 0xBF82223C */
  .extern C1FIFOBA         /* 0xBF822340 */
  .extern C1FIFOBACLR      /* 0xBF822344 */
  .extern C1FIFOBASET      /* 0xBF822348 */
  .extern C1FIFOBAINV      /* 0xBF82234C */
  .extern C1FIFOCON0       /* 0xBF822350 */
  .extern C1FIFOCON0CLR    /* 0xBF822354 */
  .extern C1FIFOCON0SET    /* 0xBF822358 */
  .extern C1FIFOCON0INV    /* 0xBF82235C */
  .extern C1FIFOINT0       /* 0xBF822360 */
  .extern C1FIFOINT0CLR    /* 0xBF822364 */
  .extern C1FIFOINT0SET    /* 0xBF822368 */
  .extern C1FIFOINT0INV    /* 0xBF82236C */
  .extern C1FIFOUA0        /* 0xBF822370 */
  .extern C1FIFOUA0CLR     /* 0xBF822374 */
  .extern C1FIFOUA0SET     /* 0xBF822378 */
  .extern C1FIFOUA0INV     /* 0xBF82237C */
  .extern C1FIFOCI0        /* 0xBF822380 */
  .extern C1FIFOCI0CLR     /* 0xBF822384 */
  .extern C1FIFOCI0SET     /* 0xBF822388 */
  .extern C1FIFOCI0INV     /* 0xBF82238C */
  .extern C1FIFOCON1       /* 0xBF822390 */
  .extern C1FIFOCON1CLR    /* 0xBF822394 */
  .extern C1FIFOCON1SET    /* 0xBF822398 */
  .extern C1FIFOCON1INV    /* 0xBF82239C */
  .extern C1FIFOINT1       /* 0xBF8223A0 */
  .extern C1FIFOINT1CLR    /* 0xBF8223A4 */
  .extern C1FIFOINT1SET    /* 0xBF8223A8 */
  .extern C1FIFOINT1INV    /* 0xBF8223AC */
  .extern C1FIFOUA1        /* 0xBF8223B0 */
  .extern C1FIFOUA1CLR     /* 0xBF8223B4 */
  .extern C1FIFOUA1SET     /* 0xBF8223B8 */
  .extern C1FIFOUA1INV     /* 0xBF8223BC */
  .extern C1FIFOCI1        /* 0xBF8223C0 */
  .extern C1FIFOCI1CLR     /* 0xBF8223C4 */
  .extern C1FIFOCI1SET     /* 0xBF8223C8 */
  .extern C1FIFOCI1INV     /* 0xBF8223CC */
  .extern C1FIFOCON2       /* 0xBF8223D0 */
  .extern C1FIFOCON2CLR    /* 0xBF8223D4 */
  .extern C1FIFOCON2SET    /* 0xBF8223D8 */
  .extern C1FIFOCON2INV    /* 0xBF8223DC */
  .extern C1FIFOINT2       /* 0xBF8223E0 */
  .extern C1FIFOINT2CLR    /* 0xBF8223E4 */
  .extern C1FIFOINT2SET    /* 0xBF8223E8 */
  .extern C1FIFOINT2INV    /* 0xBF8223EC */
  .extern C1FIFOUA2        /* 0xBF8223F0 */
  .extern C1FIFOUA2CLR     /* 0xBF8223F4 */
  .extern C1FIFOUA2SET     /* 0xBF8223F8 */
  .extern C1FIFOUA2INV     /* 0xBF8223FC */
  .extern C1FIFOCI2        /* 0xBF822400 */
  .extern C1FIFOCI2CLR     /* 0xBF822404 */
  .extern C1FIFOCI2SET     /* 0xBF822408 */
  .extern C1FIFOCI2INV     /* 0xBF82240C */
  .extern C1FIFOCON3       /* 0xBF822410 */
  .extern C1FIFOCON3CLR    /* 0xBF822414 */
  .extern C1FIFOCON3SET    /* 0xBF822418 */
  .extern C1FIFOCON3INV    /* 0xBF82241C */
  .extern C1FIFOINT3       /* 0xBF822420 */
  .extern C1FIFOINT3CLR    /* 0xBF822424 */
  .extern C1FIFOINT3SET    /* 0xBF822428 */
  .extern C1FIFOINT3INV    /* 0xBF82242C */
  .extern C1FIFOUA3        /* 0xBF822430 */
  .extern C1FIFOUA3CLR     /* 0xBF822434 */
  .extern C1FIFOUA3SET     /* 0xBF822438 */
  .extern C1FIFOUA3INV     /* 0xBF82243C */
  .extern C1FIFOCI3        /* 0xBF822440 */
  .extern C1FIFOCI3CLR     /* 0xBF822444 */
  .extern C1FIFOCI3SET     /* 0xBF822448 */
  .extern C1FIFOCI3INV     /* 0xBF82244C */
  .extern C1FIFOCON4       /* 0xBF822450 */
  .extern C1FIFOCON4CLR    /* 0xBF822454 */
  .extern C1FIFOCON4SET    /* 0xBF822458 */
  .extern C1FIFOCON4INV    /* 0xBF82245C */
  .extern C1FIFOINT4       /* 0xBF822460 */
  .extern C1FIFOINT4CLR    /* 0xBF822464 */
  .extern C1FIFOINT4SET    /* 0xBF822468 */
  .extern C1FIFOINT4INV    /* 0xBF82246C */
  .extern C1FIFOUA4        /* 0xBF822470 */
  .extern C1FIFOUA4CLR     /* 0xBF822474 */
  .extern C1FIFOUA4SET     /* 0xBF822478 */
  .extern C1FIFOUA4INV     /* 0xBF82247C */
  .extern C1FIFOCI4        /* 0xBF822480 */
  .extern C1FIFOCI4CLR     /* 0xBF822484 */
  .extern C1FIFOCI4SET     /* 0xBF822488 */
  .extern C1FIFOCI4INV     /* 0xBF82248C */
  .extern C1FIFOCON5       /* 0xBF822490 */
  .extern C1FIFOCON5CLR    /* 0xBF822494 */
  .extern C1FIFOCON5SET    /* 0xBF822498 */
  .extern C1FIFOCON5INV    /* 0xBF82249C */
  .extern C1FIFOINT5       /* 0xBF8224A0 */
  .extern C1FIFOINT5CLR    /* 0xBF8224A4 */
  .extern C1FIFOINT5SET    /* 0xBF8224A8 */
  .extern C1FIFOINT5INV    /* 0xBF8224AC */
  .extern C1FIFOUA5        /* 0xBF8224B0 */
  .extern C1FIFOUA5CLR     /* 0xBF8224B4 */
  .extern C1FIFOUA5SET     /* 0xBF8224B8 */
  .extern C1FIFOUA5INV     /* 0xBF8224BC */
  .extern C1FIFOCI5        /* 0xBF8224C0 */
  .extern C1FIFOCI5CLR     /* 0xBF8224C4 */
  .extern C1FIFOCI5SET     /* 0xBF8224C8 */
  .extern C1FIFOCI5INV     /* 0xBF8224CC */
  .extern C1FIFOCON6       /* 0xBF8224D0 */
  .extern C1FIFOCON6CLR    /* 0xBF8224D4 */
  .extern C1FIFOCON6SET    /* 0xBF8224D8 */
  .extern C1FIFOCON6INV    /* 0xBF8224DC */
  .extern C1FIFOINT6       /* 0xBF8224E0 */
  .extern C1FIFOINT6CLR    /* 0xBF8224E4 */
  .extern C1FIFOINT6SET    /* 0xBF8224E8 */
  .extern C1FIFOINT6INV    /* 0xBF8224EC */
  .extern C1FIFOUA6        /* 0xBF8224F0 */
  .extern C1FIFOUA6CLR     /* 0xBF8224F4 */
  .extern C1FIFOUA6SET     /* 0xBF8224F8 */
  .extern C1FIFOUA6INV     /* 0xBF8224FC */
  .extern C1FIFOCI6        /* 0xBF822500 */
  .extern C1FIFOCI6CLR     /* 0xBF822504 */
  .extern C1FIFOCI6SET     /* 0xBF822508 */
  .extern C1FIFOCI6INV     /* 0xBF82250C */
  .extern C1FIFOCON7       /* 0xBF822510 */
  .extern C1FIFOCON7CLR    /* 0xBF822514 */
  .extern C1FIFOCON7SET    /* 0xBF822518 */
  .extern C1FIFOCON7INV    /* 0xBF82251C */
  .extern C1FIFOINT7       /* 0xBF822520 */
  .extern C1FIFOINT7CLR    /* 0xBF822524 */
  .extern C1FIFOINT7SET    /* 0xBF822528 */
  .extern C1FIFOINT7INV    /* 0xBF82252C */
  .extern C1FIFOUA7        /* 0xBF822530 */
  .extern C1FIFOUA7CLR     /* 0xBF822534 */
  .extern C1FIFOUA7SET     /* 0xBF822538 */
  .extern C1FIFOUA7INV     /* 0xBF82253C */
  .extern C1FIFOCI7        /* 0xBF822540 */
  .extern C1FIFOCI7CLR     /* 0xBF822544 */
  .extern C1FIFOCI7SET     /* 0xBF822548 */
  .extern C1FIFOCI7INV     /* 0xBF82254C */
  .extern C1FIFOCON8       /* 0xBF822550 */
  .extern C1FIFOCON8CLR    /* 0xBF822554 */
  .extern C1FIFOCON8SET    /* 0xBF822558 */
  .extern C1FIFOCON8INV    /* 0xBF82255C */
  .extern C1FIFOINT8       /* 0xBF822560 */
  .extern C1FIFOINT8CLR    /* 0xBF822564 */
  .extern C1FIFOINT8SET    /* 0xBF822568 */
  .extern C1FIFOINT8INV    /* 0xBF82256C */
  .extern C1FIFOUA8        /* 0xBF822570 */
  .extern C1FIFOUA8CLR     /* 0xBF822574 */
  .extern C1FIFOUA8SET     /* 0xBF822578 */
  .extern C1FIFOUA8INV     /* 0xBF82257C */
  .extern C1FIFOCI8        /* 0xBF822580 */
  .extern C1FIFOCI8CLR     /* 0xBF822584 */
  .extern C1FIFOCI8SET     /* 0xBF822588 */
  .extern C1FIFOCI8INV     /* 0xBF82258C */
  .extern C1FIFOCON9       /* 0xBF822590 */
  .extern C1FIFOCON9CLR    /* 0xBF822594 */
  .extern C1FIFOCON9SET    /* 0xBF822598 */
  .extern C1FIFOCON9INV    /* 0xBF82259C */
  .extern C1FIFOINT9       /* 0xBF8225A0 */
  .extern C1FIFOINT9CLR    /* 0xBF8225A4 */
  .extern C1FIFOINT9SET    /* 0xBF8225A8 */
  .extern C1FIFOINT9INV    /* 0xBF8225AC */
  .extern C1FIFOUA9        /* 0xBF8225B0 */
  .extern C1FIFOUA9CLR     /* 0xBF8225B4 */
  .extern C1FIFOUA9SET     /* 0xBF8225B8 */
  .extern C1FIFOUA9INV     /* 0xBF8225BC */
  .extern C1FIFOCI9        /* 0xBF8225C0 */
  .extern C1FIFOCI9CLR     /* 0xBF8225C4 */
  .extern C1FIFOCI9SET     /* 0xBF8225C8 */
  .extern C1FIFOCI9INV     /* 0xBF8225CC */
  .extern C1FIFOCON10      /* 0xBF8225D0 */
  .extern C1FIFOCON10CLR   /* 0xBF8225D4 */
  .extern C1FIFOCON10SET   /* 0xBF8225D8 */
  .extern C1FIFOCON10INV   /* 0xBF8225DC */
  .extern C1FIFOINT10      /* 0xBF8225E0 */
  .extern C1FIFOINT10CLR   /* 0xBF8225E4 */
  .extern C1FIFOINT10SET   /* 0xBF8225E8 */
  .extern C1FIFOINT10INV   /* 0xBF8225EC */
  .extern C1FIFOUA10       /* 0xBF8225F0 */
  .extern C1FIFOUA10CLR    /* 0xBF8225F4 */
  .extern C1FIFOUA10SET    /* 0xBF8225F8 */
  .extern C1FIFOUA10INV    /* 0xBF8225FC */
  .extern C1FIFOCI10       /* 0xBF822600 */
  .extern C1FIFOCI10CLR    /* 0xBF822604 */
  .extern C1FIFOCI10SET    /* 0xBF822608 */
  .extern C1FIFOCI10INV    /* 0xBF82260C */
  .extern C1FIFOCON11      /* 0xBF822610 */
  .extern C1FIFOCON11CLR   /* 0xBF822614 */
  .extern C1FIFOCON11SET   /* 0xBF822618 */
  .extern C1FIFOCON11INV   /* 0xBF82261C */
  .extern C1FIFOINT11      /* 0xBF822620 */
  .extern C1FIFOINT11CLR   /* 0xBF822624 */
  .extern C1FIFOINT11SET   /* 0xBF822628 */
  .extern C1FIFOINT11INV   /* 0xBF82262C */
  .extern C1FIFOUA11       /* 0xBF822630 */
  .extern C1FIFOUA11CLR    /* 0xBF822634 */
  .extern C1FIFOUA11SET    /* 0xBF822638 */
  .extern C1FIFOUA11INV    /* 0xBF82263C */
  .extern C1FIFOCI11       /* 0xBF822640 */
  .extern C1FIFOCI11CLR    /* 0xBF822644 */
  .extern C1FIFOCI11SET    /* 0xBF822648 */
  .extern C1FIFOCI11INV    /* 0xBF82264C */
  .extern C1FIFOCON12      /* 0xBF822650 */
  .extern C1FIFOCON12CLR   /* 0xBF822654 */
  .extern C1FIFOCON12SET   /* 0xBF822658 */
  .extern C1FIFOCON12INV   /* 0xBF82265C */
  .extern C1FIFOINT12      /* 0xBF822660 */
  .extern C1FIFOINT12CLR   /* 0xBF822664 */
  .extern C1FIFOINT12SET   /* 0xBF822668 */
  .extern C1FIFOINT12INV   /* 0xBF82266C */
  .extern C1FIFOUA12       /* 0xBF822670 */
  .extern C1FIFOUA12CLR    /* 0xBF822674 */
  .extern C1FIFOUA12SET    /* 0xBF822678 */
  .extern C1FIFOUA12INV    /* 0xBF82267C */
  .extern C1FIFOCI12       /* 0xBF822680 */
  .extern C1FIFOCI12CLR    /* 0xBF822684 */
  .extern C1FIFOCI12SET    /* 0xBF822688 */
  .extern C1FIFOCI12INV    /* 0xBF82268C */
  .extern C1FIFOCON13      /* 0xBF822690 */
  .extern C1FIFOCON13CLR   /* 0xBF822694 */
  .extern C1FIFOCON13SET   /* 0xBF822698 */
  .extern C1FIFOCON13INV   /* 0xBF82269C */
  .extern C1FIFOINT13      /* 0xBF8226A0 */
  .extern C1FIFOINT13CLR   /* 0xBF8226A4 */
  .extern C1FIFOINT13SET   /* 0xBF8226A8 */
  .extern C1FIFOINT13INV   /* 0xBF8226AC */
  .extern C1FIFOUA13       /* 0xBF8226B0 */
  .extern C1FIFOUA13CLR    /* 0xBF8226B4 */
  .extern C1FIFOUA13SET    /* 0xBF8226B8 */
  .extern C1FIFOUA13INV    /* 0xBF8226BC */
  .extern C1FIFOCI13       /* 0xBF8226C0 */
  .extern C1FIFOCI13CLR    /* 0xBF8226C4 */
  .extern C1FIFOCI13SET    /* 0xBF8226C8 */
  .extern C1FIFOCI13INV    /* 0xBF8226CC */
  .extern C1FIFOCON14      /* 0xBF8226D0 */
  .extern C1FIFOCON14CLR   /* 0xBF8226D4 */
  .extern C1FIFOCON14SET   /* 0xBF8226D8 */
  .extern C1FIFOCON14INV   /* 0xBF8226DC */
  .extern C1FIFOINT14      /* 0xBF8226E0 */
  .extern C1FIFOINT14CLR   /* 0xBF8226E4 */
  .extern C1FIFOINT14SET   /* 0xBF8226E8 */
  .extern C1FIFOINT14INV   /* 0xBF8226EC */
  .extern C1FIFOUA14       /* 0xBF8226F0 */
  .extern C1FIFOUA14CLR    /* 0xBF8226F4 */
  .extern C1FIFOUA14SET    /* 0xBF8226F8 */
  .extern C1FIFOUA14INV    /* 0xBF8226FC */
  .extern C1FIFOCI14       /* 0xBF822700 */
  .extern C1FIFOCI14CLR    /* 0xBF822704 */
  .extern C1FIFOCI14SET    /* 0xBF822708 */
  .extern C1FIFOCI14INV    /* 0xBF82270C */
  .extern C1FIFOCON15      /* 0xBF822710 */
  .extern C1FIFOCON15CLR   /* 0xBF822714 */
  .extern C1FIFOCON15SET   /* 0xBF822718 */
  .extern C1FIFOCON15INV   /* 0xBF82271C */
  .extern C1FIFOINT15      /* 0xBF822720 */
  .extern C1FIFOINT15CLR   /* 0xBF822724 */
  .extern C1FIFOINT15SET   /* 0xBF822728 */
  .extern C1FIFOINT15INV   /* 0xBF82272C */
