Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
  .extern C1FIFOUA15       /* 0xBF822730 */
  .extern C1FIFOUA15CLR    /* 0xBF822734 */
  .extern C1FIFOUA15SET    /* 0xBF822738 */
  .extern C1FIFOUA15INV    /* 0xBF82273C */
  .extern C1FIFOCI15       /* 0xBF822740 */
  .extern C1FIFOCI15CLR    /* 0xBF822744 */
  .extern C1FIFOCI15SET    /* 0xBF822748 */
  .extern C1FIFOCI15INV    /* 0xBF82274C */
  .extern CFD2CON          /* 0xBF823000 */
  .extern CFD2NBTCFG       /* 0xBF823004 */
  .extern CFD2DBTCFG       /* 0xBF823008 */
  .extern CFD2TDC          /* 0xBF82300C */
  .extern CFD2TBC          /* 0xBF823010 */
  .extern CFD2TSCON        /* 0xBF823014 */
  .extern CFD2VEC          /* 0xBF823018 */
  .extern CFD2INT          /* 0xBF82301C */
  .extern CFD2RXIF         /* 0xBF823020 */
  .extern CFD2TXIF         /* 0xBF823024 */
  .extern CFD2RXOVIF       /* 0xBF823028 */
  .extern CFD2TXATIF       /* 0xBF82302C */
  .extern CFD2TXREQ        /* 0xBF823030 */
  .extern CFD2TREC         /* 0xBF823034 */
  .extern CFD2BDIAG0       /* 0xBF823038 */
  .extern CFD2BDIAG1       /* 0xBF82303C */
  .extern CFD2TEFCON       /* 0xBF823040 */
  .extern CFD2TEFSTA       /* 0xBF823044 */
  .extern CFD2TEFUA        /* 0xBF823048 */
  .extern CFD2FIFOBA       /* 0xBF82304C */
  .extern CFD2TXQCON       /* 0xBF823050 */
  .extern CFD2TXQSTA       /* 0xBF823054 */
  .extern CFD2TXQUA        /* 0xBF823058 */
  .extern CFD2FIFOCON1     /* 0xBF82305C */
  .extern CFD2FIFOSTA1     /* 0xBF823060 */
  .extern CFD2FIFOUA1      /* 0xBF823064 */
  .extern CFD2FIFOCON2     /* 0xBF823068 */
  .extern CFD2FIFOSTA2     /* 0xBF82306C */
  .extern CFD2FIFOUA2      /* 0xBF823070 */
  .extern CFD2FIFOCON3     /* 0xBF823074 */
  .extern CFD2FIFOSTA3     /* 0xBF823078 */
  .extern CFD2FIFOUA3      /* 0xBF82307C */
  .extern CFD2FIFOCON4     /* 0xBF823080 */
  .extern CFD2FIFOSTA4     /* 0xBF823084 */
  .extern CFD2FIFOUA4      /* 0xBF823088 */
  .extern CFD2FIFOCON5     /* 0xBF82308C */
  .extern CFD2FIFOSTA5     /* 0xBF823090 */
  .extern CFD2FIFOUA5      /* 0xBF823094 */
  .extern CFD2FIFOCON6     /* 0xBF823098 */
  .extern CFD2FIFOSTA6     /* 0xBF82309C */
  .extern CFD2FIFOUA6      /* 0xBF8230A0 */
  .extern CFD2FIFOCON7     /* 0xBF8230A4 */
  .extern CFD2FIFOSTA7     /* 0xBF8230A8 */
  .extern CFD2FIFOUA7      /* 0xBF8230AC */
  .extern CFD2FIFOCON8     /* 0xBF8230B0 */
  .extern CFD2FIFOSTA8     /* 0xBF8230B4 */
  .extern CFD2FIFOUA8      /* 0xBF8230B8 */
  .extern CFD2FIFOCON9     /* 0xBF8230BC */
  .extern CFD2FIFOSTA9     /* 0xBF8230C0 */
  .extern CFD2FIFOUA9      /* 0xBF8230C4 */
  .extern CFD2FIFOCON10    /* 0xBF8230C8 */
  .extern CFD2FIFOSTA10    /* 0xBF8230CC */
  .extern CFD2FIFOUA10     /* 0xBF8230D0 */
  .extern CFD2FIFOCON11    /* 0xBF8230D4 */
  .extern CFD2FIFOSTA11    /* 0xBF8230D8 */
  .extern CFD2FIFOUA11     /* 0xBF8230DC */
  .extern CFD2FIFOCON12    /* 0xBF8230E0 */
  .extern CFD2FIFOSTA12    /* 0xBF8230E4 */
  .extern CFD2FIFOUA12     /* 0xBF8230E8 */
  .extern CFD2FIFOCON13    /* 0xBF8230EC */
  .extern CFD2FIFOSTA13    /* 0xBF8230F0 */
  .extern CFD2FIFOUA13     /* 0xBF8230F4 */
  .extern CFD2FIFOCON14    /* 0xBF8230F8 */
  .extern CFD2FIFOSTA14    /* 0xBF8230FC */
  .extern CFD2FIFOUA14     /* 0xBF823100 */
  .extern CFD2FIFOCON15    /* 0xBF823104 */
  .extern CFD2FIFOSTA15    /* 0xBF823108 */
  .extern CFD2FIFOUA15     /* 0xBF82310C */
  .extern CFD2FLTCON0      /* 0xBF823110 */
  .extern CFD2FLTCON1      /* 0xBF823114 */
  .extern CFD2FLTCON2      /* 0xBF823118 */
  .extern CFD2FLTCON3      /* 0xBF82311C */
  .extern CFD2FLTOBJ0      /* 0xBF823120 */
  .extern CFD2MASK0        /* 0xBF823124 */
  .extern CFD2FLTOBJ1      /* 0xBF823128 */
  .extern CFD2MASK1        /* 0xBF82312C */
  .extern CFD2FLTOBJ2      /* 0xBF823130 */
  .extern CFD2MASK2        /* 0xBF823134 */
  .extern CFD2FLTOBJ3      /* 0xBF823138 */
  .extern CFD2MASK3        /* 0xBF82313C */
  .extern CFD2FLTOBJ4      /* 0xBF823140 */
  .extern CFD2MASK4        /* 0xBF823144 */
  .extern CFD2FLTOBJ5      /* 0xBF823148 */
  .extern CFD2MASK5        /* 0xBF82314C */
  .extern CFD2FLTOBJ6      /* 0xBF823150 */
  .extern CFD2MASK6        /* 0xBF823154 */
  .extern CFD2FLTOBJ7      /* 0xBF823158 */
  .extern CFD2MASK7        /* 0xBF82315C */
  .extern CFD2FLTOBJ8      /* 0xBF823160 */
  .extern CFD2MASK8        /* 0xBF823164 */
  .extern CFD2FLTOBJ9      /* 0xBF823168 */
  .extern CFD2MASK9        /* 0xBF82316C */
  .extern CFD2FLTOBJ10     /* 0xBF823170 */
  .extern CFD2MASK10       /* 0xBF823174 */
  .extern CFD2FLTOBJ11     /* 0xBF823178 */
  .extern CFD2MASK11       /* 0xBF82317C */
  .extern CFD2FLTOBJ12     /* 0xBF823180 */
  .extern CFD2MASK12       /* 0xBF823184 */
  .extern CFD2FLTOBJ13     /* 0xBF823188 */
  .extern CFD2MASK13       /* 0xBF82318C */
  .extern CFD2FLTOBJ14     /* 0xBF823190 */
  .extern CFD2MASK14       /* 0xBF823194 */
  .extern CFD2FLTOBJ15     /* 0xBF823198 */
  .extern CFD2MASK15       /* 0xBF82319C */
  .extern CVDCON           /* 0xBF824000 */
  .extern CVDADC           /* 0xBF824004 */
  .extern CVDSTAT          /* 0xBF824008 */
  .extern CVDRES0H         /* 0xBF824010 */
  .extern CVDRES0L         /* 0xBF824014 */
  .extern CVDRES0D         /* 0xBF824018 */
  .extern CVDRX0           /* 0xBF824080 */
  .extern CVDRX1           /* 0xBF824084 */
  .extern CVDRX2           /* 0xBF824088 */
  .extern CVDRX3           /* 0xBF82408C */
  .extern CVDTX0           /* 0xBF8240C0 */
  .extern CVDTX1           /* 0xBF8240C4 */
  .extern CVDTX2           /* 0xBF8240C8 */
  .extern CVDTX3           /* 0xBF8240CC */
  .extern CVDSD0C1         /* 0xBF824100 */
  .extern CVDSD0C2         /* 0xBF824104 */
  .extern CVDSD0C3         /* 0xBF824108 */
  .extern CVDSD0T2         /* 0xBF82410C */
  .extern CVDSD1C1         /* 0xBF824110 */
  .extern CVDSD1C2         /* 0xBF824114 */
  .extern CVDSD1C3         /* 0xBF824118 */
  .extern CVDSD1T2         /* 0xBF82411C */
  .extern CVDSD2C1         /* 0xBF824120 */
  .extern CVDSD2C2         /* 0xBF824124 */
  .extern CVDSD2C3         /* 0xBF824128 */
  .extern CVDSD2T2         /* 0xBF82412C */
  .extern CVDSD3C1         /* 0xBF824130 */
  .extern CVDSD3C2         /* 0xBF824134 */
  .extern CVDSD3C3         /* 0xBF824138 */
  .extern CVDSD3T2         /* 0xBF82413C */
  .extern I2C2CON          /* 0xBF840400 */
  .extern I2C2CONCLR       /* 0xBF840404 */
  .extern I2C2CONSET       /* 0xBF840408 */
  .extern I2C2CONINV       /* 0xBF84040C */
  .extern I2C2STAT         /* 0xBF840410 */
  .extern I2C2STATCLR      /* 0xBF840414 */
  .extern I2C2STATSET      /* 0xBF840418 */
  .extern I2C2STATINV      /* 0xBF84041C */
  .extern I2C2ADD          /* 0xBF840420 */
  .extern I2C2ADDCLR       /* 0xBF840424 */
  .extern I2C2ADDSET       /* 0xBF840428 */
  .extern I2C2ADDINV       /* 0xBF84042C */
  .extern I2C2MSK          /* 0xBF840430 */
  .extern I2C2MSKCLR       /* 0xBF840434 */
  .extern I2C2MSKSET       /* 0xBF840438 */
  .extern I2C2MSKINV       /* 0xBF84043C */
  .extern I2C2BRG          /* 0xBF840440 */
  .extern I2C2BRGCLR       /* 0xBF840444 */
  .extern I2C2BRGSET       /* 0xBF840448 */
  .extern I2C2BRGINV       /* 0xBF84044C */
  .extern I2C2TRN          /* 0xBF840450 */
  .extern I2C2TRNCLR       /* 0xBF840454 */
  .extern I2C2TRNSET       /* 0xBF840458 */
  .extern I2C2TRNINV       /* 0xBF84045C */
  .extern I2C2RCV          /* 0xBF840460 */
  .extern I2C2RCVCLR       /* 0xBF840464 */
  .extern I2C2RCVSET       /* 0xBF840468 */
  .extern I2C2RCVINV       /* 0xBF84046C */
  .extern U1MODE           /* 0xBF840600 */
  .extern U1MODECLR        /* 0xBF840604 */
  .extern U1MODESET        /* 0xBF840608 */
  .extern U1MODEINV        /* 0xBF84060C */
  .extern U1STA            /* 0xBF840610 */
  .extern U1STACLR         /* 0xBF840614 */
  .extern U1STASET         /* 0xBF840618 */
  .extern U1STAINV         /* 0xBF84061C */
  .extern U1TXREG          /* 0xBF840620 */
  .extern U1RXREG          /* 0xBF840630 */
  .extern U1BRG            /* 0xBF840640 */
  .extern U1BRGCLR         /* 0xBF840644 */
  .extern U1BRGSET         /* 0xBF840648 */
  .extern U1BRGINV         /* 0xBF84064C */
  .extern U2MODE           /* 0xBF840800 */
  .extern U2MODECLR        /* 0xBF840804 */
  .extern U2MODESET        /* 0xBF840808 */
  .extern U2MODEINV        /* 0xBF84080C */
  .extern U2STA            /* 0xBF840810 */
  .extern U2STACLR         /* 0xBF840814 */
  .extern U2STASET         /* 0xBF840818 */
  .extern U2STAINV         /* 0xBF84081C */
  .extern U2TXREG          /* 0xBF840820 */
  .extern U2RXREG          /* 0xBF840830 */
  .extern U2BRG            /* 0xBF840840 */
  .extern U2BRGCLR         /* 0xBF840844 */
  .extern U2BRGSET         /* 0xBF840848 */
  .extern U2BRGINV         /* 0xBF84084C */
  .extern SPI1CON          /* 0xBF840C00 */
  .extern SPI1CONCLR       /* 0xBF840C04 */
  .extern SPI1CONSET       /* 0xBF840C08 */
  .extern SPI1CONINV       /* 0xBF840C0C */
  .extern SPI1STAT         /* 0xBF840C10 */
  .extern SPI1STATCLR      /* 0xBF840C14 */
  .extern SPI1STATSET      /* 0xBF840C18 */
  .extern SPI1STATINV      /* 0xBF840C1C */
  .extern SPI1BUF          /* 0xBF840C20 */
  .extern SPI1BRG          /* 0xBF840C30 */
  .extern SPI1BRGCLR       /* 0xBF840C34 */
  .extern SPI1BRGSET       /* 0xBF840C38 */
  .extern SPI1BRGINV       /* 0xBF840C3C */
  .extern SPI1CON2         /* 0xBF840C40 */
  .extern SPI1CON2CLR      /* 0xBF840C44 */
  .extern SPI1CON2SET      /* 0xBF840C48 */
  .extern SPI1CON2INV      /* 0xBF840C4C */
  .extern SPI2CON          /* 0xBF840E00 */
  .extern SPI2CONCLR       /* 0xBF840E04 */
  .extern SPI2CONSET       /* 0xBF840E08 */
  .extern SPI2CONINV       /* 0xBF840E0C */
  .extern SPI2STAT         /* 0xBF840E10 */
  .extern SPI2STATCLR      /* 0xBF840E14 */
  .extern SPI2STATSET      /* 0xBF840E18 */
  .extern SPI2STATINV      /* 0xBF840E1C */
  .extern SPI2BUF          /* 0xBF840E20 */
  .extern SPI2BRG          /* 0xBF840E30 */
  .extern SPI2BRGCLR       /* 0xBF840E34 */
  .extern SPI2BRGSET       /* 0xBF840E38 */
  .extern SPI2BRGINV       /* 0xBF840E3C */
  .extern SPI2CON2         /* 0xBF840E40 */
  .extern SPI2CON2CLR      /* 0xBF840E44 */
  .extern SPI2CON2SET      /* 0xBF840E48 */
  .extern SPI2CON2INV      /* 0xBF840E4C */
  .extern IC1CON           /* 0xBF841000 */
  .extern IC1CONCLR        /* 0xBF841004 */
  .extern IC1CONSET        /* 0xBF841008 */
  .extern IC1CONINV        /* 0xBF84100C */
  .extern IC1BUF           /* 0xBF841010 */
  .extern IC2CON           /* 0xBF841200 */
  .extern IC2CONCLR        /* 0xBF841204 */
  .extern IC2CONSET        /* 0xBF841208 */
  .extern IC2CONINV        /* 0xBF84120C */
  .extern IC2BUF           /* 0xBF841210 */
  .extern IC3CON           /* 0xBF841400 */
  .extern IC3CONCLR        /* 0xBF841404 */
  .extern IC3CONSET        /* 0xBF841408 */
  .extern IC3CONINV        /* 0xBF84140C */
  .extern IC3BUF           /* 0xBF841410 */
  .extern IC4CON           /* 0xBF841600 */
  .extern IC4CONCLR        /* 0xBF841604 */
  .extern IC4CONSET        /* 0xBF841608 */
  .extern IC4CONINV        /* 0xBF84160C */
  .extern IC4BUF           /* 0xBF841610 */
  .extern OC1CON           /* 0xBF842000 */
  .extern OC1CONCLR        /* 0xBF842004 */
  .extern OC1CONSET        /* 0xBF842008 */
  .extern OC1CONINV        /* 0xBF84200C */
  .extern OC1R             /* 0xBF842010 */
  .extern OC1RCLR          /* 0xBF842014 */
  .extern OC1RSET          /* 0xBF842018 */
  .extern OC1RINV          /* 0xBF84201C */
  .extern OC1RS            /* 0xBF842020 */
  .extern OC1RSCLR         /* 0xBF842024 */
  .extern OC1RSSET         /* 0xBF842028 */
  .extern OC1RSINV         /* 0xBF84202C */
  .extern OC2CON           /* 0xBF842200 */
  .extern OC2CONCLR        /* 0xBF842204 */
  .extern OC2CONSET        /* 0xBF842208 */
  .extern OC2CONINV        /* 0xBF84220C */
  .extern OC2R             /* 0xBF842210 */
  .extern OC2RCLR          /* 0xBF842214 */
  .extern OC2RSET          /* 0xBF842218 */
  .extern OC2RINV          /* 0xBF84221C */
  .extern OC2RS            /* 0xBF842220 */
  .extern OC2RSCLR         /* 0xBF842224 */
  .extern OC2RSSET         /* 0xBF842228 */
  .extern OC2RSINV         /* 0xBF84222C */
  .extern OC3CON           /* 0xBF842400 */
  .extern OC3CONCLR        /* 0xBF842404 */
  .extern OC3CONSET        /* 0xBF842408 */
  .extern OC3CONINV        /* 0xBF84240C */
  .extern OC3R             /* 0xBF842410 */
  .extern OC3RCLR          /* 0xBF842414 */
  .extern OC3RSET          /* 0xBF842418 */
  .extern OC3RINV          /* 0xBF84241C */
  .extern OC3RS            /* 0xBF842420 */
  .extern OC3RSCLR         /* 0xBF842424 */
  .extern OC3RSSET         /* 0xBF842428 */
  .extern OC3RSINV         /* 0xBF84242C */
  .extern OC4CON           /* 0xBF842600 */
  .extern OC4CONCLR        /* 0xBF842604 */
  .extern OC4CONSET        /* 0xBF842608 */
  .extern OC4CONINV        /* 0xBF84260C */
  .extern OC4R             /* 0xBF842610 */
  .extern OC4RCLR          /* 0xBF842614 */
  .extern OC4RSET          /* 0xBF842618 */
  .extern OC4RINV          /* 0xBF84261C */
  .extern OC4RS            /* 0xBF842620 */
  .extern OC4RSCLR         /* 0xBF842624 */
  .extern OC4RSSET         /* 0xBF842628 */
  .extern OC4RSINV         /* 0xBF84262C */
  .extern ETHCON1          /* 0xBF843000 */
  .extern ETHCON1CLR       /* 0xBF843004 */
  .extern ETHCON1SET       /* 0xBF843008 */
  .extern ETHCON1INV       /* 0xBF84300C */
  .extern ETHCON2          /* 0xBF843010 */
  .extern ETHCON2CLR       /* 0xBF843014 */
  .extern ETHCON2SET       /* 0xBF843018 */
  .extern ETHCON2INV       /* 0xBF84301C */
  .extern ETHTXST          /* 0xBF843020 */
  .extern ETHTXSTCLR       /* 0xBF843024 */
  .extern ETHTXSTSET       /* 0xBF843028 */
  .extern ETHTXSTINV       /* 0xBF84302C */
  .extern ETHRXST          /* 0xBF843030 */
  .extern ETHRXSTCLR       /* 0xBF843034 */
  .extern ETHRXSTSET       /* 0xBF843038 */
  .extern ETHRXSTINV       /* 0xBF84303C */
  .extern ETHHT0           /* 0xBF843040 */
  .extern ETHHT0CLR        /* 0xBF843044 */
  .extern ETHHT0SET        /* 0xBF843048 */
  .extern ETHHT0INV        /* 0xBF84304C */
  .extern ETHHT1           /* 0xBF843050 */
  .extern ETHHT1CLR        /* 0xBF843054 */
  .extern ETHHT1SET        /* 0xBF843058 */
  .extern ETHHT1INV        /* 0xBF84305C */
  .extern ETHPMM0          /* 0xBF843060 */
  .extern ETHPMM0CLR       /* 0xBF843064 */
  .extern ETHPMM0SET       /* 0xBF843068 */
  .extern ETHPMM0INV       /* 0xBF84306C */
  .extern ETHPMM1          /* 0xBF843070 */
  .extern ETHPMM1CLR       /* 0xBF843074 */
  .extern ETHPMM1SET       /* 0xBF843078 */
  .extern ETHPMM1INV       /* 0xBF84307C */
  .extern ETHPMCS          /* 0xBF843080 */
  .extern ETHPMCSCLR       /* 0xBF843084 */
  .extern ETHPMCSSET       /* 0xBF843088 */
  .extern ETHPMCSINV       /* 0xBF84308C */
  .extern ETHPMO           /* 0xBF843090 */
  .extern ETHPMOCLR        /* 0xBF843094 */
  .extern ETHPMOSET        /* 0xBF843098 */
  .extern ETHPMOINV        /* 0xBF84309C */
  .extern ETHRXFC          /* 0xBF8430A0 */
  .extern ETHRXFCCLR       /* 0xBF8430A4 */
  .extern ETHRXFCSET       /* 0xBF8430A8 */
  .extern ETHRXFCINV       /* 0xBF8430AC */
  .extern ETHRXWM          /* 0xBF8430B0 */
  .extern ETHRXWMCLR       /* 0xBF8430B4 */
  .extern ETHRXWMSET       /* 0xBF8430B8 */
  .extern ETHRXWMINV       /* 0xBF8430BC */
  .extern ETHIEN           /* 0xBF8430C0 */
  .extern ETHIENCLR        /* 0xBF8430C4 */
  .extern ETHIENSET        /* 0xBF8430C8 */
  .extern ETHIENINV        /* 0xBF8430CC */
  .extern ETHIRQ           /* 0xBF8430D0 */
  .extern ETHIRQCLR        /* 0xBF8430D4 */
  .extern ETHIRQSET        /* 0xBF8430D8 */
  .extern ETHIRQINV        /* 0xBF8430DC */
  .extern ETHSTAT          /* 0xBF8430E0 */
  .extern ETHSTATCLR       /* 0xBF8430E4 */
  .extern ETHSTATSET       /* 0xBF8430E8 */
  .extern ETHSTATINV       /* 0xBF8430EC */
  .extern ETHRXOVFLOW      /* 0xBF843100 */
  .extern ETHRXOVFLOWCLR   /* 0xBF843104 */
  .extern ETHRXOVFLOWSET   /* 0xBF843108 */
  .extern ETHRXOVFLOWINV   /* 0xBF84310C */
  .extern ETHFRMTXOK       /* 0xBF843110 */
  .extern ETHFRMTXOKCLR    /* 0xBF843114 */
  .extern ETHFRMTXOKSET    /* 0xBF843118 */
  .extern ETHFRMTXOKINV    /* 0xBF84311C */
  .extern ETHSCOLFRM       /* 0xBF843120 */
  .extern ETHSCOLFRMCLR    /* 0xBF843124 */
  .extern ETHSCOLFRMSET    /* 0xBF843128 */
  .extern ETHSCOLFRMINV    /* 0xBF84312C */
  .extern ETHMCOLFRM       /* 0xBF843130 */
  .extern ETHMCOLFRMCLR    /* 0xBF843134 */
  .extern ETHMCOLFRMSET    /* 0xBF843138 */
  .extern ETHMCOLFRMINV    /* 0xBF84313C */
  .extern ETHFRMRXOK       /* 0xBF843140 */
  .extern ETHFRMRXOKCLR    /* 0xBF843144 */
  .extern ETHFRMRXOKSET    /* 0xBF843148 */
  .extern ETHFRMRXOKINV    /* 0xBF84314C */
  .extern ETHFCSERR        /* 0xBF843150 */
  .extern ETHFCSERRCLR     /* 0xBF843154 */
  .extern ETHFCSERRSET     /* 0xBF843158 */
  .extern ETHFCSERRINV     /* 0xBF84315C */
  .extern ETHALGNERR       /* 0xBF843160 */
  .extern ETHALGNERRCLR    /* 0xBF843164 */
  .extern ETHALGNERRSET    /* 0xBF843168 */
  .extern ETHALGNERRINV    /* 0xBF84316C */
  .extern EMAC1CFG1        /* 0xBF843200 */
  .extern EMACxCFG1        /* 0xBF843200 */
  .extern EMAC1CFG1CLR     /* 0xBF843204 */
  .extern EMACxCFG1CLR     /* 0xBF843204 */
  .extern EMAC1CFG1SET     /* 0xBF843208 */
  .extern EMACxCFG1SET     /* 0xBF843208 */
  .extern EMAC1CFG1INV     /* 0xBF84320C */
  .extern EMACxCFG1INV     /* 0xBF84320C */
  .extern EMAC1CFG2        /* 0xBF843210 */
  .extern EMACxCFG2        /* 0xBF843210 */
  .extern EMAC1CFG2CLR     /* 0xBF843214 */
  .extern EMACxCFG2CLR     /* 0xBF843214 */
  .extern EMAC1CFG2SET     /* 0xBF843218 */
  .extern EMACxCFG2SET     /* 0xBF843218 */
  .extern EMAC1CFG2INV     /* 0xBF84321C */
  .extern EMACxCFG2INV     /* 0xBF84321C */
  .extern EMAC1IPGT        /* 0xBF843220 */
  .extern EMACxIPGT        /* 0xBF843220 */
  .extern EMAC1IPGTCLR     /* 0xBF843224 */
  .extern EMACxIPGTCLR     /* 0xBF843224 */
  .extern EMAC1IPGTSET     /* 0xBF843228 */
  .extern EMACxIPGTSET     /* 0xBF843228 */
  .extern EMAC1IPGTINV     /* 0xBF84322C */
  .extern EMACxIPGTINV     /* 0xBF84322C */
  .extern EMAC1IPGR        /* 0xBF843230 */
  .extern EMACxIPGR        /* 0xBF843230 */
  .extern EMAC1IPGRCLR     /* 0xBF843234 */
  .extern EMACxIPGRCLR     /* 0xBF843234 */
  .extern EMAC1IPGRSET     /* 0xBF843238 */
  .extern EMACxIPGRSET     /* 0xBF843238 */
  .extern EMAC1IPGRINV     /* 0xBF84323C */
  .extern EMACxIPGRINV     /* 0xBF84323C */
  .extern EMAC1CLRT        /* 0xBF843240 */
  .extern EMACxCLRT        /* 0xBF843240 */
  .extern EMAC1CLRTCLR     /* 0xBF843244 */
  .extern EMACxCLRTCLR     /* 0xBF843244 */
  .extern EMAC1CLRTSET     /* 0xBF843248 */
  .extern EMACxCLRTSET     /* 0xBF843248 */
  .extern EMAC1CLRTINV     /* 0xBF84324C */
  .extern EMACxCLRTINV     /* 0xBF84324C */
  .extern EMAC1MAXF        /* 0xBF843250 */
  .extern EMACxMAXF        /* 0xBF843250 */
  .extern EMAC1MAXFCLR     /* 0xBF843254 */
  .extern EMACxMAXFCLR     /* 0xBF843254 */
  .extern EMAC1MAXFSET     /* 0xBF843258 */
  .extern EMACxMAXFSET     /* 0xBF843258 */
  .extern EMAC1MAXFINV     /* 0xBF84325C */
  .extern EMACxMAXFINV     /* 0xBF84325C */
  .extern EMAC1SUPP        /* 0xBF843260 */
  .extern EMACxSUPP        /* 0xBF843260 */
  .extern EMAC1SUPPCLR     /* 0xBF843264 */
  .extern EMACxSUPPCLR     /* 0xBF843264 */
  .extern EMAC1SUPPSET     /* 0xBF843268 */
  .extern EMACxSUPPSET     /* 0xBF843268 */
  .extern EMAC1SUPPINV     /* 0xBF84326C */
  .extern EMACxSUPPINV     /* 0xBF84326C */
  .extern EMAC1TEST        /* 0xBF843270 */
  .extern EMACxTEST        /* 0xBF843270 */
  .extern EMAC1TESTCLR     /* 0xBF843274 */
  .extern EMACxTESTCLR     /* 0xBF843274 */
  .extern EMAC1TESTSET     /* 0xBF843278 */
  .extern EMACxTESTSET     /* 0xBF843278 */
  .extern EMAC1TESTINV     /* 0xBF84327C */
  .extern EMACxTESTINV     /* 0xBF84327C */
  .extern EMAC1MCFG        /* 0xBF843280 */
  .extern EMACxMCFG        /* 0xBF843280 */
  .extern EMAC1MCFGCLR     /* 0xBF843284 */
  .extern EMACxMCFGCLR     /* 0xBF843284 */
  .extern EMAC1MCFGSET     /* 0xBF843288 */
  .extern EMACxMCFGSET     /* 0xBF843288 */
  .extern EMAC1MCFGINV     /* 0xBF84328C */
  .extern EMACxMCFGINV     /* 0xBF84328C */
  .extern EMAC1MCMD        /* 0xBF843290 */
  .extern EMACxMCMD        /* 0xBF843290 */
  .extern EMAC1MCMDCLR     /* 0xBF843294 */
  .extern EMACxMCMDCLR     /* 0xBF843294 */
  .extern EMAC1MCMDSET     /* 0xBF843298 */
  .extern EMACxMCMDSET     /* 0xBF843298 */
  .extern EMAC1MCMDINV     /* 0xBF84329C */
  .extern EMACxMCMDINV     /* 0xBF84329C */
  .extern EMAC1MADR        /* 0xBF8432A0 */
  .extern EMACxMADR        /* 0xBF8432A0 */
  .extern EMAC1MADRCLR     /* 0xBF8432A4 */
  .extern EMACxMADRCLR     /* 0xBF8432A4 */
  .extern EMAC1MADRSET     /* 0xBF8432A8 */
  .extern EMACxMADRSET     /* 0xBF8432A8 */
  .extern EMAC1MADRINV     /* 0xBF8432AC */
  .extern EMACxMADRINV     /* 0xBF8432AC */
  .extern EMAC1MWTD        /* 0xBF8432B0 */
  .extern EMACxMWTD        /* 0xBF8432B0 */
  .extern EMAC1MWTDCLR     /* 0xBF8432B4 */
  .extern EMACxMWTDCLR     /* 0xBF8432B4 */
  .extern EMAC1MWTDSET     /* 0xBF8432B8 */
  .extern EMACxMWTDSET     /* 0xBF8432B8 */
  .extern EMAC1MWTDINV     /* 0xBF8432BC */
  .extern EMACxMWTDINV     /* 0xBF8432BC */
  .extern EMAC1MRDD        /* 0xBF8432C0 */
  .extern EMACxMRDD        /* 0xBF8432C0 */
  .extern EMAC1MRDDCLR     /* 0xBF8432C4 */
  .extern EMACxMRDDCLR     /* 0xBF8432C4 */
  .extern EMAC1MRDDSET     /* 0xBF8432C8 */
  .extern EMACxMRDDSET     /* 0xBF8432C8 */
  .extern EMAC1MRDDINV     /* 0xBF8432CC */
  .extern EMACxMRDDINV     /* 0xBF8432CC */
  .extern EMAC1MIND        /* 0xBF8432D0 */
  .extern EMACxMIND        /* 0xBF8432D0 */
  .extern EMAC1MINDCLR     /* 0xBF8432D4 */
  .extern EMACxMINDCLR     /* 0xBF8432D4 */
  .extern EMAC1MINDSET     /* 0xBF8432D8 */
  .extern EMACxMINDSET     /* 0xBF8432D8 */
  .extern EMAC1MINDINV     /* 0xBF8432DC */
  .extern EMACxMINDINV     /* 0xBF8432DC */
  .extern EMAC1SA0         /* 0xBF843300 */
  .extern EMACxSA0         /* 0xBF843300 */
  .extern EMAC1SA0CLR      /* 0xBF843304 */
  .extern EMACxSA0CLR      /* 0xBF843304 */
  .extern EMAC1SA0SET      /* 0xBF843308 */
  .extern EMACxSA0SET      /* 0xBF843308 */
  .extern EMAC1SA0INV      /* 0xBF84330C */
  .extern EMACxSA0INV      /* 0xBF84330C */
  .extern EMAC1SA1         /* 0xBF843310 */
  .extern EMACxSA1         /* 0xBF843310 */
  .extern EMAC1SA1CLR      /* 0xBF843314 */
  .extern EMACxSA1CLR      /* 0xBF843314 */
  .extern EMAC1SA1SET      /* 0xBF843318 */
  .extern EMACxSA1SET      /* 0xBF843318 */
  .extern EMAC1SA1INV      /* 0xBF84331C */
  .extern EMACxSA1INV      /* 0xBF84331C */
  .extern EMAC1SA2         /* 0xBF843320 */
  .extern EMACxSA2         /* 0xBF843320 */
  .extern EMAC1SA2CLR      /* 0xBF843324 */
  .extern EMACxSA2CLR      /* 0xBF843324 */
  .extern EMAC1SA2SET      /* 0xBF843328 */
  .extern EMACxSA2SET      /* 0xBF843328 */
  .extern EMAC1SA2INV      /* 0xBF84332C */
  .extern EMACxSA2INV      /* 0xBF84332C */
  .extern U1OTGIR          /* 0xBF844040 */
  .extern U1OTGIRCLR       /* 0xBF844044 */
  .extern U1OTGIE          /* 0xBF844050 */
  .extern U1OTGIECLR       /* 0xBF844054 */
  .extern U1OTGIESET       /* 0xBF844058 */
  .extern U1OTGIEINV       /* 0xBF84405C */
  .extern U1OTGSTAT        /* 0xBF844060 */
  .extern U1OTGCON         /* 0xBF844070 */
  .extern U1OTGCONCLR      /* 0xBF844074 */
  .extern U1OTGCONSET      /* 0xBF844078 */
  .extern U1OTGCONINV      /* 0xBF84407C */
  .extern U1PWRC           /* 0xBF844080 */
  .extern U1PWRCCLR        /* 0xBF844084 */
  .extern U1PWRCSET        /* 0xBF844088 */
  .extern U1PWRCINV        /* 0xBF84408C */
  .extern U1IR             /* 0xBF844200 */
  .extern U1IRCLR          /* 0xBF844204 */
  .extern U1IE             /* 0xBF844210 */
  .extern U1IECLR          /* 0xBF844214 */
  .extern U1IESET          /* 0xBF844218 */
  .extern U1IEINV          /* 0xBF84421C */
