Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
  .extern U1EIR            /* 0xBF844220 */
  .extern U1EIRCLR         /* 0xBF844224 */
  .extern U1EIE            /* 0xBF844230 */
  .extern U1EIECLR         /* 0xBF844234 */
  .extern U1EIESET         /* 0xBF844238 */
  .extern U1EIEINV         /* 0xBF84423C */
  .extern U1STAT           /* 0xBF844240 */
  .extern U1CON            /* 0xBF844250 */
  .extern U1CONCLR         /* 0xBF844254 */
  .extern U1CONSET         /* 0xBF844258 */
  .extern U1CONINV         /* 0xBF84425C */
  .extern U1ADDR           /* 0xBF844260 */
  .extern U1ADDRCLR        /* 0xBF844264 */
  .extern U1ADDRSET        /* 0xBF844268 */
  .extern U1ADDRINV        /* 0xBF84426C */
  .extern U1BDTP1          /* 0xBF844270 */
  .extern U1BDTP1CLR       /* 0xBF844274 */
  .extern U1BDTP1SET       /* 0xBF844278 */
  .extern U1BDTP1INV       /* 0xBF84427C */
  .extern U1FRML           /* 0xBF844280 */
  .extern U1FRMH           /* 0xBF844290 */
  .extern U1TOK            /* 0xBF8442A0 */
  .extern U1TOKCLR         /* 0xBF8442A4 */
  .extern U1TOKSET         /* 0xBF8442A8 */
  .extern U1TOKINV         /* 0xBF8442AC */
  .extern U1SOF            /* 0xBF8442B0 */
  .extern U1SOFCLR         /* 0xBF8442B4 */
  .extern U1SOFSET         /* 0xBF8442B8 */
  .extern U1SOFINV         /* 0xBF8442BC */
  .extern U1BDTP2          /* 0xBF8442C0 */
  .extern U1BDTP2CLR       /* 0xBF8442C4 */
  .extern U1BDTP2SET       /* 0xBF8442C8 */
  .extern U1BDTP2INV       /* 0xBF8442CC */
  .extern U1BDTP3          /* 0xBF8442D0 */
  .extern U1BDTP3CLR       /* 0xBF8442D4 */
  .extern U1BDTP3SET       /* 0xBF8442D8 */
  .extern U1BDTP3INV       /* 0xBF8442DC */
  .extern U1CNFG1          /* 0xBF8442E0 */
  .extern U1CNFG1CLR       /* 0xBF8442E4 */
  .extern U1CNFG1SET       /* 0xBF8442E8 */
  .extern U1CNFG1INV       /* 0xBF8442EC */
  .extern U1EP0            /* 0xBF844300 */
  .extern U1EP0CLR         /* 0xBF844304 */
  .extern U1EP0SET         /* 0xBF844308 */
  .extern U1EP0INV         /* 0xBF84430C */
  .extern U1EP1            /* 0xBF844310 */
  .extern U1EP1CLR         /* 0xBF844314 */
  .extern U1EP1SET         /* 0xBF844318 */
  .extern U1EP1INV         /* 0xBF84431C */
  .extern U1EP2            /* 0xBF844320 */
  .extern U1EP2CLR         /* 0xBF844324 */
  .extern U1EP2SET         /* 0xBF844328 */
  .extern U1EP2INV         /* 0xBF84432C */
  .extern U1EP3            /* 0xBF844330 */
  .extern U1EP3CLR         /* 0xBF844334 */
  .extern U1EP3SET         /* 0xBF844338 */
  .extern U1EP3INV         /* 0xBF84433C */
  .extern U1EP4            /* 0xBF844340 */
  .extern U1EP4CLR         /* 0xBF844344 */
  .extern U1EP4SET         /* 0xBF844348 */
  .extern U1EP4INV         /* 0xBF84434C */
  .extern U1EP5            /* 0xBF844350 */
  .extern U1EP5CLR         /* 0xBF844354 */
  .extern U1EP5SET         /* 0xBF844358 */
  .extern U1EP5INV         /* 0xBF84435C */
  .extern U1EP6            /* 0xBF844360 */
  .extern U1EP6CLR         /* 0xBF844364 */
  .extern U1EP6SET         /* 0xBF844368 */
  .extern U1EP6INV         /* 0xBF84436C */
  .extern U1EP7            /* 0xBF844370 */
  .extern U1EP7CLR         /* 0xBF844374 */
  .extern U1EP7SET         /* 0xBF844378 */
  .extern U1EP7INV         /* 0xBF84437C */
  .extern U1EP8            /* 0xBF844380 */
  .extern U1EP8CLR         /* 0xBF844384 */
  .extern U1EP8SET         /* 0xBF844388 */
  .extern U1EP8INV         /* 0xBF84438C */
  .extern U1EP9            /* 0xBF844390 */
  .extern U1EP9CLR         /* 0xBF844394 */
  .extern U1EP9SET         /* 0xBF844398 */
  .extern U1EP9INV         /* 0xBF84439C */
  .extern U1EP10           /* 0xBF8443A0 */
  .extern U1EP10CLR        /* 0xBF8443A4 */
  .extern U1EP10SET        /* 0xBF8443A8 */
  .extern U1EP10INV        /* 0xBF8443AC */
  .extern U1EP11           /* 0xBF8443B0 */
  .extern U1EP11CLR        /* 0xBF8443B4 */
  .extern U1EP11SET        /* 0xBF8443B8 */
  .extern U1EP11INV        /* 0xBF8443BC */
  .extern U1EP12           /* 0xBF8443C0 */
  .extern U1EP12CLR        /* 0xBF8443C4 */
  .extern U1EP12SET        /* 0xBF8443C8 */
  .extern U1EP12INV        /* 0xBF8443CC */
  .extern U1EP13           /* 0xBF8443D0 */
  .extern U1EP13CLR        /* 0xBF8443D4 */
  .extern U1EP13SET        /* 0xBF8443D8 */
  .extern U1EP13INV        /* 0xBF8443DC */
  .extern U1EP14           /* 0xBF8443E0 */
  .extern U1EP14CLR        /* 0xBF8443E4 */
  .extern U1EP14SET        /* 0xBF8443E8 */
  .extern U1EP14INV        /* 0xBF8443EC */
  .extern U1EP15           /* 0xBF8443F0 */
  .extern U1EP15CLR        /* 0xBF8443F4 */
  .extern U1EP15SET        /* 0xBF8443F8 */
  .extern U1EP15INV        /* 0xBF8443FC */
  .extern RTCCON           /* 0xBF870000 */
  .extern RTCCONCLR        /* 0xBF870004 */
  .extern RTCCONSET        /* 0xBF870008 */
  .extern RTCCONINV        /* 0xBF87000C */
  .extern RTCALRM          /* 0xBF870010 */
  .extern RTCALRMCLR       /* 0xBF870014 */
  .extern RTCALRMSET       /* 0xBF870018 */
  .extern RTCALRMINV       /* 0xBF87001C */
  .extern RTCTIME          /* 0xBF870020 */
  .extern RTCTIMECLR       /* 0xBF870024 */
  .extern RTCTIMESET       /* 0xBF870028 */
  .extern RTCTIMEINV       /* 0xBF87002C */
  .extern RTCDATE          /* 0xBF870030 */
  .extern RTCDATECLR       /* 0xBF870034 */
  .extern RTCDATESET       /* 0xBF870038 */
  .extern RTCDATEINV       /* 0xBF87003C */
  .extern ALRMTIME         /* 0xBF870040 */
  .extern ALRMTIMECLR      /* 0xBF870044 */
  .extern ALRMTIMESET      /* 0xBF870048 */
  .extern ALRMTIMEINV      /* 0xBF87004C */
  .extern ALRMDATE         /* 0xBF870050 */
  .extern ALRMDATECLR      /* 0xBF870054 */
  .extern ALRMDATESET      /* 0xBF870058 */
  .extern ALRMDATEINV      /* 0xBF87005C */
  .extern DSCON            /* 0xBF871000 */
  .extern DSWAKE           /* 0xBF871004 */
  .extern DSGPR0           /* 0xBF871008 */
  .extern DSGPR1           /* 0xBF871010 */
  .extern DSGPR2           /* 0xBF871014 */
  .extern DSGPR3           /* 0xBF871018 */
  .extern DSGPR4           /* 0xBF87101C */
  .extern DSGPR5           /* 0xBF871020 */
  .extern DSGPR6           /* 0xBF871024 */
  .extern DSGPR7           /* 0xBF871028 */
  .extern DSGPR8           /* 0xBF87102C */
  .extern DSGPR9           /* 0xBF871030 */
  .extern DSGPR10          /* 0xBF871034 */
  .extern DSGPR11          /* 0xBF871038 */
  .extern DSGPR12          /* 0xBF87103C */
  .extern DSGPR13          /* 0xBF871040 */
  .extern DSGPR14          /* 0xBF871044 */
  .extern DSGPR15          /* 0xBF871048 */
  .extern DSGPR16          /* 0xBF87104C */
  .extern DSGPR17          /* 0xBF871050 */
  .extern DSGPR18          /* 0xBF871054 */
  .extern DSGPR19          /* 0xBF871058 */
  .extern DSGPR20          /* 0xBF87105C */
  .extern DSGPR21          /* 0xBF871060 */
  .extern DSGPR22          /* 0xBF871064 */
  .extern DSGPR23          /* 0xBF871068 */
  .extern DSGPR24          /* 0xBF87106C */
  .extern DSGPR25          /* 0xBF871070 */
  .extern DSGPR26          /* 0xBF871074 */
  .extern DSGPR27          /* 0xBF871078 */
  .extern DSGPR28          /* 0xBF87107C */
  .extern DSGPR29          /* 0xBF871080 */
  .extern DSGPR30          /* 0xBF871084 */
  .extern DSGPR31          /* 0xBF871088 */
  .extern DSGPR32          /* 0xBF87108C */
  .extern SQI1XCON1        /* 0xBF8E1000 */
  .extern SQI1XCON2        /* 0xBF8E1004 */
  .extern SQI1CFG          /* 0xBF8E1008 */
  .extern SQI1CON          /* 0xBF8E100C */
  .extern SQI1CLKCON       /* 0xBF8E1010 */
  .extern SQI1CMDTHR       /* 0xBF8E1014 */
  .extern SQI1INTTHR       /* 0xBF8E1018 */
  .extern SQI1INTEN        /* 0xBF8E101C */
  .extern SQI1INTSTAT      /* 0xBF8E1020 */
  .extern SQI1TXDATA       /* 0xBF8E1024 */
  .extern SQI1RXDATA       /* 0xBF8E1028 */
  .extern SQI1STAT1        /* 0xBF8E102C */
  .extern SQI1STAT2        /* 0xBF8E1030 */
  .extern SQI1BDCON        /* 0xBF8E1034 */
  .extern SQI1BDCURADD     /* 0xBF8E1038 */
  .extern SQI1BDBASEADD    /* 0xBF8E1040 */
  .extern SQI1BDSTAT       /* 0xBF8E1044 */
  .extern SQI1BDPOLLCON    /* 0xBF8E1048 */
  .extern SQI1BDTXDSTAT    /* 0xBF8E104C */
  .extern SQI1BDRXDSTAT    /* 0xBF8E1050 */
  .extern SQI1THR          /* 0xBF8E1054 */
  .extern SQI1INTSIGEN     /* 0xBF8E1058 */
  .extern SQI1TAPCON       /* 0xBF8E105C */
  .extern SQI1MEMSTAT      /* 0xBF8E1060 */
  .extern SQI1XCON3        /* 0xBF8E1064 */
  .extern SQI1XCON4        /* 0xBF8E1068 */
  .extern CEVER            /* 0xBF8E4000 */
  .extern CECON            /* 0xBF8E4004 */
  .extern CEBDADDR         /* 0xBF8E4008 */
  .extern CEBDPADDR        /* 0xBF8E400C */
  .extern CESTAT           /* 0xBF8E4010 */
  .extern CEINTSRC         /* 0xBF8E4014 */
  .extern CEINTEN          /* 0xBF8E4018 */
  .extern CEPOLLCON        /* 0xBF8E401C */
  .extern CEHDLEN          /* 0xBF8E4020 */
  .extern CETRLLEN         /* 0xBF8E4024 */
  .extern CEDTXSTAT        /* 0xBF8E4028 */
  .extern CEDRXSTAT        /* 0xBF8E402C */
  .extern CEDCRYPTOADDR    /* 0xBF8E4030 */
  .extern CEDHASHADDR      /* 0xBF8E4034 */
  .extern CEDTXADDR        /* 0xBF8E4038 */
  .extern CEDML0ADDR       /* 0xBF8E403C */
  .extern CEDML1ADDR       /* 0xBF8E4040 */
  .extern CEDOL0ADDR       /* 0xBF8E4044 */
  .extern CEDCSTADDDR      /* 0xBF8E4048 */
  .extern CEDMTSKADDR      /* 0xBF8E404C */
  .extern CEDSACON         /* 0xBF8E4050 */
  .extern CEDCSTATE        /* 0xBF8E4054 */
  .extern CEDTXBCNT        /* 0xBF8E4058 */
  .extern CEDRXBCNT        /* 0xBF8E405C */
  .extern CEREV            /* 0xBF8E4060 */
  .extern RNGVER           /* 0xBF8E5000 */
  .extern RNGCON           /* 0xBF8E5004 */
  .extern RNGPOLY1         /* 0xBF8E5008 */
  .extern RNGPOLY2         /* 0xBF8E500C */
  .extern RNGNUMGEN1       /* 0xBF8E5010 */
  .extern RNGNUMGEN2       /* 0xBF8E5014 */
  .extern RNGSEED1         /* 0xBF8E5018 */
  .extern RNGSEED2         /* 0xBF8E501C */
  .extern RNGCNT           /* 0xBF8E5020 */
  .extern PKCONFIG         /* 0xBF920000 */
  .extern PKCOMMAND        /* 0xBF920004 */
  .extern PKCONTROL        /* 0xBF920008 */
  .extern PKSTATUS         /* 0xBF92000C */
  .extern PKVERSION        /* 0xBF920010 */
  .extern FUSERID          /* 0xBFC55F88 */
  .extern DEVCFG4          /* 0xBFC55F8C */
  .extern DEVCFG2          /* 0xBFC55F90 */
  .extern DEVCFG1          /* 0xBFC55F94 */
  .extern DEVCFG0          /* 0xBFC55F98 */
  .extern FBCFG0           /* 0xBFC55F9C */
  .extern FCPN0            /* 0xBFC55FBC */
  .extern AFUSERID         /* 0xBFC55E88 */
  .extern ADEVCFG4         /* 0xBFC55E8C */
  .extern ADEVCFG2         /* 0xBFC55E90 */
  .extern ADEVCFG1         /* 0xBFC55E94 */
  .extern ADEVCFG0         /* 0xBFC55E98 */
  .extern AFBCFG0          /* 0xBFC55E9C */
  .extern AFCPN0           /* 0xBFC55EBC */
#else
#error Unknown language!
#endif

#define _CFGCON0_TDOEN_POSITION                  0x00000000
#define _CFGCON0_TDOEN_MASK                      0x00000001
#define _CFGCON0_TDOEN_LENGTH                    0x00000001

#define _CFGCON0_TROEN_POSITION                  0x00000002
#define _CFGCON0_TROEN_MASK                      0x00000004
#define _CFGCON0_TROEN_LENGTH                    0x00000001

#define _CFGCON0_JTAGEN_POSITION                 0x00000003
#define _CFGCON0_JTAGEN_MASK                     0x00000008
#define _CFGCON0_JTAGEN_LENGTH                   0x00000001

