Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _PMD3_SPI2MD_POSITION                    0x00000009
#define _PMD3_SPI2MD_MASK                        0x00000200
#define _PMD3_SPI2MD_LENGTH                      0x00000001

#define _PMD3_W24GMD_POSITION                    0x0000000C
#define _PMD3_W24GMD_MASK                        0x00001000
#define _PMD3_W24GMD_LENGTH                      0x00000001

#define _PMD3_I2C1MD_POSITION                    0x00000010
#define _PMD3_I2C1MD_MASK                        0x00010000
#define _PMD3_I2C1MD_LENGTH                      0x00000001

#define _PMD3_I2C2MD_POSITION                    0x00000011
#define _PMD3_I2C2MD_MASK                        0x00020000
#define _PMD3_I2C2MD_LENGTH                      0x00000001

#define _PMD3_USB1MD_POSITION                    0x00000018
#define _PMD3_USB1MD_MASK                        0x01000000
#define _PMD3_USB1MD_LENGTH                      0x00000001

#define _PMD3_CAN1MD_POSITION                    0x0000001B
#define _PMD3_CAN1MD_MASK                        0x08000000
#define _PMD3_CAN1MD_LENGTH                      0x00000001

#define _PMD3_CAN2MD_POSITION                    0x0000001C
#define _PMD3_CAN2MD_MASK                        0x10000000
#define _PMD3_CAN2MD_LENGTH                      0x00000001

#define _BCFG0_BUHSW_POSITION                    0x00000000
#define _BCFG0_BUHSW_MASK                        0x00000001
#define _BCFG0_BUHSW_LENGTH                      0x00000001

#define _BCFG0_PCSCMODE_POSITION                 0x00000001
#define _BCFG0_PCSCMODE_MASK                     0x00000002
#define _BCFG0_PCSCMODE_LENGTH                   0x00000001

#define _BCFG0_BOOTISA_POSITION                  0x00000003
#define _BCFG0_BOOTISA_MASK                      0x00000008
#define _BCFG0_BOOTISA_LENGTH                    0x00000001

#define _BCFG0_CP_POSITION                       0x0000001C
#define _BCFG0_CP_MASK                           0x10000000
#define _BCFG0_CP_LENGTH                         0x00000001

#define _BCFG0_SIGN_POSITION                     0x0000001D
#define _BCFG0_SIGN_MASK                         0x20000000
#define _BCFG0_SIGN_LENGTH                       0x00000001

#define _BCFG0_BINFOVALID0_POSITION              0x0000001F
#define _BCFG0_BINFOVALID0_MASK                  0x80000000
#define _BCFG0_BINFOVALID0_LENGTH                0x00000001

#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_HTDPGM_POSITION                  0x00000008
#define _NVMCON_HTDPGM_MASK                      0x00000100
#define _NVMCON_HTDPGM_LENGTH                    0x00000001

#define _NVMCON_LVDERR_POSITION                  0x0000000C
#define _NVMCON_LVDERR_MASK                      0x00001000
#define _NVMCON_LVDERR_LENGTH                    0x00000001

#define _NVMCON_WRERR_POSITION                   0x0000000D
#define _NVMCON_WRERR_MASK                       0x00002000
#define _NVMCON_WRERR_LENGTH                     0x00000001

#define _NVMCON_WREN_POSITION                    0x0000000E
#define _NVMCON_WREN_MASK                        0x00004000
#define _NVMCON_WREN_LENGTH                      0x00000001

#define _NVMCON_WR_POSITION                      0x0000000F
#define _NVMCON_WR_MASK                          0x00008000
#define _NVMCON_WR_LENGTH                        0x00000001

#define _NVMCON2_PREPG_POSITION                  0x00000000
#define _NVMCON2_PREPG_MASK                      0x00000001
#define _NVMCON2_PREPG_LENGTH                    0x00000001

#define _NVMCON2_SWAPLK_POSITION                 0x00000006
#define _NVMCON2_SWAPLK_MASK                     0x000000C0
#define _NVMCON2_SWAPLK_LENGTH                   0x00000002

#define _NVMCON2_RETRY_POSITION                  0x00000008
#define _NVMCON2_RETRY_MASK                      0x00000300
#define _NVMCON2_RETRY_LENGTH                    0x00000002

#define _NVMCON2_VREAD1_POSITION                 0x0000000C
#define _NVMCON2_VREAD1_MASK                     0x00001000
#define _NVMCON2_VREAD1_LENGTH                   0x00000001

#define _NVMCON2_CREAD1_POSITION                 0x0000000D
#define _NVMCON2_CREAD1_MASK                     0x00002000
#define _NVMCON2_CREAD1_LENGTH                   0x00000001

#define _NVMCON2_TEMP_POSITION                   0x0000000E
#define _NVMCON2_TEMP_MASK                       0x00004000
#define _NVMCON2_TEMP_LENGTH                     0x00000001

#define _NVMCON2_WS_POSITION                     0x00000010
#define _NVMCON2_WS_MASK                         0x001F0000
#define _NVMCON2_WS_LENGTH                       0x00000005

#define _NVMCON2_SLEEP_POSITION                  0x00000018
#define _NVMCON2_SLEEP_MASK                      0x01000000
#define _NVMCON2_SLEEP_LENGTH                    0x00000001

#define _NVMCON2_ERS_POSITION                    0x0000001C
#define _NVMCON2_ERS_MASK                        0xF0000000
#define _NVMCON2_ERS_LENGTH                      0x00000004

#define _NVMPWPLT_PWPLT_POSITION                 0x00000000
#define _NVMPWPLT_PWPLT_MASK                     0x00FFFFFF
#define _NVMPWPLT_PWPLT_LENGTH                   0x00000018

#define _NVMPWPLT_ULOCK_POSITION                 0x0000001F
#define _NVMPWPLT_ULOCK_MASK                     0x80000000
#define _NVMPWPLT_ULOCK_LENGTH                   0x00000001

#define _NVMPWPGTE_PWPGTE_POSITION               0x00000000
#define _NVMPWPGTE_PWPGTE_MASK                   0x00FFFFFF
#define _NVMPWPGTE_PWPGTE_LENGTH                 0x00000018

#define _NVMPWPGTE_ULOCK_POSITION                0x0000001F
#define _NVMPWPGTE_ULOCK_MASK                    0x80000000
#define _NVMPWPGTE_ULOCK_LENGTH                  0x00000001

#define _NVMLBWP_LBWP0_POSITION                  0x00000000
#define _NVMLBWP_LBWP0_MASK                      0x00000001
#define _NVMLBWP_LBWP0_LENGTH                    0x00000001

#define _NVMLBWP_LBWP1_POSITION                  0x00000001
#define _NVMLBWP_LBWP1_MASK                      0x00000002
#define _NVMLBWP_LBWP1_LENGTH                    0x00000001

#define _NVMLBWP_LBWP2_POSITION                  0x00000002
#define _NVMLBWP_LBWP2_MASK                      0x00000004
#define _NVMLBWP_LBWP2_LENGTH                    0x00000001

#define _NVMLBWP_LBWP3_POSITION                  0x00000003
#define _NVMLBWP_LBWP3_MASK                      0x00000008
#define _NVMLBWP_LBWP3_LENGTH                    0x00000001

#define _NVMLBWP_LBWP4_POSITION                  0x00000004
#define _NVMLBWP_LBWP4_MASK                      0x00000010
#define _NVMLBWP_LBWP4_LENGTH                    0x00000001

#define _NVMLBWP_LBWP5_POSITION                  0x00000005
#define _NVMLBWP_LBWP5_MASK                      0x00000020
#define _NVMLBWP_LBWP5_LENGTH                    0x00000001

#define _NVMLBWP_LBWP6_POSITION                  0x00000006
#define _NVMLBWP_LBWP6_MASK                      0x00000040
#define _NVMLBWP_LBWP6_LENGTH                    0x00000001

#define _NVMLBWP_LBWP7_POSITION                  0x00000007
#define _NVMLBWP_LBWP7_MASK                      0x00000080
#define _NVMLBWP_LBWP7_LENGTH                    0x00000001

