Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _NVMLBWP_LBWP8_POSITION                  0x00000008
#define _NVMLBWP_LBWP8_MASK                      0x00000100
#define _NVMLBWP_LBWP8_LENGTH                    0x00000001

#define _NVMLBWP_LBWP9_POSITION                  0x00000009
#define _NVMLBWP_LBWP9_MASK                      0x00000200
#define _NVMLBWP_LBWP9_LENGTH                    0x00000001

#define _NVMLBWP_LBWP10_POSITION                 0x0000000A
#define _NVMLBWP_LBWP10_MASK                     0x00000400
#define _NVMLBWP_LBWP10_LENGTH                   0x00000001

#define _NVMLBWP_LBWP11_POSITION                 0x0000000B
#define _NVMLBWP_LBWP11_MASK                     0x00000800
#define _NVMLBWP_LBWP11_LENGTH                   0x00000001

#define _NVMLBWP_LBWP12_POSITION                 0x0000000C
#define _NVMLBWP_LBWP12_MASK                     0x00001000
#define _NVMLBWP_LBWP12_LENGTH                   0x00000001

#define _NVMLBWP_LBWP13_POSITION                 0x0000000D
#define _NVMLBWP_LBWP13_MASK                     0x00002000
#define _NVMLBWP_LBWP13_LENGTH                   0x00000001

#define _NVMLBWP_LBWP14_POSITION                 0x0000000E
#define _NVMLBWP_LBWP14_MASK                     0x00004000
#define _NVMLBWP_LBWP14_LENGTH                   0x00000001

#define _NVMLBWP_LBWP15_POSITION                 0x0000000F
#define _NVMLBWP_LBWP15_MASK                     0x00008000
#define _NVMLBWP_LBWP15_LENGTH                   0x00000001

#define _NVMLBWP_LBWP16_POSITION                 0x00000010
#define _NVMLBWP_LBWP16_MASK                     0x00010000
#define _NVMLBWP_LBWP16_LENGTH                   0x00000001

#define _NVMLBWP_LBWP17_POSITION                 0x00000011
#define _NVMLBWP_LBWP17_MASK                     0x00020000
#define _NVMLBWP_LBWP17_LENGTH                   0x00000001

#define _NVMLBWP_LBWP18_POSITION                 0x00000012
#define _NVMLBWP_LBWP18_MASK                     0x00040000
#define _NVMLBWP_LBWP18_LENGTH                   0x00000001

#define _NVMLBWP_LBWP19_POSITION                 0x00000013
#define _NVMLBWP_LBWP19_MASK                     0x00080000
#define _NVMLBWP_LBWP19_LENGTH                   0x00000001

#define _NVMLBWP_LBWP20_POSITION                 0x00000014
#define _NVMLBWP_LBWP20_MASK                     0x00100000
#define _NVMLBWP_LBWP20_LENGTH                   0x00000001

#define _NVMLBWP_LBWP21_POSITION                 0x00000015
#define _NVMLBWP_LBWP21_MASK                     0x00200000
#define _NVMLBWP_LBWP21_LENGTH                   0x00000001

#define _NVMLBWP_LBWP22_POSITION                 0x00000016
#define _NVMLBWP_LBWP22_MASK                     0x00400000
#define _NVMLBWP_LBWP22_LENGTH                   0x00000001

#define _NVMLBWP_LBWP23_POSITION                 0x00000017
#define _NVMLBWP_LBWP23_MASK                     0x00800000
#define _NVMLBWP_LBWP23_LENGTH                   0x00000001

#define _NVMLBWP_ULOCK_POSITION                  0x0000001F
#define _NVMLBWP_ULOCK_MASK                      0x80000000
#define _NVMLBWP_ULOCK_LENGTH                    0x00000001

#define _NVMUBWP_UBWP0_POSITION                  0x00000000
#define _NVMUBWP_UBWP0_MASK                      0x00000001
#define _NVMUBWP_UBWP0_LENGTH                    0x00000001

#define _NVMUBWP_UBWP1_POSITION                  0x00000001
#define _NVMUBWP_UBWP1_MASK                      0x00000002
#define _NVMUBWP_UBWP1_LENGTH                    0x00000001

#define _NVMUBWP_UBWP2_POSITION                  0x00000002
#define _NVMUBWP_UBWP2_MASK                      0x00000004
#define _NVMUBWP_UBWP2_LENGTH                    0x00000001

#define _NVMUBWP_UBWP3_POSITION                  0x00000003
#define _NVMUBWP_UBWP3_MASK                      0x00000008
#define _NVMUBWP_UBWP3_LENGTH                    0x00000001

#define _NVMUBWP_UBWP4_POSITION                  0x00000004
#define _NVMUBWP_UBWP4_MASK                      0x00000010
#define _NVMUBWP_UBWP4_LENGTH                    0x00000001

#define _NVMUBWP_UBWP5_POSITION                  0x00000005
#define _NVMUBWP_UBWP5_MASK                      0x00000020
#define _NVMUBWP_UBWP5_LENGTH                    0x00000001

#define _NVMUBWP_UBWP6_POSITION                  0x00000006
#define _NVMUBWP_UBWP6_MASK                      0x00000040
#define _NVMUBWP_UBWP6_LENGTH                    0x00000001

#define _NVMUBWP_UBWP7_POSITION                  0x00000007
#define _NVMUBWP_UBWP7_MASK                      0x00000080
#define _NVMUBWP_UBWP7_LENGTH                    0x00000001

#define _NVMUBWP_UBWP8_POSITION                  0x00000008
#define _NVMUBWP_UBWP8_MASK                      0x00000100
#define _NVMUBWP_UBWP8_LENGTH                    0x00000001

#define _NVMUBWP_UBWP9_POSITION                  0x00000009
#define _NVMUBWP_UBWP9_MASK                      0x00000200
#define _NVMUBWP_UBWP9_LENGTH                    0x00000001

#define _NVMUBWP_UBWP10_POSITION                 0x0000000A
#define _NVMUBWP_UBWP10_MASK                     0x00000400
#define _NVMUBWP_UBWP10_LENGTH                   0x00000001

#define _NVMUBWP_UBWP11_POSITION                 0x0000000B
#define _NVMUBWP_UBWP11_MASK                     0x00000800
#define _NVMUBWP_UBWP11_LENGTH                   0x00000001

#define _NVMUBWP_UBWP12_POSITION                 0x0000000C
#define _NVMUBWP_UBWP12_MASK                     0x00001000
#define _NVMUBWP_UBWP12_LENGTH                   0x00000001

#define _NVMUBWP_UBWP13_POSITION                 0x0000000D
#define _NVMUBWP_UBWP13_MASK                     0x00002000
#define _NVMUBWP_UBWP13_LENGTH                   0x00000001

#define _NVMUBWP_UBWP14_POSITION                 0x0000000E
#define _NVMUBWP_UBWP14_MASK                     0x00004000
#define _NVMUBWP_UBWP14_LENGTH                   0x00000001

#define _NVMUBWP_UBWP15_POSITION                 0x0000000F
#define _NVMUBWP_UBWP15_MASK                     0x00008000
#define _NVMUBWP_UBWP15_LENGTH                   0x00000001

#define _NVMUBWP_UBWP16_POSITION                 0x00000010
#define _NVMUBWP_UBWP16_MASK                     0x00010000
#define _NVMUBWP_UBWP16_LENGTH                   0x00000001

#define _NVMUBWP_UBWP17_POSITION                 0x00000011
#define _NVMUBWP_UBWP17_MASK                     0x00020000
#define _NVMUBWP_UBWP17_LENGTH                   0x00000001

#define _NVMUBWP_UBWP18_POSITION                 0x00000012
#define _NVMUBWP_UBWP18_MASK                     0x00040000
#define _NVMUBWP_UBWP18_LENGTH                   0x00000001

