Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _NVMUBWP_UBWP19_POSITION                 0x00000013
#define _NVMUBWP_UBWP19_MASK                     0x00080000
#define _NVMUBWP_UBWP19_LENGTH                   0x00000001

#define _NVMUBWP_UBWP20_POSITION                 0x00000014
#define _NVMUBWP_UBWP20_MASK                     0x00100000
#define _NVMUBWP_UBWP20_LENGTH                   0x00000001

#define _NVMUBWP_UBWP21_POSITION                 0x00000015
#define _NVMUBWP_UBWP21_MASK                     0x00200000
#define _NVMUBWP_UBWP21_LENGTH                   0x00000001

#define _NVMUBWP_UBWP22_POSITION                 0x00000016
#define _NVMUBWP_UBWP22_MASK                     0x00400000
#define _NVMUBWP_UBWP22_LENGTH                   0x00000001

#define _NVMUBWP_UBWP23_POSITION                 0x00000017
#define _NVMUBWP_UBWP23_MASK                     0x00800000
#define _NVMUBWP_UBWP23_LENGTH                   0x00000001

#define _NVMUBWP_ULOCK_POSITION                  0x0000001F
#define _NVMUBWP_ULOCK_MASK                      0x80000000
#define _NVMUBWP_ULOCK_LENGTH                    0x00000001

#define _WDTCON_WDTWINEN_POSITION                0x00000000
#define _WDTCON_WDTWINEN_MASK                    0x00000001
#define _WDTCON_WDTWINEN_LENGTH                  0x00000001

#define _WDTCON_SLPDIV_POSITION                  0x00000001
#define _WDTCON_SLPDIV_MASK                      0x0000003E
#define _WDTCON_SLPDIV_LENGTH                    0x00000005

#define _WDTCON_CLKSEL_POSITION                  0x00000006
#define _WDTCON_CLKSEL_MASK                      0x000000C0
#define _WDTCON_CLKSEL_LENGTH                    0x00000002

#define _WDTCON_RUNDIV_POSITION                  0x00000008
#define _WDTCON_RUNDIV_MASK                      0x00001F00
#define _WDTCON_RUNDIV_LENGTH                    0x00000005

#define _WDTCON_ON_POSITION                      0x0000000F
#define _WDTCON_ON_MASK                          0x00008000
#define _WDTCON_ON_LENGTH                        0x00000001

#define _WDTCON_WDTCLRKEY_POSITION               0x00000010
#define _WDTCON_WDTCLRKEY_MASK                   0xFFFF0000
#define _WDTCON_WDTCLRKEY_LENGTH                 0x00000010

#define _DMTCON_ON_POSITION                      0x0000000F
#define _DMTCON_ON_MASK                          0x00008000
#define _DMTCON_ON_LENGTH                        0x00000001

#define _DMTPRECLR_STEP1_POSITION                0x00000008
#define _DMTPRECLR_STEP1_MASK                    0x0000FF00
#define _DMTPRECLR_STEP1_LENGTH                  0x00000008

#define _DMTCLR_STEP2_POSITION                   0x00000000
#define _DMTCLR_STEP2_MASK                       0x000000FF
#define _DMTCLR_STEP2_LENGTH                     0x00000008

#define _DMTSTAT_WINOPN_POSITION                 0x00000000
#define _DMTSTAT_WINOPN_MASK                     0x00000001
#define _DMTSTAT_WINOPN_LENGTH                   0x00000001

#define _DMTSTAT_DMTEVENT_POSITION               0x00000005
#define _DMTSTAT_DMTEVENT_MASK                   0x00000020
#define _DMTSTAT_DMTEVENT_LENGTH                 0x00000001

#define _DMTSTAT_BAD_POSITION                    0x00000006
#define _DMTSTAT_BAD_MASK                        0x000000C0
#define _DMTSTAT_BAD_LENGTH                      0x00000002

#define _DMTSTAT_BAD2_POSITION                   0x00000006
#define _DMTSTAT_BAD2_MASK                       0x00000040
#define _DMTSTAT_BAD2_LENGTH                     0x00000001

#define _DMTSTAT_BAD1_POSITION                   0x00000007
#define _DMTSTAT_BAD1_MASK                       0x00000080
#define _DMTSTAT_BAD1_LENGTH                     0x00000001

#define _DMTSTAT_w_POSITION                      0x00000000
#define _DMTSTAT_w_MASK                          0xFFFFFFFF
#define _DMTSTAT_w_LENGTH                        0x00000020

#define _DMTCNT_COUNTER_POSITION                 0x00000000
#define _DMTCNT_COUNTER_MASK                     0xFFFFFFFF
#define _DMTCNT_COUNTER_LENGTH                   0x00000020

#define _DMTHOLDREG_UPRCNT_POSITION              0x00000000
#define _DMTHOLDREG_UPRCNT_MASK                  0x0000FFFF
#define _DMTHOLDREG_UPRCNT_LENGTH                0x00000010

#define _DMTPSCNT_PSCNT_POSITION                 0x00000000
#define _DMTPSCNT_PSCNT_MASK                     0xFFFFFFFF
#define _DMTPSCNT_PSCNT_LENGTH                   0x00000020

#define _DMTPSINTV_PSINTV_POSITION               0x00000000
#define _DMTPSINTV_PSINTV_MASK                   0xFFFFFFFF
#define _DMTPSINTV_PSINTV_LENGTH                 0x00000020

#define _OSCCON_OSWEN_POSITION                   0x00000000
#define _OSCCON_OSWEN_MASK                       0x00000001
#define _OSCCON_OSWEN_LENGTH                     0x00000001

#define _OSCCON_SOSCEN_POSITION                  0x00000001
#define _OSCCON_SOSCEN_MASK                      0x00000002
#define _OSCCON_SOSCEN_LENGTH                    0x00000001

#define _OSCCON_UFRCEN_POSITION                  0x00000002
#define _OSCCON_UFRCEN_MASK                      0x00000004
#define _OSCCON_UFRCEN_LENGTH                    0x00000001

#define _OSCCON_CF_POSITION                      0x00000003
#define _OSCCON_CF_MASK                          0x00000008
#define _OSCCON_CF_LENGTH                        0x00000001

#define _OSCCON_SLPEN_POSITION                   0x00000004
#define _OSCCON_SLPEN_MASK                       0x00000010
#define _OSCCON_SLPEN_LENGTH                     0x00000001

#define _OSCCON_CLKLOCK_POSITION                 0x00000007
#define _OSCCON_CLKLOCK_MASK                     0x00000080
#define _OSCCON_CLKLOCK_LENGTH                   0x00000001

#define _OSCCON_NOSC_POSITION                    0x00000008
#define _OSCCON_NOSC_MASK                        0x00000F00
#define _OSCCON_NOSC_LENGTH                      0x00000004

#define _OSCCON_COSC_POSITION                    0x0000000C
#define _OSCCON_COSC_MASK                        0x0000F000
#define _OSCCON_COSC_LENGTH                      0x00000004

#define _OSCCON_WAKE2SPD_POSITION                0x00000015
#define _OSCCON_WAKE2SPD_MASK                    0x00200000
#define _OSCCON_WAKE2SPD_LENGTH                  0x00000001

#define _OSCCON_DRMEN_POSITION                   0x00000017
#define _OSCCON_DRMEN_MASK                       0x00800000
#define _OSCCON_DRMEN_LENGTH                     0x00000001

#define _OSCCON_FRCDIV_POSITION                  0x00000018
#define _OSCCON_FRCDIV_MASK                      0x07000000
#define _OSCCON_FRCDIV_LENGTH                    0x00000003

#define _OSCTUN_TUN_POSITION                     0x00000000
#define _OSCTUN_TUN_MASK                         0x0000003F
#define _OSCTUN_TUN_LENGTH                       0x00000006

#define _SPLLCON_SPLLBSWSEL_POSITION             0x00000000
#define _SPLLCON_SPLLBSWSEL_MASK                 0x00000007
#define _SPLLCON_SPLLBSWSEL_LENGTH               0x00000003

#define _SPLLCON_SPLLPWDN_POSITION               0x00000003
#define _SPLLCON_SPLLPWDN_MASK                   0x00000008
#define _SPLLCON_SPLLPWDN_LENGTH                 0x00000001

#define _SPLLCON_SPLLPOSTDIV1_POSITION           0x00000004
#define _SPLLCON_SPLLPOSTDIV1_MASK               0x000003F0
#define _SPLLCON_SPLLPOSTDIV1_LENGTH             0x00000006

#define _SPLLCON_SPLLFLOCK_POSITION              0x0000000A
#define _SPLLCON_SPLLFLOCK_MASK                  0x00000400
#define _SPLLCON_SPLLFLOCK_LENGTH                0x00000001

