Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _SPLLCON_SPLLRST_POSITION                0x0000000B
#define _SPLLCON_SPLLRST_MASK                    0x00000800
#define _SPLLCON_SPLLRST_LENGTH                  0x00000001

#define _SPLLCON_SPLLFBDIV_POSITION              0x0000000C
#define _SPLLCON_SPLLFBDIV_MASK                  0x003FF000
#define _SPLLCON_SPLLFBDIV_LENGTH                0x0000000A

#define _SPLLCON_SPLLREFDIV_POSITION             0x00000016
#define _SPLLCON_SPLLREFDIV_MASK                 0x0FC00000
#define _SPLLCON_SPLLREFDIV_LENGTH               0x00000006

#define _SPLLCON_SLOCK_POSITION                  0x0000001D
#define _SPLLCON_SLOCK_MASK                      0x20000000
#define _SPLLCON_SLOCK_LENGTH                    0x00000001

#define _SPLLCON_SPLLICLK_POSITION               0x0000001E
#define _SPLLCON_SPLLICLK_MASK                   0x40000000
#define _SPLLCON_SPLLICLK_LENGTH                 0x00000001

#define _SPLLCON_SPLL_BYP_POSITION               0x0000001F
#define _SPLLCON_SPLL_BYP_MASK                   0x80000000
#define _SPLLCON_SPLL_BYP_LENGTH                 0x00000001

#define _UPLLCON_UPLLBSWSEL_POSITION             0x00000000
#define _UPLLCON_UPLLBSWSEL_MASK                 0x00000007
#define _UPLLCON_UPLLBSWSEL_LENGTH               0x00000003

#define _UPLLCON_UPLLPWDN_POSITION               0x00000003
#define _UPLLCON_UPLLPWDN_MASK                   0x00000008
#define _UPLLCON_UPLLPWDN_LENGTH                 0x00000001

#define _UPLLCON_UPLLPOSTDIV1_POSITION           0x00000004
#define _UPLLCON_UPLLPOSTDIV1_MASK               0x000003F0
#define _UPLLCON_UPLLPOSTDIV1_LENGTH             0x00000006

#define _UPLLCON_UPLLFLOCK_POSITION              0x0000000A
#define _UPLLCON_UPLLFLOCK_MASK                  0x00000400
#define _UPLLCON_UPLLFLOCK_LENGTH                0x00000001

#define _UPLLCON_UPLLRST_POSITION                0x0000000B
#define _UPLLCON_UPLLRST_MASK                    0x00000800
#define _UPLLCON_UPLLRST_LENGTH                  0x00000001

#define _UPLLCON_UPLLFBDIV_POSITION              0x0000000C
#define _UPLLCON_UPLLFBDIV_MASK                  0x003FF000
#define _UPLLCON_UPLLFBDIV_LENGTH                0x0000000A

#define _UPLLCON_UPLLREFDIV_POSITION             0x00000016
#define _UPLLCON_UPLLREFDIV_MASK                 0x0FC00000
#define _UPLLCON_UPLLREFDIV_LENGTH               0x00000006

#define _UPLLCON_ULOCK_POSITION                  0x0000001D
#define _UPLLCON_ULOCK_MASK                      0x20000000
#define _UPLLCON_ULOCK_LENGTH                    0x00000001

#define _UPLLCON_UPLL_BYP_POSITION               0x0000001F
#define _UPLLCON_UPLL_BYP_MASK                   0x80000000
#define _UPLLCON_UPLL_BYP_LENGTH                 0x00000001

#define _BTPLLCON_BTPLLBSWSEL_POSITION           0x00000000
#define _BTPLLCON_BTPLLBSWSEL_MASK               0x00000007
#define _BTPLLCON_BTPLLBSWSEL_LENGTH             0x00000003

#define _BTPLLCON_BTPLLPWDN_POSITION             0x00000003
#define _BTPLLCON_BTPLLPWDN_MASK                 0x00000008
#define _BTPLLCON_BTPLLPWDN_LENGTH               0x00000001

#define _BTPLLCON_BTPLLPOSTDIV1_POSITION         0x00000004
#define _BTPLLCON_BTPLLPOSTDIV1_MASK             0x000003F0
#define _BTPLLCON_BTPLLPOSTDIV1_LENGTH           0x00000006

#define _BTPLLCON_BTPLLFLOCK_POSITION            0x0000000A
#define _BTPLLCON_BTPLLFLOCK_MASK                0x00000400
#define _BTPLLCON_BTPLLFLOCK_LENGTH              0x00000001

#define _BTPLLCON_BTPLLRST_POSITION              0x0000000B
#define _BTPLLCON_BTPLLRST_MASK                  0x00000800
#define _BTPLLCON_BTPLLRST_LENGTH                0x00000001

#define _BTPLLCON_BTPLLFBDIV_POSITION            0x0000000C
#define _BTPLLCON_BTPLLFBDIV_MASK                0x003FF000
#define _BTPLLCON_BTPLLFBDIV_LENGTH              0x0000000A

#define _BTPLLCON_BTPLLREFDIV_POSITION           0x00000016
#define _BTPLLCON_BTPLLREFDIV_MASK               0x0FC00000
#define _BTPLLCON_BTPLLREFDIV_LENGTH             0x00000006

#define _BTPLLCON_BTCLKOUTEN_POSITION            0x0000001C
#define _BTPLLCON_BTCLKOUTEN_MASK                0x10000000
#define _BTPLLCON_BTCLKOUTEN_LENGTH              0x00000001

#define _BTPLLCON_BTLOCK_POSITION                0x0000001D
#define _BTPLLCON_BTLOCK_MASK                    0x20000000
#define _BTPLLCON_BTLOCK_LENGTH                  0x00000001

#define _BTPLLCON_BTPLLCLK_POSITION              0x0000001E
#define _BTPLLCON_BTPLLCLK_MASK                  0x40000000
#define _BTPLLCON_BTPLLCLK_LENGTH                0x00000001

#define _BTPLLCON_BTPLL_BYP_POSITION             0x0000001F
#define _BTPLLCON_BTPLL_BYP_MASK                 0x80000000
#define _BTPLLCON_BTPLL_BYP_LENGTH               0x00000001

#define _EWPLLCON_EWPLLBSWSEL_POSITION           0x00000000
#define _EWPLLCON_EWPLLBSWSEL_MASK               0x00000007
#define _EWPLLCON_EWPLLBSWSEL_LENGTH             0x00000003

#define _EWPLLCON_EWPLLPWDN_POSITION             0x00000003
#define _EWPLLCON_EWPLLPWDN_MASK                 0x00000008
#define _EWPLLCON_EWPLLPWDN_LENGTH               0x00000001

#define _EWPLLCON_EWPLLPOSTDIV1_POSITION         0x00000004
#define _EWPLLCON_EWPLLPOSTDIV1_MASK             0x000003F0
#define _EWPLLCON_EWPLLPOSTDIV1_LENGTH           0x00000006

#define _EWPLLCON_EWPLLFLOCK_POSITION            0x0000000A
#define _EWPLLCON_EWPLLFLOCK_MASK                0x00000400
#define _EWPLLCON_EWPLLFLOCK_LENGTH              0x00000001

#define _EWPLLCON_EWPLLRST_POSITION              0x0000000B
#define _EWPLLCON_EWPLLRST_MASK                  0x00000800
#define _EWPLLCON_EWPLLRST_LENGTH                0x00000001

#define _EWPLLCON_EWPLLFBDIV_POSITION            0x0000000C
#define _EWPLLCON_EWPLLFBDIV_MASK                0x003FF000
#define _EWPLLCON_EWPLLFBDIV_LENGTH              0x0000000A

#define _EWPLLCON_EWPLLREFDIV_POSITION           0x00000016
#define _EWPLLCON_EWPLLREFDIV_MASK               0x0FC00000
#define _EWPLLCON_EWPLLREFDIV_LENGTH             0x00000006

#define _EWPLLCON_ETHCLKOUTEN_POSITION           0x0000001C
#define _EWPLLCON_ETHCLKOUTEN_MASK               0x10000000
#define _EWPLLCON_ETHCLKOUTEN_LENGTH             0x00000001

#define _EWPLLCON_EWLOCK_POSITION                0x0000001D
#define _EWPLLCON_EWLOCK_MASK                    0x20000000
#define _EWPLLCON_EWLOCK_LENGTH                  0x00000001

#define _EWPLLCON_EWPLLICLK_POSITION             0x0000001E
#define _EWPLLCON_EWPLLICLK_MASK                 0x40000000
#define _EWPLLCON_EWPLLICLK_LENGTH               0x00000001

