Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _CLKDIAG_LPRCSTOP_POSITION               0x00000003
#define _CLKDIAG_LPRCSTOP_MASK                   0x00000008
#define _CLKDIAG_LPRCSTOP_LENGTH                 0x00000001

#define _CLKDIAG_SPLLSTOP_POSITION               0x00000004
#define _CLKDIAG_SPLLSTOP_MASK                   0x00000010
#define _CLKDIAG_SPLLSTOP_LENGTH                 0x00000001

#define _CLKDIAG_UPLLSTOP_POSITION               0x00000005
#define _CLKDIAG_UPLLSTOP_MASK                   0x00000020
#define _CLKDIAG_UPLLSTOP_LENGTH                 0x00000001

#define _CLKDIAG_ETHPLLSTOP_POSITION             0x00000006
#define _CLKDIAG_ETHPLLSTOP_MASK                 0x00000040
#define _CLKDIAG_ETHPLLSTOP_LENGTH               0x00000001

#define _LVDCON_LVDL_POSITION                    0x00000000
#define _LVDCON_LVDL_MASK                        0x0000000F
#define _LVDCON_LVDL_LENGTH                      0x00000004

#define _LVDCON_DISOUT_POSITION                  0x00000007
#define _LVDCON_DISOUT_MASK                      0x00000080
#define _LVDCON_DISOUT_LENGTH                    0x00000001

#define _LVDCON_EVENT_POSITION                   0x00000008
#define _LVDCON_EVENT_MASK                       0x00000100
#define _LVDCON_EVENT_LENGTH                     0x00000001

#define _LVDCON_IRVST_POSITION                   0x00000009
#define _LVDCON_IRVST_MASK                       0x00000200
#define _LVDCON_IRVST_LENGTH                     0x00000001

#define _LVDCON_BGVST_POSITION                   0x0000000A
#define _LVDCON_BGVST_MASK                       0x00000400
#define _LVDCON_BGVST_LENGTH                     0x00000001

#define _LVDCON_VDIR_POSITION                    0x0000000B
#define _LVDCON_VDIR_MASK                        0x00000800
#define _LVDCON_VDIR_LENGTH                      0x00000001

#define _LVDCON_SIDL_POSITION                    0x0000000D
#define _LVDCON_SIDL_MASK                        0x00002000
#define _LVDCON_SIDL_LENGTH                      0x00000001

#define _LVDCON_FRZ_POSITION                     0x0000000E
#define _LVDCON_FRZ_MASK                         0x00004000
#define _LVDCON_FRZ_LENGTH                       0x00000001

#define _LVDCON_ON_POSITION                      0x0000000F
#define _LVDCON_ON_MASK                          0x00008000
#define _LVDCON_ON_LENGTH                        0x00000001

#define _U3MODE_STSEL_POSITION                   0x00000000
#define _U3MODE_STSEL_MASK                       0x00000001
#define _U3MODE_STSEL_LENGTH                     0x00000001

#define _U3MODE_PDSEL_POSITION                   0x00000001
#define _U3MODE_PDSEL_MASK                       0x00000006
#define _U3MODE_PDSEL_LENGTH                     0x00000002

#define _U3MODE_BRGH_POSITION                    0x00000003
#define _U3MODE_BRGH_MASK                        0x00000008
#define _U3MODE_BRGH_LENGTH                      0x00000001

#define _U3MODE_RXINV_POSITION                   0x00000004
#define _U3MODE_RXINV_MASK                       0x00000010
#define _U3MODE_RXINV_LENGTH                     0x00000001

#define _U3MODE_ABAUD_POSITION                   0x00000005
#define _U3MODE_ABAUD_MASK                       0x00000020
#define _U3MODE_ABAUD_LENGTH                     0x00000001

#define _U3MODE_LPBACK_POSITION                  0x00000006
#define _U3MODE_LPBACK_MASK                      0x00000040
#define _U3MODE_LPBACK_LENGTH                    0x00000001

#define _U3MODE_WAKE_POSITION                    0x00000007
#define _U3MODE_WAKE_MASK                        0x00000080
#define _U3MODE_WAKE_LENGTH                      0x00000001

#define _U3MODE_UEN_POSITION                     0x00000008
#define _U3MODE_UEN_MASK                         0x00000300
#define _U3MODE_UEN_LENGTH                       0x00000002

#define _U3MODE_RTSMD_POSITION                   0x0000000B
#define _U3MODE_RTSMD_MASK                       0x00000800
#define _U3MODE_RTSMD_LENGTH                     0x00000001

#define _U3MODE_IREN_POSITION                    0x0000000C
#define _U3MODE_IREN_MASK                        0x00001000
#define _U3MODE_IREN_LENGTH                      0x00000001

#define _U3MODE_SIDL_POSITION                    0x0000000D
#define _U3MODE_SIDL_MASK                        0x00002000
#define _U3MODE_SIDL_LENGTH                      0x00000001

#define _U3MODE_ON_POSITION                      0x0000000F
#define _U3MODE_ON_MASK                          0x00008000
#define _U3MODE_ON_LENGTH                        0x00000001

#define _U3MODE_OVFDIS_POSITION                  0x00000010
#define _U3MODE_OVFDIS_MASK                      0x00010000
#define _U3MODE_OVFDIS_LENGTH                    0x00000001

#define _U3MODE_CLKSEL_POSITION                  0x00000011
#define _U3MODE_CLKSEL_MASK                      0x00060000
#define _U3MODE_CLKSEL_LENGTH                    0x00000002

#define _U3MODE_ACTIVE_POSITION                  0x00000016
#define _U3MODE_ACTIVE_MASK                      0x00400000
#define _U3MODE_ACTIVE_LENGTH                    0x00000001

#define _U3MODE_SLPEN_POSITION                   0x00000017
#define _U3MODE_SLPEN_MASK                       0x00800000
#define _U3MODE_SLPEN_LENGTH                     0x00000001

#define _U3MODE_RUNOVF_POSITION                  0x00000010
#define _U3MODE_RUNOVF_MASK                      0x00010000
#define _U3MODE_RUNOVF_LENGTH                    0x00000001

#define _U3MODE_PDSEL0_POSITION                  0x00000001
#define _U3MODE_PDSEL0_MASK                      0x00000002
#define _U3MODE_PDSEL0_LENGTH                    0x00000001

#define _U3MODE_PDSEL1_POSITION                  0x00000002
#define _U3MODE_PDSEL1_MASK                      0x00000004
#define _U3MODE_PDSEL1_LENGTH                    0x00000001

#define _U3MODE_UEN0_POSITION                    0x00000008
#define _U3MODE_UEN0_MASK                        0x00000100
#define _U3MODE_UEN0_LENGTH                      0x00000001

#define _U3MODE_UEN1_POSITION                    0x00000009
#define _U3MODE_UEN1_MASK                        0x00000200
#define _U3MODE_UEN1_LENGTH                      0x00000001

#define _U3MODE_USIDL_POSITION                   0x0000000D
#define _U3MODE_USIDL_MASK                       0x00002000
#define _U3MODE_USIDL_LENGTH                     0x00000001

