Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _T5CKR_T5CKR_POSITION                    0x00000000
#define _T5CKR_T5CKR_MASK                        0x0000000F
#define _T5CKR_T5CKR_LENGTH                      0x00000004

#define _T6CKR_T6CKR_POSITION                    0x00000000
#define _T6CKR_T6CKR_MASK                        0x0000000F
#define _T6CKR_T6CKR_LENGTH                      0x00000004

#define _T7CKR_T7CKR_POSITION                    0x00000000
#define _T7CKR_T7CKR_MASK                        0x0000000F
#define _T7CKR_T7CKR_LENGTH                      0x00000004

#define _IC1R_IC1R_POSITION                      0x00000000
#define _IC1R_IC1R_MASK                          0x0000000F
#define _IC1R_IC1R_LENGTH                        0x00000004

#define _IC2R_IC2R_POSITION                      0x00000000
#define _IC2R_IC2R_MASK                          0x0000000F
#define _IC2R_IC2R_LENGTH                        0x00000004

#define _IC3R_IC3R_POSITION                      0x00000000
#define _IC3R_IC3R_MASK                          0x0000000F
#define _IC3R_IC3R_LENGTH                        0x00000004

#define _IC4R_IC4R_POSITION                      0x00000000
#define _IC4R_IC4R_MASK                          0x0000000F
#define _IC4R_IC4R_LENGTH                        0x00000004

#define _OCFAR_OCFAR_POSITION                    0x00000000
#define _OCFAR_OCFAR_MASK                        0x0000000F
#define _OCFAR_OCFAR_LENGTH                      0x00000004

#define _OCFBR_OCFBR_POSITION                    0x00000000
#define _OCFBR_OCFBR_MASK                        0x0000000F
#define _OCFBR_OCFBR_LENGTH                      0x00000004

#define _OCFCR_OCFCR_POSITION                    0x00000000
#define _OCFCR_OCFCR_MASK                        0x0000000F
#define _OCFCR_OCFCR_LENGTH                      0x00000004

#define _OCFDR_OCFDR_POSITION                    0x00000000
#define _OCFDR_OCFDR_MASK                        0x0000000F
#define _OCFDR_OCFDR_LENGTH                      0x00000004

#define _U1RXR_U1RXR_POSITION                    0x00000000
#define _U1RXR_U1RXR_MASK                        0x0000000F
#define _U1RXR_U1RXR_LENGTH                      0x00000004

#define _U1CTSR_U1CTSR_POSITION                  0x00000000
#define _U1CTSR_U1CTSR_MASK                      0x0000000F
#define _U1CTSR_U1CTSR_LENGTH                    0x00000004

#define _U2RXR_U2RXR_POSITION                    0x00000000
#define _U2RXR_U2RXR_MASK                        0x0000000F
#define _U2RXR_U2RXR_LENGTH                      0x00000004

#define _U2CTSR_U2CTSR_POSITION                  0x00000000
#define _U2CTSR_U2CTSR_MASK                      0x0000000F
#define _U2CTSR_U2CTSR_LENGTH                    0x00000004

#define _U3RXR_U3RXR_POSITION                    0x00000000
#define _U3RXR_U3RXR_MASK                        0x0000000F
#define _U3RXR_U3RXR_LENGTH                      0x00000004

#define _U3CTSR_U3CTSR_POSITION                  0x00000000
#define _U3CTSR_U3CTSR_MASK                      0x0000000F
#define _U3CTSR_U3CTSR_LENGTH                    0x00000004

#define _PTG30R_PTG30R_POSITION                  0x00000000
#define _PTG30R_PTG30R_MASK                      0x0000000F
#define _PTG30R_PTG30R_LENGTH                    0x00000004

#define _PTG31R_PTG31R_POSITION                  0x00000000
#define _PTG31R_PTG31R_MASK                      0x0000000F
#define _PTG31R_PTG31R_LENGTH                    0x00000004

#define _SDI1R_SDI1R_POSITION                    0x00000000
#define _SDI1R_SDI1R_MASK                        0x0000000F
#define _SDI1R_SDI1R_LENGTH                      0x00000004

#define _SS1INR_SS1INR_POSITION                  0x00000000
#define _SS1INR_SS1INR_MASK                      0x0000000F
#define _SS1INR_SS1INR_LENGTH                    0x00000004

#define _SDI2R_SDI2R_POSITION                    0x00000000
#define _SDI2R_SDI2R_MASK                        0x0000000F
#define _SDI2R_SDI2R_LENGTH                      0x00000004

#define _SS2INR_SS2INR_POSITION                  0x00000000
#define _SS2INR_SS2INR_MASK                      0x0000000F
#define _SS2INR_SS2INR_LENGTH                    0x00000004

#define _C1RXR_C1RXR_POSITION                    0x00000000
#define _C1RXR_C1RXR_MASK                        0x0000000F
#define _C1RXR_C1RXR_LENGTH                      0x00000004

#define _C2RXR_C2RXR_POSITION                    0x00000000
#define _C2RXR_C2RXR_MASK                        0x0000000F
#define _C2RXR_C2RXR_LENGTH                      0x00000004

#define _REFIR_REFIR_POSITION                    0x00000000
#define _REFIR_REFIR_MASK                        0x0000000F
#define _REFIR_REFIR_LENGTH                      0x00000004

#define _ECOLR_ECOLR_POSITION                    0x00000000
#define _ECOLR_ECOLR_MASK                        0x0000000F
#define _ECOLR_ECOLR_LENGTH                      0x00000004

#define _ECRSR_ECRSR_POSITION                    0x00000000
#define _ECRSR_ECRSR_MASK                        0x0000000F
#define _ECRSR_ECRSR_LENGTH                      0x00000004

#define _ETXCLKR_ETXCLKR_POSITION                0x00000000
#define _ETXCLKR_ETXCLKR_MASK                    0x0000000F
#define _ETXCLKR_ETXCLKR_LENGTH                  0x00000004

#define _ERXD3R_ERXD3R_POSITION                  0x00000000
#define _ERXD3R_ERXD3R_MASK                      0x0000000F
#define _ERXD3R_ERXD3R_LENGTH                    0x00000004

#define _ERXD2R_ERXD2R_POSITION                  0x00000000
#define _ERXD2R_ERXD2R_MASK                      0x0000000F
#define _ERXD2R_ERXD2R_LENGTH                    0x00000004

#define _RPA0R_RPA0R_POSITION                    0x00000000
#define _RPA0R_RPA0R_MASK                        0x0000001F
#define _RPA0R_RPA0R_LENGTH                      0x00000005

#define _RPA1R_RPA1R_POSITION                    0x00000000
#define _RPA1R_RPA1R_MASK                        0x0000001F
#define _RPA1R_RPA1R_LENGTH                      0x00000005

#define _RPA2R_RPA2R_POSITION                    0x00000000
#define _RPA2R_RPA2R_MASK                        0x0000001F
#define _RPA2R_RPA2R_LENGTH                      0x00000005

#define _RPA3R_RPA3R_POSITION                    0x00000000
#define _RPA3R_RPA3R_MASK                        0x0000001F
#define _RPA3R_RPA3R_LENGTH                      0x00000005

#define _RPA4R_RPA4R_POSITION                    0x00000000
#define _RPA4R_RPA4R_MASK                        0x0000001F
#define _RPA4R_RPA4R_LENGTH                      0x00000005

#define _RPA5R_RPA5R_POSITION                    0x00000000
#define _RPA5R_RPA5R_MASK                        0x0000001F
#define _RPA5R_RPA5R_LENGTH                      0x00000005

#define _RPA10R_RPA10R_POSITION                  0x00000000
#define _RPA10R_RPA10R_MASK                      0x0000001F
#define _RPA10R_RPA10R_LENGTH                    0x00000005

#define _RPA11R_RPA11R_POSITION                  0x00000000
#define _RPA11R_RPA11R_MASK                      0x0000001F
#define _RPA11R_RPA11R_LENGTH                    0x00000005

#define _RPA12R_RPA12R_POSITION                  0x00000000
#define _RPA12R_RPA12R_MASK                      0x0000001F
#define _RPA12R_RPA12R_LENGTH                    0x00000005

#define _RPA13R_RPA13R_POSITION                  0x00000000
#define _RPA13R_RPA13R_MASK                      0x0000001F
#define _RPA13R_RPA13R_LENGTH                    0x00000005

#define _RPA14R_RPA14R_POSITION                  0x00000000
#define _RPA14R_RPA14R_MASK                      0x0000001F
#define _RPA14R_RPA14R_LENGTH                    0x00000005

#define _RPA15R_RPA15R_POSITION                  0x00000000
#define _RPA15R_RPA15R_MASK                      0x0000001F
#define _RPA15R_RPA15R_LENGTH                    0x00000005

#define _RPB0R_RPB0R_POSITION                    0x00000000
#define _RPB0R_RPB0R_MASK                        0x0000001F
#define _RPB0R_RPB0R_LENGTH                      0x00000005

#define _RPB1R_RPB1R_POSITION                    0x00000000
#define _RPB1R_RPB1R_MASK                        0x0000001F
#define _RPB1R_RPB1R_LENGTH                      0x00000005

#define _RPB2R_RPB2R_POSITION                    0x00000000
#define _RPB2R_RPB2R_MASK                        0x0000001F
#define _RPB2R_RPB2R_LENGTH                      0x00000005

#define _RPB3R_RPB3R_POSITION                    0x00000000
#define _RPB3R_RPB3R_MASK                        0x0000001F
#define _RPB3R_RPB3R_LENGTH                      0x00000005

