Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _RPB4R_RPB4R_POSITION                    0x00000000
#define _RPB4R_RPB4R_MASK                        0x0000001F
#define _RPB4R_RPB4R_LENGTH                      0x00000005

#define _RPB5R_RPB5R_POSITION                    0x00000000
#define _RPB5R_RPB5R_MASK                        0x0000001F
#define _RPB5R_RPB5R_LENGTH                      0x00000005

#define _RPB6R_RPB6R_POSITION                    0x00000000
#define _RPB6R_RPB6R_MASK                        0x0000001F
#define _RPB6R_RPB6R_LENGTH                      0x00000005

#define _RPB7R_RPB7R_POSITION                    0x00000000
#define _RPB7R_RPB7R_MASK                        0x0000001F
#define _RPB7R_RPB7R_LENGTH                      0x00000005

#define _RPB8R_RPB8R_POSITION                    0x00000000
#define _RPB8R_RPB8R_MASK                        0x0000001F
#define _RPB8R_RPB8R_LENGTH                      0x00000005

#define _RPB9R_RPB9R_POSITION                    0x00000000
#define _RPB9R_RPB9R_MASK                        0x0000001F
#define _RPB9R_RPB9R_LENGTH                      0x00000005

#define _RPB10R_RPB10R_POSITION                  0x00000000
#define _RPB10R_RPB10R_MASK                      0x0000001F
#define _RPB10R_RPB10R_LENGTH                    0x00000005

#define _RPB11R_RPB11R_POSITION                  0x00000000
#define _RPB11R_RPB11R_MASK                      0x0000001F
#define _RPB11R_RPB11R_LENGTH                    0x00000005

#define _RPB12R_RPB12R_POSITION                  0x00000000
#define _RPB12R_RPB12R_MASK                      0x0000001F
#define _RPB12R_RPB12R_LENGTH                    0x00000005

#define _RPB13R_RPB13R_POSITION                  0x00000000
#define _RPB13R_RPB13R_MASK                      0x0000001F
#define _RPB13R_RPB13R_LENGTH                    0x00000005

#define _RPB14R_RPB14R_POSITION                  0x00000000
#define _RPB14R_RPB14R_MASK                      0x0000001F
#define _RPB14R_RPB14R_LENGTH                    0x00000005

#define _RPC0R_RPC0R_POSITION                    0x00000000
#define _RPC0R_RPC0R_MASK                        0x0000001F
#define _RPC0R_RPC0R_LENGTH                      0x00000005

#define _RPC1R_RPC1R_POSITION                    0x00000000
#define _RPC1R_RPC1R_MASK                        0x0000001F
#define _RPC1R_RPC1R_LENGTH                      0x00000005

#define _RPC2R_RPC2R_POSITION                    0x00000000
#define _RPC2R_RPC2R_MASK                        0x0000001F
#define _RPC2R_RPC2R_LENGTH                      0x00000005

#define _RPC3R_RPC3R_POSITION                    0x00000000
#define _RPC3R_RPC3R_MASK                        0x0000001F
#define _RPC3R_RPC3R_LENGTH                      0x00000005

#define _RPC4R_RPC4R_POSITION                    0x00000000
#define _RPC4R_RPC4R_MASK                        0x0000001F
#define _RPC4R_RPC4R_LENGTH                      0x00000005

#define _RPC5R_RPC5R_POSITION                    0x00000000
#define _RPC5R_RPC5R_MASK                        0x0000001F
#define _RPC5R_RPC5R_LENGTH                      0x00000005

#define _RPC6R_RPC6R_POSITION                    0x00000000
#define _RPC6R_RPC6R_MASK                        0x0000001F
#define _RPC6R_RPC6R_LENGTH                      0x00000005

#define _RPC7R_RPC7R_POSITION                    0x00000000
#define _RPC7R_RPC7R_MASK                        0x0000001F
#define _RPC7R_RPC7R_LENGTH                      0x00000005

#define _RPC8R_RPC8R_POSITION                    0x00000000
#define _RPC8R_RPC8R_MASK                        0x0000001F
#define _RPC8R_RPC8R_LENGTH                      0x00000005

#define _RPC9R_RPC9R_POSITION                    0x00000000
#define _RPC9R_RPC9R_MASK                        0x0000001F
#define _RPC9R_RPC9R_LENGTH                      0x00000005

#define _RPC10R_RPC10R_POSITION                  0x00000000
#define _RPC10R_RPC10R_MASK                      0x0000001F
#define _RPC10R_RPC10R_LENGTH                    0x00000005

#define _RPC11R_RPC11R_POSITION                  0x00000000
#define _RPC11R_RPC11R_MASK                      0x0000001F
#define _RPC11R_RPC11R_LENGTH                    0x00000005

#define _RPC12R_RPC12R_POSITION                  0x00000000
#define _RPC12R_RPC12R_MASK                      0x0000001F
#define _RPC12R_RPC12R_LENGTH                    0x00000005

#define _RPC13R_RPC13R_POSITION                  0x00000000
#define _RPC13R_RPC13R_MASK                      0x0000001F
#define _RPC13R_RPC13R_LENGTH                    0x00000005

#define _RPC14R_RPC14R_POSITION                  0x00000000
#define _RPC14R_RPC14R_MASK                      0x0000001F
#define _RPC14R_RPC14R_LENGTH                    0x00000005

#define _RPC15R_RPC15R_POSITION                  0x00000000
#define _RPC15R_RPC15R_MASK                      0x0000001F
#define _RPC15R_RPC15R_LENGTH                    0x00000005

#define _RPK0R_RPK0R_POSITION                    0x00000000
#define _RPK0R_RPK0R_MASK                        0x0000001F
#define _RPK0R_RPK0R_LENGTH                      0x00000005

#define _RPK1R_RPK1R_POSITION                    0x00000000
#define _RPK1R_RPK1R_MASK                        0x0000001F
#define _RPK1R_RPK1R_LENGTH                      0x00000005

#define _RPK2R_RPK2R_POSITION                    0x00000000
#define _RPK2R_RPK2R_MASK                        0x0000001F
#define _RPK2R_RPK2R_LENGTH                      0x00000005

#define _RPK3R_RPK3R_POSITION                    0x00000000
#define _RPK3R_RPK3R_MASK                        0x0000001F
#define _RPK3R_RPK3R_LENGTH                      0x00000005

#define _RPK4R_RPK4R_POSITION                    0x00000000
#define _RPK4R_RPK4R_MASK                        0x0000001F
#define _RPK4R_RPK4R_LENGTH                      0x00000005

#define _RPK5R_RPK5R_POSITION                    0x00000000
#define _RPK5R_RPK5R_MASK                        0x0000001F
#define _RPK5R_RPK5R_LENGTH                      0x00000005

#define _RPK6R_RPK6R_POSITION                    0x00000000
#define _RPK6R_RPK6R_MASK                        0x0000001F
#define _RPK6R_RPK6R_LENGTH                      0x00000005

#define _RPK7R_RPK7R_POSITION                    0x00000000
#define _RPK7R_RPK7R_MASK                        0x0000001F
#define _RPK7R_RPK7R_LENGTH                      0x00000005

#define _RPK8R_RPK8R_POSITION                    0x00000000
#define _RPK8R_RPK8R_MASK                        0x0000001F
#define _RPK8R_RPK8R_LENGTH                      0x00000005

#define _RPK9R_RPK9R_POSITION                    0x00000000
#define _RPK9R_RPK9R_MASK                        0x0000001F
#define _RPK9R_RPK9R_LENGTH                      0x00000005

#define _RPK10R_RPK10R_POSITION                  0x00000000
#define _RPK10R_RPK10R_MASK                      0x0000001F
#define _RPK10R_RPK10R_LENGTH                    0x00000005

#define _RPK11R_RPK11R_POSITION                  0x00000000
#define _RPK11R_RPK11R_MASK                      0x0000001F
#define _RPK11R_RPK11R_LENGTH                    0x00000005

#define _RPK12R_RPK12R_POSITION                  0x00000000
#define _RPK12R_RPK12R_MASK                      0x0000001F
#define _RPK12R_RPK12R_LENGTH                    0x00000005

#define _RPK13R_RPK13R_POSITION                  0x00000000
#define _RPK13R_RPK13R_MASK                      0x0000001F
#define _RPK13R_RPK13R_LENGTH                    0x00000005

#define _RPK14R_RPK14R_POSITION                  0x00000000
#define _RPK14R_RPK14R_MASK                      0x0000001F
#define _RPK14R_RPK14R_LENGTH                    0x00000005

