Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _PTGQUE4_STEP19_POSITION                 0x00000018
#define _PTGQUE4_STEP19_MASK                     0xFF000000
#define _PTGQUE4_STEP19_LENGTH                   0x00000008

#define _PTGQUE5_STEP20_POSITION                 0x00000000
#define _PTGQUE5_STEP20_MASK                     0x000000FF
#define _PTGQUE5_STEP20_LENGTH                   0x00000008

#define _PTGQUE5_STEP21_POSITION                 0x00000008
#define _PTGQUE5_STEP21_MASK                     0x0000FF00
#define _PTGQUE5_STEP21_LENGTH                   0x00000008

#define _PTGQUE5_STEP22_POSITION                 0x00000010
#define _PTGQUE5_STEP22_MASK                     0x00FF0000
#define _PTGQUE5_STEP22_LENGTH                   0x00000008

#define _PTGQUE5_STEP23_POSITION                 0x00000018
#define _PTGQUE5_STEP23_MASK                     0xFF000000
#define _PTGQUE5_STEP23_LENGTH                   0x00000008

#define _PTGQUE6_STEP24_POSITION                 0x00000000
#define _PTGQUE6_STEP24_MASK                     0x000000FF
#define _PTGQUE6_STEP24_LENGTH                   0x00000008

#define _PTGQUE6_STEP25_POSITION                 0x00000008
#define _PTGQUE6_STEP25_MASK                     0x0000FF00
#define _PTGQUE6_STEP25_LENGTH                   0x00000008

#define _PTGQUE6_STEP26_POSITION                 0x00000010
#define _PTGQUE6_STEP26_MASK                     0x00FF0000
#define _PTGQUE6_STEP26_LENGTH                   0x00000008

#define _PTGQUE6_STEP27_POSITION                 0x00000018
#define _PTGQUE6_STEP27_MASK                     0xFF000000
#define _PTGQUE6_STEP27_LENGTH                   0x00000008

#define _PTGQUE7_STEP28_POSITION                 0x00000000
#define _PTGQUE7_STEP28_MASK                     0x000000FF
#define _PTGQUE7_STEP28_LENGTH                   0x00000008

#define _PTGQUE7_STEP29_POSITION                 0x00000008
#define _PTGQUE7_STEP29_MASK                     0x0000FF00
#define _PTGQUE7_STEP29_LENGTH                   0x00000008

#define _PTGQUE7_STEP30_POSITION                 0x00000010
#define _PTGQUE7_STEP30_MASK                     0x00FF0000
#define _PTGQUE7_STEP30_LENGTH                   0x00000008

#define _PTGQUE7_STEP31_POSITION                 0x00000018
#define _PTGQUE7_STEP31_MASK                     0xFF000000
#define _PTGQUE7_STEP31_LENGTH                   0x00000008

#define _T1CON_TCS_POSITION                      0x00000001
#define _T1CON_TCS_MASK                          0x00000002
#define _T1CON_TCS_LENGTH                        0x00000001

#define _T1CON_TSYNC_POSITION                    0x00000002
#define _T1CON_TSYNC_MASK                        0x00000004
#define _T1CON_TSYNC_LENGTH                      0x00000001

#define _T1CON_TCKPS_POSITION                    0x00000004
#define _T1CON_TCKPS_MASK                        0x00000030
#define _T1CON_TCKPS_LENGTH                      0x00000002

#define _T1CON_TGATE_POSITION                    0x00000007
#define _T1CON_TGATE_MASK                        0x00000080
#define _T1CON_TGATE_LENGTH                      0x00000001

#define _T1CON_TECS_POSITION                     0x00000008
#define _T1CON_TECS_MASK                         0x00000300
#define _T1CON_TECS_LENGTH                       0x00000002

#define _T1CON_TWIP_POSITION                     0x0000000B
#define _T1CON_TWIP_MASK                         0x00000800
#define _T1CON_TWIP_LENGTH                       0x00000001

#define _T1CON_TWDIS_POSITION                    0x0000000C
#define _T1CON_TWDIS_MASK                        0x00001000
#define _T1CON_TWDIS_LENGTH                      0x00000001

#define _T1CON_SIDL_POSITION                     0x0000000D
#define _T1CON_SIDL_MASK                         0x00002000
#define _T1CON_SIDL_LENGTH                       0x00000001

#define _T1CON_ON_POSITION                       0x0000000F
#define _T1CON_ON_MASK                           0x00008000
#define _T1CON_ON_LENGTH                         0x00000001

#define _T1CON_TCKPS0_POSITION                   0x00000004
#define _T1CON_TCKPS0_MASK                       0x00000010
#define _T1CON_TCKPS0_LENGTH                     0x00000001

#define _T1CON_TCKPS1_POSITION                   0x00000005
#define _T1CON_TCKPS1_MASK                       0x00000020
#define _T1CON_TCKPS1_LENGTH                     0x00000001

#define _T1CON_TECS0_POSITION                    0x00000008
#define _T1CON_TECS0_MASK                        0x00000100
#define _T1CON_TECS0_LENGTH                      0x00000001

#define _T1CON_TECS1_POSITION                    0x00000009
#define _T1CON_TECS1_MASK                        0x00000200
#define _T1CON_TECS1_LENGTH                      0x00000001

#define _T1CON_TSIDL_POSITION                    0x0000000D
#define _T1CON_TSIDL_MASK                        0x00002000
#define _T1CON_TSIDL_LENGTH                      0x00000001

#define _T1CON_TON_POSITION                      0x0000000F
#define _T1CON_TON_MASK                          0x00008000
#define _T1CON_TON_LENGTH                        0x00000001

#define _T1CON_w_POSITION                        0x00000000
#define _T1CON_w_MASK                            0xFFFFFFFF
#define _T1CON_w_LENGTH                          0x00000020

#define _T2CON_TCS_POSITION                      0x00000001
#define _T2CON_TCS_MASK                          0x00000002
#define _T2CON_TCS_LENGTH                        0x00000001

#define _T2CON_T32_POSITION                      0x00000003
#define _T2CON_T32_MASK                          0x00000008
#define _T2CON_T32_LENGTH                        0x00000001

#define _T2CON_TCKPS_POSITION                    0x00000004
#define _T2CON_TCKPS_MASK                        0x00000070
#define _T2CON_TCKPS_LENGTH                      0x00000003

#define _T2CON_TGATE_POSITION                    0x00000007
#define _T2CON_TGATE_MASK                        0x00000080
#define _T2CON_TGATE_LENGTH                      0x00000001

#define _T2CON_SIDL_POSITION                     0x0000000D
#define _T2CON_SIDL_MASK                         0x00002000
#define _T2CON_SIDL_LENGTH                       0x00000001

