Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _IFS1_CNKIF_POSITION                     0x0000000F
#define _IFS1_CNKIF_MASK                         0x00008000
#define _IFS1_CNKIF_LENGTH                       0x00000001

#define _IFS1_SPI2EIF_POSITION                   0x00000015
#define _IFS1_SPI2EIF_MASK                       0x00200000
#define _IFS1_SPI2EIF_LENGTH                     0x00000001

#define _IFS1_SPI2RXIF_POSITION                  0x00000016
#define _IFS1_SPI2RXIF_MASK                      0x00400000
#define _IFS1_SPI2RXIF_LENGTH                    0x00000001

#define _IFS1_SPI2TXIF_POSITION                  0x00000017
#define _IFS1_SPI2TXIF_MASK                      0x00800000
#define _IFS1_SPI2TXIF_LENGTH                    0x00000001

#define _IFS1_U2EIF_POSITION                     0x00000018
#define _IFS1_U2EIF_MASK                         0x01000000
#define _IFS1_U2EIF_LENGTH                       0x00000001

#define _IFS1_U2RXIF_POSITION                    0x00000019
#define _IFS1_U2RXIF_MASK                        0x02000000
#define _IFS1_U2RXIF_LENGTH                      0x00000001

#define _IFS1_U2TXIF_POSITION                    0x0000001A
#define _IFS1_U2TXIF_MASK                        0x04000000
#define _IFS1_U2TXIF_LENGTH                      0x00000001

#define _IFS1_I2C2BIF_POSITION                   0x0000001B
#define _IFS1_I2C2BIF_MASK                       0x08000000
#define _IFS1_I2C2BIF_LENGTH                     0x00000001

#define _IFS1_I2C2SIF_POSITION                   0x0000001C
#define _IFS1_I2C2SIF_MASK                       0x10000000
#define _IFS1_I2C2SIF_LENGTH                     0x00000001

#define _IFS1_I2C2MIF_POSITION                   0x0000001D
#define _IFS1_I2C2MIF_MASK                       0x20000000
#define _IFS1_I2C2MIF_LENGTH                     0x00000001

#define _IFS1_U3EIF_POSITION                     0x0000001E
#define _IFS1_U3EIF_MASK                         0x40000000
#define _IFS1_U3EIF_LENGTH                       0x00000001

#define _IFS1_U3RXIF_POSITION                    0x0000001F
#define _IFS1_U3RXIF_MASK                        0x80000000
#define _IFS1_U3RXIF_LENGTH                      0x00000001

#define _IFS2_U3TXIF_POSITION                    0x00000000
#define _IFS2_U3TXIF_MASK                        0x00000001
#define _IFS2_U3TXIF_LENGTH                      0x00000001

#define _IFS2_DMA0IF_POSITION                    0x00000004
#define _IFS2_DMA0IF_MASK                        0x00000010
#define _IFS2_DMA0IF_LENGTH                      0x00000001

#define _IFS2_DMA1IF_POSITION                    0x00000005
#define _IFS2_DMA1IF_MASK                        0x00000020
#define _IFS2_DMA1IF_LENGTH                      0x00000001

#define _IFS2_DMA2IF_POSITION                    0x00000006
#define _IFS2_DMA2IF_MASK                        0x00000040
#define _IFS2_DMA2IF_LENGTH                      0x00000001

#define _IFS2_DMA3IF_POSITION                    0x00000007
#define _IFS2_DMA3IF_MASK                        0x00000080
#define _IFS2_DMA3IF_LENGTH                      0x00000001

#define _IFS2_DMA4IF_POSITION                    0x00000008
#define _IFS2_DMA4IF_MASK                        0x00000100
#define _IFS2_DMA4IF_LENGTH                      0x00000001

#define _IFS2_DMA5IF_POSITION                    0x00000009
#define _IFS2_DMA5IF_MASK                        0x00000200
#define _IFS2_DMA5IF_LENGTH                      0x00000001

#define _IFS2_DMA6IF_POSITION                    0x0000000A
#define _IFS2_DMA6IF_MASK                        0x00000400
#define _IFS2_DMA6IF_LENGTH                      0x00000001

#define _IFS2_DMA7IF_POSITION                    0x0000000B
#define _IFS2_DMA7IF_MASK                        0x00000800
#define _IFS2_DMA7IF_LENGTH                      0x00000001

#define _IFS2_T6IF_POSITION                      0x0000000C
#define _IFS2_T6IF_MASK                          0x00001000
#define _IFS2_T6IF_LENGTH                        0x00000001

#define _IFS2_T7IF_POSITION                      0x00000010
#define _IFS2_T7IF_MASK                          0x00010000
#define _IFS2_T7IF_LENGTH                        0x00000001

#define _IFS2_RFSMCIF_POSITION                   0x00000013
#define _IFS2_RFSMCIF_MASK                       0x00080000
#define _IFS2_RFSMCIF_LENGTH                     0x00000001

#define _IFS2_RFMACIF_POSITION                   0x00000014
#define _IFS2_RFMACIF_MASK                       0x00100000
#define _IFS2_RFMACIF_LENGTH                     0x00000001

#define _IFS2_CTR1EVIF_POSITION                  0x00000015
#define _IFS2_CTR1EVIF_MASK                      0x00200000
#define _IFS2_CTR1EVIF_LENGTH                    0x00000001

#define _IFS2_RFTM0IF_POSITION                   0x00000016
#define _IFS2_RFTM0IF_MASK                       0x00400000
#define _IFS2_RFTM0IF_LENGTH                     0x00000001

#define _IFS2_RFTM1IF_POSITION                   0x00000017
#define _IFS2_RFTM1IF_MASK                       0x00800000
#define _IFS2_RFTM1IF_LENGTH                     0x00000001

#define _IFS2_RFTM2IF_POSITION                   0x00000018
#define _IFS2_RFTM2IF_MASK                       0x01000000
#define _IFS2_RFTM2IF_LENGTH                     0x00000001

#define _IFS2_RFTM3IF_POSITION                   0x00000019
#define _IFS2_RFTM3IF_MASK                       0x02000000
#define _IFS2_RFTM3IF_LENGTH                     0x00000001

#define _IFS2_CTR1TRGIF_POSITION                 0x0000001A
#define _IFS2_CTR1TRGIF_MASK                     0x04000000
#define _IFS2_CTR1TRGIF_LENGTH                   0x00000001

#define _IFS2_RFWCOEIF_POSITION                  0x0000001B
#define _IFS2_RFWCOEIF_MASK                      0x08000000
#define _IFS2_RFWCOEIF_LENGTH                    0x00000001

#define _IFS2_ADCIF_POSITION                     0x0000001C
#define _IFS2_ADCIF_MASK                         0x10000000
#define _IFS2_ADCIF_LENGTH                       0x00000001

#define _IFS2_ADCDC1IF_POSITION                  0x0000001E
#define _IFS2_ADCDC1IF_MASK                      0x40000000
#define _IFS2_ADCDC1IF_LENGTH                    0x00000001

