Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _IFS2_ADCDC2IF_POSITION                  0x0000001F
#define _IFS2_ADCDC2IF_MASK                      0x80000000
#define _IFS2_ADCDC2IF_LENGTH                    0x00000001

#define _IFS3_ADCDF1IF_POSITION                  0x00000000
#define _IFS3_ADCDF1IF_MASK                      0x00000001
#define _IFS3_ADCDF1IF_LENGTH                    0x00000001

#define _IFS3_ADCDF2IF_POSITION                  0x00000001
#define _IFS3_ADCDF2IF_MASK                      0x00000002
#define _IFS3_ADCDF2IF_LENGTH                    0x00000001

#define _IFS3_ADCFLTIF_POSITION                  0x00000004
#define _IFS3_ADCFLTIF_MASK                      0x00000010
#define _IFS3_ADCFLTIF_LENGTH                    0x00000001

#define _IFS3_ADCEOSIF_POSITION                  0x00000005
#define _IFS3_ADCEOSIF_MASK                      0x00000020
#define _IFS3_ADCEOSIF_LENGTH                    0x00000001

#define _IFS3_ADCARDYIF_POSITION                 0x00000006
#define _IFS3_ADCARDYIF_MASK                     0x00000040
#define _IFS3_ADCARDYIF_LENGTH                   0x00000001

#define _IFS3_ADCURDYIF_POSITION                 0x00000007
#define _IFS3_ADCURDYIF_MASK                     0x00000080
#define _IFS3_ADCURDYIF_LENGTH                   0x00000001

#define _IFS3_ADCFCBTIF_POSITION                 0x00000008
#define _IFS3_ADCFCBTIF_MASK                     0x00000100
#define _IFS3_ADCFCBTIF_LENGTH                   0x00000001

#define _IFS3_ADCD0IF_POSITION                   0x0000000A
#define _IFS3_ADCD0IF_MASK                       0x00000400
#define _IFS3_ADCD0IF_LENGTH                     0x00000001

#define _IFS3_ADCD1IF_POSITION                   0x0000000B
#define _IFS3_ADCD1IF_MASK                       0x00000800
#define _IFS3_ADCD1IF_LENGTH                     0x00000001

#define _IFS3_ADCD2IF_POSITION                   0x0000000C
#define _IFS3_ADCD2IF_MASK                       0x00001000
#define _IFS3_ADCD2IF_LENGTH                     0x00000001

#define _IFS3_ADCD3IF_POSITION                   0x0000000D
#define _IFS3_ADCD3IF_MASK                       0x00002000
#define _IFS3_ADCD3IF_LENGTH                     0x00000001

#define _IFS3_ADCD4IF_POSITION                   0x0000000E
#define _IFS3_ADCD4IF_MASK                       0x00004000
#define _IFS3_ADCD4IF_LENGTH                     0x00000001

#define _IFS3_ADCD5IF_POSITION                   0x0000000F
#define _IFS3_ADCD5IF_MASK                       0x00008000
#define _IFS3_ADCD5IF_LENGTH                     0x00000001

#define _IFS3_ADCD6IF_POSITION                   0x00000010
#define _IFS3_ADCD6IF_MASK                       0x00010000
#define _IFS3_ADCD6IF_LENGTH                     0x00000001

#define _IFS3_ADCD7IF_POSITION                   0x00000011
#define _IFS3_ADCD7IF_MASK                       0x00020000
#define _IFS3_ADCD7IF_LENGTH                     0x00000001

#define _IFS3_ADCD8IF_POSITION                   0x00000012
#define _IFS3_ADCD8IF_MASK                       0x00040000
#define _IFS3_ADCD8IF_LENGTH                     0x00000001

#define _IFS3_ADCD9IF_POSITION                   0x00000013
#define _IFS3_ADCD9IF_MASK                       0x00080000
#define _IFS3_ADCD9IF_LENGTH                     0x00000001

#define _IFS3_ADCD10IF_POSITION                  0x00000014
#define _IFS3_ADCD10IF_MASK                      0x00100000
#define _IFS3_ADCD10IF_LENGTH                    0x00000001

#define _IFS3_ADCD11IF_POSITION                  0x00000015
#define _IFS3_ADCD11IF_MASK                      0x00200000
#define _IFS3_ADCD11IF_LENGTH                    0x00000001

#define _IFS3_ADCD12IF_POSITION                  0x00000016
#define _IFS3_ADCD12IF_MASK                      0x00400000
#define _IFS3_ADCD12IF_LENGTH                    0x00000001

#define _IFS3_ADCD13IF_POSITION                  0x00000017
#define _IFS3_ADCD13IF_MASK                      0x00800000
#define _IFS3_ADCD13IF_LENGTH                    0x00000001

#define _IFS3_ADCD14IF_POSITION                  0x00000018
#define _IFS3_ADCD14IF_MASK                      0x01000000
#define _IFS3_ADCD14IF_LENGTH                    0x00000001

#define _IFS3_ADCD15IF_POSITION                  0x00000019
#define _IFS3_ADCD15IF_MASK                      0x02000000
#define _IFS3_ADCD15IF_LENGTH                    0x00000001

#define _IFS3_ADCD16IF_POSITION                  0x0000001A
#define _IFS3_ADCD16IF_MASK                      0x04000000
#define _IFS3_ADCD16IF_LENGTH                    0x00000001

#define _IFS3_ADCD17IF_POSITION                  0x0000001B
#define _IFS3_ADCD17IF_MASK                      0x08000000
#define _IFS3_ADCD17IF_LENGTH                    0x00000001

#define _IFS3_ADCD18IF_POSITION                  0x0000001C
#define _IFS3_ADCD18IF_MASK                      0x10000000
#define _IFS3_ADCD18IF_LENGTH                    0x00000001

#define _IFS3_ADCD19IF_POSITION                  0x0000001D
#define _IFS3_ADCD19IF_MASK                      0x20000000
#define _IFS3_ADCD19IF_LENGTH                    0x00000001

#define _IFS3_ADCD20IF_POSITION                  0x0000001E
#define _IFS3_ADCD20IF_MASK                      0x40000000
#define _IFS3_ADCD20IF_LENGTH                    0x00000001

#define _IFS3_ADCD21IF_POSITION                  0x0000001F
#define _IFS3_ADCD21IF_MASK                      0x80000000
#define _IFS3_ADCD21IF_LENGTH                    0x00000001

#define _IFS4_ADCD22IF_POSITION                  0x00000000
#define _IFS4_ADCD22IF_MASK                      0x00000001
#define _IFS4_ADCD22IF_LENGTH                    0x00000001

#define _IFS4_ADCD23IF_POSITION                  0x00000001
#define _IFS4_ADCD23IF_MASK                      0x00000002
#define _IFS4_ADCD23IF_LENGTH                    0x00000001

#define _IFS4_CAN1IF_POSITION                    0x0000000E
#define _IFS4_CAN1IF_MASK                        0x00004000
#define _IFS4_CAN1IF_LENGTH                      0x00000001

#define _IFS4_CAN2RXIF_POSITION                  0x0000000F
#define _IFS4_CAN2RXIF_MASK                      0x00008000
#define _IFS4_CAN2RXIF_LENGTH                    0x00000001

#define _IFS4_CAN2TXIF_POSITION                  0x00000010
#define _IFS4_CAN2TXIF_MASK                      0x00010000
#define _IFS4_CAN2TXIF_LENGTH                    0x00000001

#define _IFS4_CAN2IF_POSITION                    0x00000011
#define _IFS4_CAN2IF_MASK                        0x00020000
#define _IFS4_CAN2IF_LENGTH                      0x00000001

#define _IFS4_SQIIF_POSITION                     0x00000016
#define _IFS4_SQIIF_MASK                         0x00400000
#define _IFS4_SQIIF_LENGTH                       0x00000001

#define _IFS4_PTGSTEPIF_POSITION                 0x00000018
#define _IFS4_PTGSTEPIF_MASK                     0x01000000
#define _IFS4_PTGSTEPIF_LENGTH                   0x00000001

