Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _IEC3_ADCD15IE_POSITION                  0x00000019
#define _IEC3_ADCD15IE_MASK                      0x02000000
#define _IEC3_ADCD15IE_LENGTH                    0x00000001

#define _IEC3_ADCD16IE_POSITION                  0x0000001A
#define _IEC3_ADCD16IE_MASK                      0x04000000
#define _IEC3_ADCD16IE_LENGTH                    0x00000001

#define _IEC3_ADCD17IE_POSITION                  0x0000001B
#define _IEC3_ADCD17IE_MASK                      0x08000000
#define _IEC3_ADCD17IE_LENGTH                    0x00000001

#define _IEC3_ADCD18IE_POSITION                  0x0000001C
#define _IEC3_ADCD18IE_MASK                      0x10000000
#define _IEC3_ADCD18IE_LENGTH                    0x00000001

#define _IEC3_ADCD19IE_POSITION                  0x0000001D
#define _IEC3_ADCD19IE_MASK                      0x20000000
#define _IEC3_ADCD19IE_LENGTH                    0x00000001

#define _IEC3_ADCD20IE_POSITION                  0x0000001E
#define _IEC3_ADCD20IE_MASK                      0x40000000
#define _IEC3_ADCD20IE_LENGTH                    0x00000001

#define _IEC3_ADCD21IE_POSITION                  0x0000001F
#define _IEC3_ADCD21IE_MASK                      0x80000000
#define _IEC3_ADCD21IE_LENGTH                    0x00000001

#define _IEC4_ADCD22IE_POSITION                  0x00000000
#define _IEC4_ADCD22IE_MASK                      0x00000001
#define _IEC4_ADCD22IE_LENGTH                    0x00000001

#define _IEC4_ADCD23IE_POSITION                  0x00000001
#define _IEC4_ADCD23IE_MASK                      0x00000002
#define _IEC4_ADCD23IE_LENGTH                    0x00000001

#define _IEC4_CAN1IE_POSITION                    0x0000000E
#define _IEC4_CAN1IE_MASK                        0x00004000
#define _IEC4_CAN1IE_LENGTH                      0x00000001

#define _IEC4_CAN2RXIE_POSITION                  0x0000000F
#define _IEC4_CAN2RXIE_MASK                      0x00008000
#define _IEC4_CAN2RXIE_LENGTH                    0x00000001

#define _IEC4_CAN2TXIE_POSITION                  0x00000010
#define _IEC4_CAN2TXIE_MASK                      0x00010000
#define _IEC4_CAN2TXIE_LENGTH                    0x00000001

#define _IEC4_CAN2IE_POSITION                    0x00000011
#define _IEC4_CAN2IE_MASK                        0x00020000
#define _IEC4_CAN2IE_LENGTH                      0x00000001

#define _IEC4_SQIIE_POSITION                     0x00000016
#define _IEC4_SQIIE_MASK                         0x00400000
#define _IEC4_SQIIE_LENGTH                       0x00000001

#define _IEC4_PTGSTEPIE_POSITION                 0x00000018
#define _IEC4_PTGSTEPIE_MASK                     0x01000000
#define _IEC4_PTGSTEPIE_LENGTH                   0x00000001

#define _IEC4_PTGWDTIE_POSITION                  0x00000019
#define _IEC4_PTGWDTIE_MASK                      0x02000000
#define _IEC4_PTGWDTIE_LENGTH                    0x00000001

#define _IEC4_PTG0TR0IE_POSITION                 0x0000001A
#define _IEC4_PTG0TR0IE_MASK                     0x04000000
#define _IEC4_PTG0TR0IE_LENGTH                   0x00000001

#define _IEC4_PTG0TR1IE_POSITION                 0x0000001B
#define _IEC4_PTG0TR1IE_MASK                     0x08000000
#define _IEC4_PTG0TR1IE_LENGTH                   0x00000001

#define _IEC4_PTG0TR2IE_POSITION                 0x0000001C
#define _IEC4_PTG0TR2IE_MASK                     0x10000000
#define _IEC4_PTG0TR2IE_LENGTH                   0x00000001

#define _IEC4_PTG0TR3IE_POSITION                 0x0000001D
#define _IEC4_PTG0TR3IE_MASK                     0x20000000
#define _IEC4_PTG0TR3IE_LENGTH                   0x00000001

#define _IEC5_MPUPCIE_POSITION                   0x00000002
#define _IEC5_MPUPCIE_MASK                       0x00000004
#define _IEC5_MPUPCIE_LENGTH                     0x00000001

#define _IEC5_FDCIE_POSITION                     0x00000003
#define _IEC5_FDCIE_MASK                         0x00000008
#define _IEC5_FDCIE_LENGTH                       0x00000001

#define _IEC5_CRPTIE_POSITION                    0x00000004
#define _IEC5_CRPTIE_MASK                        0x00000010
#define _IEC5_CRPTIE_LENGTH                      0x00000001

#define _IEC5_ETHIE_POSITION                     0x00000005
#define _IEC5_ETHIE_MASK                         0x00000020
#define _IEC5_ETHIE_LENGTH                       0x00000001

#define _IEC5_CRPT1IE_POSITION                   0x00000006
#define _IEC5_CRPT1IE_MASK                       0x00000040
#define _IEC5_CRPT1IE_LENGTH                     0x00000001

#define _IEC5_CRPT1EIE_POSITION                  0x00000007
#define _IEC5_CRPT1EIE_MASK                      0x00000080
#define _IEC5_CRPT1EIE_LENGTH                    0x00000001

#define _IPC0_CTIS_POSITION                      0x00000000
#define _IPC0_CTIS_MASK                          0x00000003
#define _IPC0_CTIS_LENGTH                        0x00000002

#define _IPC0_CTIP_POSITION                      0x00000002
#define _IPC0_CTIP_MASK                          0x0000001C
#define _IPC0_CTIP_LENGTH                        0x00000003

#define _IPC0_CS0IS_POSITION                     0x00000008
#define _IPC0_CS0IS_MASK                         0x00000300
#define _IPC0_CS0IS_LENGTH                       0x00000002

#define _IPC0_CS0IP_POSITION                     0x0000000A
#define _IPC0_CS0IP_MASK                         0x00001C00
#define _IPC0_CS0IP_LENGTH                       0x00000003

#define _IPC0_CS1IS_POSITION                     0x00000010
#define _IPC0_CS1IS_MASK                         0x00030000
#define _IPC0_CS1IS_LENGTH                       0x00000002

#define _IPC0_CS1IP_POSITION                     0x00000012
#define _IPC0_CS1IP_MASK                         0x001C0000
#define _IPC0_CS1IP_LENGTH                       0x00000003

#define _IPC0_INT0IS_POSITION                    0x00000018
#define _IPC0_INT0IS_MASK                        0x03000000
#define _IPC0_INT0IS_LENGTH                      0x00000002

#define _IPC0_INT0IP_POSITION                    0x0000001A
#define _IPC0_INT0IP_MASK                        0x1C000000
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC1_T1IS_POSITION                      0x00000000
#define _IPC1_T1IS_MASK                          0x00000003
#define _IPC1_T1IS_LENGTH                        0x00000002

#define _IPC1_T1IP_POSITION                      0x00000002
#define _IPC1_T1IP_MASK                          0x0000001C
#define _IPC1_T1IP_LENGTH                        0x00000003

#define _IPC1_IC1EIS_POSITION                    0x00000008
#define _IPC1_IC1EIS_MASK                        0x00000300
#define _IPC1_IC1EIS_LENGTH                      0x00000002

#define _IPC1_IC1EIP_POSITION                    0x0000000A
#define _IPC1_IC1EIP_MASK                        0x00001C00
#define _IPC1_IC1EIP_LENGTH                      0x00000003

