Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _IPC6_T5IP_POSITION                      0x00000002
#define _IPC6_T5IP_MASK                          0x0000001C
#define _IPC6_T5IP_LENGTH                        0x00000003

#define _IPC7_FCEIS_POSITION                     0x00000010
#define _IPC7_FCEIS_MASK                         0x00030000
#define _IPC7_FCEIS_LENGTH                       0x00000002

#define _IPC7_FCEIP_POSITION                     0x00000012
#define _IPC7_FCEIP_MASK                         0x001C0000
#define _IPC7_FCEIP_LENGTH                       0x00000003

#define _IPC7_PREIS_POSITION                     0x00000018
#define _IPC7_PREIS_MASK                         0x03000000
#define _IPC7_PREIS_LENGTH                       0x00000002

#define _IPC7_PREIP_POSITION                     0x0000001A
#define _IPC7_PREIP_MASK                         0x1C000000
#define _IPC7_PREIP_LENGTH                       0x00000003

#define _IPC8_PFWCRCIS_POSITION                  0x00000000
#define _IPC8_PFWCRCIS_MASK                      0x00000003
#define _IPC8_PFWCRCIS_LENGTH                    0x00000002

#define _IPC8_PFWCRCIP_POSITION                  0x00000002
#define _IPC8_PFWCRCIP_MASK                      0x0000001C
#define _IPC8_PFWCRCIP_LENGTH                    0x00000003

#define _IPC8_RTCCIS_POSITION                    0x00000008
#define _IPC8_RTCCIS_MASK                        0x00000300
#define _IPC8_RTCCIS_LENGTH                      0x00000002

#define _IPC8_RTCCIP_POSITION                    0x0000000A
#define _IPC8_RTCCIP_MASK                        0x00001C00
#define _IPC8_RTCCIP_LENGTH                      0x00000003

#define _IPC8_USBIS_POSITION                     0x00000010
#define _IPC8_USBIS_MASK                         0x00030000
#define _IPC8_USBIS_LENGTH                       0x00000002

#define _IPC8_USBIP_POSITION                     0x00000012
#define _IPC8_USBIP_MASK                         0x001C0000
#define _IPC8_USBIP_LENGTH                       0x00000003

#define _IPC8_SPI1EIS_POSITION                   0x00000018
#define _IPC8_SPI1EIS_MASK                       0x03000000
#define _IPC8_SPI1EIS_LENGTH                     0x00000002

#define _IPC8_SPI1EIP_POSITION                   0x0000001A
#define _IPC8_SPI1EIP_MASK                       0x1C000000
#define _IPC8_SPI1EIP_LENGTH                     0x00000003

#define _IPC9_SPI1RXIS_POSITION                  0x00000000
#define _IPC9_SPI1RXIS_MASK                      0x00000003
#define _IPC9_SPI1RXIS_LENGTH                    0x00000002

#define _IPC9_SPI1RXIP_POSITION                  0x00000002
#define _IPC9_SPI1RXIP_MASK                      0x0000001C
#define _IPC9_SPI1RXIP_LENGTH                    0x00000003

#define _IPC9_SPI1TXIS_POSITION                  0x00000008
#define _IPC9_SPI1TXIS_MASK                      0x00000300
#define _IPC9_SPI1TXIS_LENGTH                    0x00000002

#define _IPC9_SPI1TXIP_POSITION                  0x0000000A
#define _IPC9_SPI1TXIP_MASK                      0x00001C00
#define _IPC9_SPI1TXIP_LENGTH                    0x00000003

#define _IPC9_U1EIS_POSITION                     0x00000010
#define _IPC9_U1EIS_MASK                         0x00030000
#define _IPC9_U1EIS_LENGTH                       0x00000002

#define _IPC9_U1EIP_POSITION                     0x00000012
#define _IPC9_U1EIP_MASK                         0x001C0000
#define _IPC9_U1EIP_LENGTH                       0x00000003

#define _IPC9_U1RXIS_POSITION                    0x00000018
#define _IPC9_U1RXIS_MASK                        0x03000000
#define _IPC9_U1RXIS_LENGTH                      0x00000002

#define _IPC9_U1RXIP_POSITION                    0x0000001A
#define _IPC9_U1RXIP_MASK                        0x1C000000
#define _IPC9_U1RXIP_LENGTH                      0x00000003

#define _IPC10_U1TXIS_POSITION                   0x00000000
#define _IPC10_U1TXIS_MASK                       0x00000003
#define _IPC10_U1TXIS_LENGTH                     0x00000002

#define _IPC10_U1TXIP_POSITION                   0x00000002
#define _IPC10_U1TXIP_MASK                       0x0000001C
#define _IPC10_U1TXIP_LENGTH                     0x00000003

#define _IPC10_I2C1BIS_POSITION                  0x00000008
#define _IPC10_I2C1BIS_MASK                      0x00000300
#define _IPC10_I2C1BIS_LENGTH                    0x00000002

#define _IPC10_I2C1BIP_POSITION                  0x0000000A
#define _IPC10_I2C1BIP_MASK                      0x00001C00
#define _IPC10_I2C1BIP_LENGTH                    0x00000003

#define _IPC10_I2C1SIS_POSITION                  0x00000010
#define _IPC10_I2C1SIS_MASK                      0x00030000
#define _IPC10_I2C1SIS_LENGTH                    0x00000002

#define _IPC10_I2C1SIP_POSITION                  0x00000012
#define _IPC10_I2C1SIP_MASK                      0x001C0000
#define _IPC10_I2C1SIP_LENGTH                    0x00000003

#define _IPC10_I2C1MIS_POSITION                  0x00000018
#define _IPC10_I2C1MIS_MASK                      0x03000000
#define _IPC10_I2C1MIS_LENGTH                    0x00000002

#define _IPC10_I2C1MIP_POSITION                  0x0000001A
#define _IPC10_I2C1MIP_MASK                      0x1C000000
#define _IPC10_I2C1MIP_LENGTH                    0x00000003

#define _IPC10_w_POSITION                        0x00000000
#define _IPC10_w_MASK                            0xFFFFFFFF
#define _IPC10_w_LENGTH                          0x00000020

#define _IPC11_CNAIS_POSITION                    0x00000000
#define _IPC11_CNAIS_MASK                        0x00000003
#define _IPC11_CNAIS_LENGTH                      0x00000002

#define _IPC11_CNAIP_POSITION                    0x00000002
#define _IPC11_CNAIP_MASK                        0x0000001C
#define _IPC11_CNAIP_LENGTH                      0x00000003

#define _IPC11_CNBIS_POSITION                    0x00000008
#define _IPC11_CNBIS_MASK                        0x00000300
#define _IPC11_CNBIS_LENGTH                      0x00000002

#define _IPC11_CNBIP_POSITION                    0x0000000A
#define _IPC11_CNBIP_MASK                        0x00001C00
#define _IPC11_CNBIP_LENGTH                      0x00000003

#define _IPC11_CNCIS_POSITION                    0x00000010
#define _IPC11_CNCIS_MASK                        0x00030000
#define _IPC11_CNCIS_LENGTH                      0x00000002

#define _IPC11_CNCIP_POSITION                    0x00000012
#define _IPC11_CNCIP_MASK                        0x001C0000
#define _IPC11_CNCIP_LENGTH                      0x00000003

#define _IPC11_CNKIS_POSITION                    0x00000018
#define _IPC11_CNKIS_MASK                        0x03000000
#define _IPC11_CNKIS_LENGTH                      0x00000002

#define _IPC11_CNKIP_POSITION                    0x0000001A
#define _IPC11_CNKIP_MASK                        0x1C000000
#define _IPC11_CNKIP_LENGTH                      0x00000003

#define _IPC13_SPI2EIS_POSITION                  0x00000008
#define _IPC13_SPI2EIS_MASK                      0x00000300
#define _IPC13_SPI2EIS_LENGTH                    0x00000002

#define _IPC13_SPI2EIP_POSITION                  0x0000000A
#define _IPC13_SPI2EIP_MASK                      0x00001C00
#define _IPC13_SPI2EIP_LENGTH                    0x00000003

#define _IPC13_SPI2RXIS_POSITION                 0x00000010
#define _IPC13_SPI2RXIS_MASK                     0x00030000
#define _IPC13_SPI2RXIS_LENGTH                   0x00000002

#define _IPC13_SPI2RXIP_POSITION                 0x00000012
#define _IPC13_SPI2RXIP_MASK                     0x001C0000
#define _IPC13_SPI2RXIP_LENGTH                   0x00000003

#define _IPC13_SPI2TXIS_POSITION                 0x00000018
#define _IPC13_SPI2TXIS_MASK                     0x03000000
#define _IPC13_SPI2TXIS_LENGTH                   0x00000002

#define _IPC13_SPI2TXIP_POSITION                 0x0000001A
#define _IPC13_SPI2TXIP_MASK                     0x1C000000
#define _IPC13_SPI2TXIP_LENGTH                   0x00000003

#define _IPC14_U2EIS_POSITION                    0x00000000
#define _IPC14_U2EIS_MASK                        0x00000003
#define _IPC14_U2EIS_LENGTH                      0x00000002

#define _IPC14_U2EIP_POSITION                    0x00000002
#define _IPC14_U2EIP_MASK                        0x0000001C
#define _IPC14_U2EIP_LENGTH                      0x00000003

