Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _IPC31_AD1I19IS_POSITION                 0x00000008
#define _IPC31_AD1I19IS_MASK                     0x00000300
#define _IPC31_AD1I19IS_LENGTH                   0x00000002

#define _IPC31_AD1I19IP_POSITION                 0x0000000A
#define _IPC31_AD1I19IP_MASK                     0x00001C00
#define _IPC31_AD1I19IP_LENGTH                   0x00000003

#define _IPC31_AD1I20IS_POSITION                 0x00000010
#define _IPC31_AD1I20IS_MASK                     0x00030000
#define _IPC31_AD1I20IS_LENGTH                   0x00000002

#define _IPC31_AD1I20IP_POSITION                 0x00000012
#define _IPC31_AD1I20IP_MASK                     0x001C0000
#define _IPC31_AD1I20IP_LENGTH                   0x00000003

#define _IPC31_AD1I21IS_POSITION                 0x00000018
#define _IPC31_AD1I21IS_MASK                     0x03000000
#define _IPC31_AD1I21IS_LENGTH                   0x00000002

#define _IPC31_AD1I21IP_POSITION                 0x0000001A
#define _IPC31_AD1I21IP_MASK                     0x1C000000
#define _IPC31_AD1I21IP_LENGTH                   0x00000003

#define _IPC32_AD1I22IS_POSITION                 0x00000000
#define _IPC32_AD1I22IS_MASK                     0x00000003
#define _IPC32_AD1I22IS_LENGTH                   0x00000002

#define _IPC32_AD1I22IP_POSITION                 0x00000002
#define _IPC32_AD1I22IP_MASK                     0x0000001C
#define _IPC32_AD1I22IP_LENGTH                   0x00000003

#define _IPC32_AD1I23IS_POSITION                 0x00000008
#define _IPC32_AD1I23IS_MASK                     0x00000300
#define _IPC32_AD1I23IS_LENGTH                   0x00000002

#define _IPC32_AD1I23IP_POSITION                 0x0000000A
#define _IPC32_AD1I23IP_MASK                     0x00001C00
#define _IPC32_AD1I23IP_LENGTH                   0x00000003

#define _IPC35_CAN1IS_POSITION                   0x00000010
#define _IPC35_CAN1IS_MASK                       0x00030000
#define _IPC35_CAN1IS_LENGTH                     0x00000002

#define _IPC35_CAN1IP_POSITION                   0x00000012
#define _IPC35_CAN1IP_MASK                       0x001C0000
#define _IPC35_CAN1IP_LENGTH                     0x00000003

#define _IPC35_CAN2RXIS_POSITION                 0x00000018
#define _IPC35_CAN2RXIS_MASK                     0x03000000
#define _IPC35_CAN2RXIS_LENGTH                   0x00000002

#define _IPC35_CAN2RXIP_POSITION                 0x0000001A
#define _IPC35_CAN2RXIP_MASK                     0x1C000000
#define _IPC35_CAN2RXIP_LENGTH                   0x00000003

#define _IPC36_CAN2TXIS_POSITION                 0x00000000
#define _IPC36_CAN2TXIS_MASK                     0x00000003
#define _IPC36_CAN2TXIS_LENGTH                   0x00000002

#define _IPC36_CAN2TXIP_POSITION                 0x00000002
#define _IPC36_CAN2TXIP_MASK                     0x0000001C
#define _IPC36_CAN2TXIP_LENGTH                   0x00000003

#define _IPC36_CAN2IS_POSITION                   0x00000008
#define _IPC36_CAN2IS_MASK                       0x00000300
#define _IPC36_CAN2IS_LENGTH                     0x00000002

#define _IPC36_CAN2IP_POSITION                   0x0000000A
#define _IPC36_CAN2IP_MASK                       0x00001C00
#define _IPC36_CAN2IP_LENGTH                     0x00000003

#define _IPC37_SQIIS_POSITION                    0x00000010
#define _IPC37_SQIIS_MASK                        0x00030000
#define _IPC37_SQIIS_LENGTH                      0x00000002

#define _IPC37_SQIIP_POSITION                    0x00000012
#define _IPC37_SQIIP_MASK                        0x001C0000
#define _IPC37_SQIIP_LENGTH                      0x00000003

#define _IPC38_PTGSTEPIS_POSITION                0x00000000
#define _IPC38_PTGSTEPIS_MASK                    0x00000003
#define _IPC38_PTGSTEPIS_LENGTH                  0x00000002

#define _IPC38_PTGSTEPIP_POSITION                0x00000002
#define _IPC38_PTGSTEPIP_MASK                    0x0000001C
#define _IPC38_PTGSTEPIP_LENGTH                  0x00000003

#define _IPC38_PTGWDTIS_POSITION                 0x00000008
#define _IPC38_PTGWDTIS_MASK                     0x00000300
#define _IPC38_PTGWDTIS_LENGTH                   0x00000002

#define _IPC38_PTGWDTIP_POSITION                 0x0000000A
#define _IPC38_PTGWDTIP_MASK                     0x00001C00
#define _IPC38_PTGWDTIP_LENGTH                   0x00000003

#define _IPC38_PTGTR0IS_POSITION                 0x00000010
#define _IPC38_PTGTR0IS_MASK                     0x00030000
#define _IPC38_PTGTR0IS_LENGTH                   0x00000002

#define _IPC38_PTGTR0IP_POSITION                 0x00000012
#define _IPC38_PTGTR0IP_MASK                     0x001C0000
#define _IPC38_PTGTR0IP_LENGTH                   0x00000003

#define _IPC38_PTGTR1IS_POSITION                 0x00000018
#define _IPC38_PTGTR1IS_MASK                     0x03000000
#define _IPC38_PTGTR1IS_LENGTH                   0x00000002

#define _IPC38_PTGTR1IP_POSITION                 0x0000001A
#define _IPC38_PTGTR1IP_MASK                     0x1C000000
#define _IPC38_PTGTR1IP_LENGTH                   0x00000003

#define _IPC39_PTGTR2IS_POSITION                 0x00000000
#define _IPC39_PTGTR2IS_MASK                     0x00000003
#define _IPC39_PTGTR2IS_LENGTH                   0x00000002

#define _IPC39_PTGTR2IP_POSITION                 0x00000002
#define _IPC39_PTGTR2IP_MASK                     0x0000001C
#define _IPC39_PTGTR2IP_LENGTH                   0x00000003

#define _IPC39_PTGTR3IS_POSITION                 0x00000008
#define _IPC39_PTGTR3IS_MASK                     0x00000300
#define _IPC39_PTGTR3IS_LENGTH                   0x00000002

#define _IPC39_PTGTR3IP_POSITION                 0x0000000A
#define _IPC39_PTGTR3IP_MASK                     0x00001C00
#define _IPC39_PTGTR3IP_LENGTH                   0x00000003

#define _IPC40_MPUPCIS_POSITION                  0x00000010
#define _IPC40_MPUPCIS_MASK                      0x00030000
#define _IPC40_MPUPCIS_LENGTH                    0x00000002

#define _IPC40_MPUPCIP_POSITION                  0x00000012
#define _IPC40_MPUPCIP_MASK                      0x001C0000
#define _IPC40_MPUPCIP_LENGTH                    0x00000003

#define _IPC40_FDCIS_POSITION                    0x00000018
#define _IPC40_FDCIS_MASK                        0x03000000
#define _IPC40_FDCIS_LENGTH                      0x00000002

#define _IPC40_FDCIP_POSITION                    0x0000001A
#define _IPC40_FDCIP_MASK                        0x1C000000
#define _IPC40_FDCIP_LENGTH                      0x00000003

#define _IPC41_CRPTIS_POSITION                   0x00000000
#define _IPC41_CRPTIS_MASK                       0x00000003
#define _IPC41_CRPTIS_LENGTH                     0x00000002

#define _IPC41_CRPTIP_POSITION                   0x00000002
#define _IPC41_CRPTIP_MASK                       0x0000001C
#define _IPC41_CRPTIP_LENGTH                     0x00000003

#define _IPC41_ETHIS_POSITION                    0x00000008
#define _IPC41_ETHIS_MASK                        0x00000300
#define _IPC41_ETHIS_LENGTH                      0x00000002

#define _IPC41_ETHIP_POSITION                    0x0000000A
#define _IPC41_ETHIP_MASK                        0x00001C00
#define _IPC41_ETHIP_LENGTH                      0x00000003

#define _IPC41_CRPT1IS_POSITION                  0x00000010
#define _IPC41_CRPT1IS_MASK                      0x00030000
#define _IPC41_CRPT1IS_LENGTH                    0x00000002

