Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _PRECON_PFMAWSEN_POSITION                0x00000008
#define _PRECON_PFMAWSEN_MASK                    0x00000100
#define _PRECON_PFMAWSEN_LENGTH                  0x00000001

#define _PRECON_CHEPERFEN_POSITION               0x0000000C
#define _PRECON_CHEPERFEN_MASK                   0x00001000
#define _PRECON_CHEPERFEN_LENGTH                 0x00000001

#define _PRECON_ICHECOH_POSITION                 0x00000010
#define _PRECON_ICHECOH_MASK                     0x00010000
#define _PRECON_ICHECOH_LENGTH                   0x00000001

#define _PRECON_DCHECOH_POSITION                 0x00000011
#define _PRECON_DCHECOH_MASK                     0x00020000
#define _PRECON_DCHECOH_LENGTH                   0x00000001

#define _PRECON_PERCHECOH_POSITION               0x00000012
#define _PRECON_PERCHECOH_MASK                   0x00040000
#define _PRECON_PERCHECOH_LENGTH                 0x00000001

#define _PRECON_ICHEINV_POSITION                 0x00000014
#define _PRECON_ICHEINV_MASK                     0x00100000
#define _PRECON_ICHEINV_LENGTH                   0x00000001

#define _PRECON_DCHEINV_POSITION                 0x00000015
#define _PRECON_DCHEINV_MASK                     0x00200000
#define _PRECON_DCHEINV_LENGTH                   0x00000001

#define _PRECON_PERCHEINV_POSITION               0x00000016
#define _PRECON_PERCHEINV_MASK                   0x00400000
#define _PRECON_PERCHEINV_LENGTH                 0x00000001

#define _PRECON_ICHEEN_POSITION                  0x00000018
#define _PRECON_ICHEEN_MASK                      0x01000000
#define _PRECON_ICHEEN_LENGTH                    0x00000001

#define _PRECON_DCHEEN_POSITION                  0x00000019
#define _PRECON_DCHEEN_MASK                      0x02000000
#define _PRECON_DCHEEN_LENGTH                    0x00000001

#define _PRECON_PERCHEEN_POSITION                0x0000001A
#define _PRECON_PERCHEEN_MASK                    0x04000000
#define _PRECON_PERCHEEN_LENGTH                  0x00000001

#define _PRESTAT_PFMSECCNT_POSITION              0x00000000
#define _PRESTAT_PFMSECCNT_MASK                  0x000000FF
#define _PRESTAT_PFMSECCNT_LENGTH                0x00000008

#define _PRESTAT_PFMSEC_POSITION                 0x0000001A
#define _PRESTAT_PFMSEC_MASK                     0x04000000
#define _PRESTAT_PFMSEC_LENGTH                   0x00000001

#define _PRESTAT_PFMDED_POSITION                 0x0000001B
#define _PRESTAT_PFMDED_MASK                     0x08000000
#define _PRESTAT_PFMDED_LENGTH                   0x00000001

#define _PREHIT_CHEHIT_POSITION                  0x00000000
#define _PREHIT_CHEHIT_MASK                      0xFFFFFFFF
#define _PREHIT_CHEHIT_LENGTH                    0x00000020

#define _PREMIS_CHEMIS_POSITION                  0x00000000
#define _PREMIS_CHEMIS_MASK                      0xFFFFFFFF
#define _PREMIS_CHEMIS_LENGTH                    0x00000020

#define _PMUSPICTRL_SPIWDATA_POSITION            0x00000000
#define _PMUSPICTRL_SPIWDATA_MASK                0x0000FFFF
#define _PMUSPICTRL_SPIWDATA_LENGTH              0x00000010

#define _PMUSPICTRL_SPIADDR_POSITION             0x00000010
#define _PMUSPICTRL_SPIADDR_MASK                 0x00FF0000
#define _PMUSPICTRL_SPIADDR_LENGTH               0x00000008

#define _PMUSPICTRL_CMD_POSITION                 0x00000018
#define _PMUSPICTRL_CMD_MASK                     0x01000000
#define _PMUSPICTRL_CMD_LENGTH                   0x00000001

#define _PMUSPICTRL_PMUCRST_POSITION             0x0000001E
#define _PMUSPICTRL_PMUCRST_MASK                 0x40000000
#define _PMUSPICTRL_PMUCRST_LENGTH               0x00000001

#define _PMUSPICTRL_SPIRST_POSITION              0x0000001F
#define _PMUSPICTRL_SPIRST_MASK                  0x80000000
#define _PMUSPICTRL_SPIRST_LENGTH                0x00000001

#define _PMUSPISTAT_SPIERR_POSITION              0x00000000
#define _PMUSPISTAT_SPIERR_MASK                  0x00000001
#define _PMUSPISTAT_SPIERR_LENGTH                0x00000001

#define _PMUSPISTAT_SPIRDY_POSITION              0x00000007
#define _PMUSPISTAT_SPIRDY_MASK                  0x00000080
#define _PMUSPISTAT_SPIRDY_LENGTH                0x00000001

#define _PMUSPISTAT_SPIRADDR_POSITION            0x00000008
#define _PMUSPISTAT_SPIRADDR_MASK                0x0000FF00
#define _PMUSPISTAT_SPIRADDR_LENGTH              0x00000008

#define _PMUSPISTAT_SPIRDATA_POSITION            0x00000010
#define _PMUSPISTAT_SPIRDATA_MASK                0xFFFF0000
#define _PMUSPISTAT_SPIRDATA_LENGTH              0x00000010

#define _PMUCLKCTRL_SPICLKDIV_POSITION           0x00000000
#define _PMUCLKCTRL_SPICLKDIV_MASK               0x0000003F
#define _PMUCLKCTRL_SPICLKDIV_LENGTH             0x00000006

#define _PMUCLKCTRL_PMUANABUCKBOREN_POSITION     0x00000006
#define _PMUCLKCTRL_PMUANABUCKBOREN_MASK         0x00000040
#define _PMUCLKCTRL_PMUANABUCKBOREN_LENGTH       0x00000001

#define _PMUCLKCTRL_SPISRC_POSITION              0x00000007
#define _PMUCLKCTRL_SPISRC_MASK                  0x00000080
#define _PMUCLKCTRL_SPISRC_LENGTH                0x00000001

#define _PMUCLKCTRL_BUCKCLKDIV_POSITION          0x00000008
#define _PMUCLKCTRL_BUCKCLKDIV_MASK              0x00003F00
#define _PMUCLKCTRL_BUCKCLKDIV_LENGTH            0x00000006

#define _PMUCLKCTRL_BUCKSRC_POSITION             0x0000000E
#define _PMUCLKCTRL_BUCKSRC_MASK                 0x0000C000
#define _PMUCLKCTRL_BUCKSRC_LENGTH               0x00000002

#define _PMUCLKCTRL_BACWD_POSITION               0x00000010
#define _PMUCLKCTRL_BACWD_MASK                   0x00010000
#define _PMUCLKCTRL_BACWD_LENGTH                 0x00000001

#define _PMUCLKCTRL_MLDOEXTEN_POSITION           0x00000011
#define _PMUCLKCTRL_MLDOEXTEN_MASK               0x00020000
#define _PMUCLKCTRL_MLDOEXTEN_LENGTH             0x00000001

#define _PMUCLKCTRL_MVREFFSMEN_POSITION          0x00000012
#define _PMUCLKCTRL_MVREFFSMEN_MASK              0x00040000
#define _PMUCLKCTRL_MVREFFSMEN_LENGTH            0x00000001

#define _PMUCLKCTRL_WCMRETEXBCWD_POSITION        0x00000013
#define _PMUCLKCTRL_WCMRETEXBCWD_MASK            0x00080000
#define _PMUCLKCTRL_WCMRETEXBCWD_LENGTH          0x00000001

#define _PMUCLKCTRL_CMPCYCLE_POSITION            0x00000014
#define _PMUCLKCTRL_CMPCYCLE_MASK                0x00F00000
#define _PMUCLKCTRL_CMPCYCLE_LENGTH              0x00000004

#define _PMUCLKCTRL_BKCLKHWOVR_POSITION          0x00000018
#define _PMUCLKCTRL_BKCLKHWOVR_MASK              0x01000000
#define _PMUCLKCTRL_BKCLKHWOVR_LENGTH            0x00000001

