Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _PMUCLKCTRL_MDLOEXTBOREN_POSITION        0x0000001A
#define _PMUCLKCTRL_MDLOEXTBOREN_MASK            0x04000000
#define _PMUCLKCTRL_MDLOEXTBOREN_LENGTH          0x00000001

#define _PMUCLKCTRL_ADCBOREN_POSITION            0x0000001B
#define _PMUCLKCTRL_ADCBOREN_MASK                0x08000000
#define _PMUCLKCTRL_ADCBOREN_LENGTH              0x00000001

#define _PMUCLKCTRL_BUCKBOREN_POSITION           0x0000001C
#define _PMUCLKCTRL_BUCKBOREN_MASK               0x10000000
#define _PMUCLKCTRL_BUCKBOREN_LENGTH             0x00000001

#define _PMUCLKCTRL_FBCLKCFG_POSITION            0x0000001D
#define _PMUCLKCTRL_FBCLKCFG_MASK                0x20000000
#define _PMUCLKCTRL_FBCLKCFG_LENGTH              0x00000001

#define _PMUCLKCTRL_WLDOOFF_POSITION             0x0000001E
#define _PMUCLKCTRL_WLDOOFF_MASK                 0x40000000
#define _PMUCLKCTRL_WLDOOFF_LENGTH               0x00000001

#define _PMUCLKCTRL_WCMRET_POSITION              0x0000001F
#define _PMUCLKCTRL_WCMRET_MASK                  0x80000000
#define _PMUCLKCTRL_WCMRET_LENGTH                0x00000001

#define _PMUMODECTRL1_VREG4CTRL_POSITION         0x00000000
#define _PMUMODECTRL1_VREG4CTRL_MASK             0x0000001F
#define _PMUMODECTRL1_VREG4CTRL_LENGTH           0x00000005

#define _PMUMODECTRL1_VREG3CTRL_POSITION         0x00000008
#define _PMUMODECTRL1_VREG3CTRL_MASK             0x00001F00
#define _PMUMODECTRL1_VREG3CTRL_LENGTH           0x00000005

#define _PMUMODECTRL1_VREG2CTRL_POSITION         0x00000010
#define _PMUMODECTRL1_VREG2CTRL_MASK             0x001F0000
#define _PMUMODECTRL1_VREG2CTRL_LENGTH           0x00000005

#define _PMUMODECTRL1_VREG1CTRL_POSITION         0x00000018
#define _PMUMODECTRL1_VREG1CTRL_MASK             0x1F000000
#define _PMUMODECTRL1_VREG1CTRL_LENGTH           0x00000005

#define _PMUMODECTRL1_BUCKMODE_POSITION          0x0000001D
#define _PMUMODECTRL1_BUCKMODE_MASK              0x20000000
#define _PMUMODECTRL1_BUCKMODE_LENGTH            0x00000001

#define _PMUMODECTRL1_MLDOEN_POSITION            0x0000001E
#define _PMUMODECTRL1_MLDOEN_MASK                0x40000000
#define _PMUMODECTRL1_MLDOEN_LENGTH              0x00000001

#define _PMUMODECTRL1_BUCKEN_POSITION            0x0000001F
#define _PMUMODECTRL1_BUCKEN_MASK                0x80000000
#define _PMUMODECTRL1_BUCKEN_LENGTH              0x00000001

#define _PMUMODECTRL2_VREG4CTRL_POSITION         0x00000000
#define _PMUMODECTRL2_VREG4CTRL_MASK             0x0000001F
#define _PMUMODECTRL2_VREG4CTRL_LENGTH           0x00000005

#define _PMUMODECTRL2_VREG3CTRL_POSITION         0x00000008
#define _PMUMODECTRL2_VREG3CTRL_MASK             0x00001F00
#define _PMUMODECTRL2_VREG3CTRL_LENGTH           0x00000005

#define _PMUMODECTRL2_VREG2CTRL_POSITION         0x00000010
#define _PMUMODECTRL2_VREG2CTRL_MASK             0x001F0000
#define _PMUMODECTRL2_VREG2CTRL_LENGTH           0x00000005

#define _PMUMODECTRL2_VREG1CTRL_POSITION         0x00000018
#define _PMUMODECTRL2_VREG1CTRL_MASK             0x1F000000
#define _PMUMODECTRL2_VREG1CTRL_LENGTH           0x00000005

#define _PMUMODECTRL2_BUCKMODE_POSITION          0x0000001D
#define _PMUMODECTRL2_BUCKMODE_MASK              0x20000000
#define _PMUMODECTRL2_BUCKMODE_LENGTH            0x00000001

#define _PMUMODECTRL2_MLDOEN_POSITION            0x0000001E
#define _PMUMODECTRL2_MLDOEN_MASK                0x40000000
#define _PMUMODECTRL2_MLDOEN_LENGTH              0x00000001

#define _PMUMODECTRL2_BUCKEN_POSITION            0x0000001F
#define _PMUMODECTRL2_BUCKEN_MASK                0x80000000
#define _PMUMODECTRL2_BUCKEN_LENGTH              0x00000001

#define _PMUMODECTRL3_VREG4CTRL_POSITION         0x00000000
#define _PMUMODECTRL3_VREG4CTRL_MASK             0x0000001F
#define _PMUMODECTRL3_VREG4CTRL_LENGTH           0x00000005

#define _PMUMODECTRL3_VREG3CTRL_POSITION         0x00000008
#define _PMUMODECTRL3_VREG3CTRL_MASK             0x00001F00
#define _PMUMODECTRL3_VREG3CTRL_LENGTH           0x00000005

#define _PMUMODECTRL3_VREG2CTRL_POSITION         0x00000010
#define _PMUMODECTRL3_VREG2CTRL_MASK             0x001F0000
#define _PMUMODECTRL3_VREG2CTRL_LENGTH           0x00000005

#define _PMUMODECTRL3_VREG1CTRL_POSITION         0x00000018
#define _PMUMODECTRL3_VREG1CTRL_MASK             0x1F000000
#define _PMUMODECTRL3_VREG1CTRL_LENGTH           0x00000005

#define _PMUMODECTRL3_BUCKMODE_POSITION          0x0000001D
#define _PMUMODECTRL3_BUCKMODE_MASK              0x20000000
#define _PMUMODECTRL3_BUCKMODE_LENGTH            0x00000001

#define _PMUMODECTRL3_MLDOEN_POSITION            0x0000001E
#define _PMUMODECTRL3_MLDOEN_MASK                0x40000000
#define _PMUMODECTRL3_MLDOEN_LENGTH              0x00000001

#define _PMUMODECTRL3_BUCKEN_POSITION            0x0000001F
#define _PMUMODECTRL3_BUCKEN_MASK                0x80000000
#define _PMUMODECTRL3_BUCKEN_LENGTH              0x00000001

#define _PMUMODECTRL4_VREG4CTRL_POSITION         0x00000000
#define _PMUMODECTRL4_VREG4CTRL_MASK             0x0000001F
#define _PMUMODECTRL4_VREG4CTRL_LENGTH           0x00000005

#define _PMUMODECTRL4_VREG3CTRL_POSITION         0x00000008
#define _PMUMODECTRL4_VREG3CTRL_MASK             0x00001F00
#define _PMUMODECTRL4_VREG3CTRL_LENGTH           0x00000005

#define _PMUMODECTRL4_VREG2CTRL_POSITION         0x00000010
#define _PMUMODECTRL4_VREG2CTRL_MASK             0x001F0000
#define _PMUMODECTRL4_VREG2CTRL_LENGTH           0x00000005

#define _PMUMODECTRL4_VREG1CTRL_POSITION         0x00000018
#define _PMUMODECTRL4_VREG1CTRL_MASK             0x1F000000
#define _PMUMODECTRL4_VREG1CTRL_LENGTH           0x00000005

#define _PMUMODECTRL4_BUCKMODE_POSITION          0x0000001D
#define _PMUMODECTRL4_BUCKMODE_MASK              0x20000000
#define _PMUMODECTRL4_BUCKMODE_LENGTH            0x00000001

#define _PMUMODECTRL4_MLDOEN_POSITION            0x0000001E
#define _PMUMODECTRL4_MLDOEN_MASK                0x40000000
#define _PMUMODECTRL4_MLDOEN_LENGTH              0x00000001

#define _PMUMODECTRL4_BUCKEN_POSITION            0x0000001F
#define _PMUMODECTRL4_BUCKEN_MASK                0x80000000
#define _PMUMODECTRL4_BUCKEN_LENGTH              0x00000001

#define _PMUOVERCTRL_VREG4OCTRL_POSITION         0x00000000
#define _PMUOVERCTRL_VREG4OCTRL_MASK             0x0000001F
#define _PMUOVERCTRL_VREG4OCTRL_LENGTH           0x00000005

#define _PMUOVERCTRL_VREG3OCTRL_POSITION         0x00000008
#define _PMUOVERCTRL_VREG3OCTRL_MASK             0x00001F00
#define _PMUOVERCTRL_VREG3OCTRL_LENGTH           0x00000005

#define _PMUOVERCTRL_ORETEXIT_POSITION           0x0000000E
#define _PMUOVERCTRL_ORETEXIT_MASK               0x00004000
#define _PMUOVERCTRL_ORETEXIT_LENGTH             0x00000001

#define _PMUOVERCTRL_OWLDOEN_POSITION            0x0000000F
#define _PMUOVERCTRL_OWLDOEN_MASK                0x00008000
#define _PMUOVERCTRL_OWLDOEN_LENGTH              0x00000001

