Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _PMUOVERCTRL_VREG2OCTRL_POSITION         0x00000010
#define _PMUOVERCTRL_VREG2OCTRL_MASK             0x001F0000
#define _PMUOVERCTRL_VREG2OCTRL_LENGTH           0x00000005

#define _PMUOVERCTRL_PHWC_POSITION               0x00000016
#define _PMUOVERCTRL_PHWC_MASK                   0x00400000
#define _PMUOVERCTRL_PHWC_LENGTH                 0x00000001

#define _PMUOVERCTRL_OVEREN_POSITION             0x00000017
#define _PMUOVERCTRL_OVEREN_MASK                 0x00800000
#define _PMUOVERCTRL_OVEREN_LENGTH               0x00000001

#define _PMUOVERCTRL_VREG1OCTRL_POSITION         0x00000018
#define _PMUOVERCTRL_VREG1OCTRL_MASK             0x1F000000
#define _PMUOVERCTRL_VREG1OCTRL_LENGTH           0x00000005

#define _PMUOVERCTRL_OBUCKMODE_POSITION          0x0000001D
#define _PMUOVERCTRL_OBUCKMODE_MASK              0x20000000
#define _PMUOVERCTRL_OBUCKMODE_LENGTH            0x00000001

#define _PMUOVERCTRL_OMLDOEN_POSITION            0x0000001E
#define _PMUOVERCTRL_OMLDOEN_MASK                0x40000000
#define _PMUOVERCTRL_OMLDOEN_LENGTH              0x00000001

#define _PMUOVERCTRL_OBUCKEN_POSITION            0x0000001F
#define _PMUOVERCTRL_OBUCKEN_MASK                0x80000000
#define _PMUOVERCTRL_OBUCKEN_LENGTH              0x00000001

#define _PMUCMODE_CVREG4OCTRL_POSITION           0x00000000
#define _PMUCMODE_CVREG4OCTRL_MASK               0x0000001F
#define _PMUCMODE_CVREG4OCTRL_LENGTH             0x00000005

#define _PMUCMODE_CVREG3OCTRL_POSITION           0x00000008
#define _PMUCMODE_CVREG3OCTRL_MASK               0x00001F00
#define _PMUCMODE_CVREG3OCTRL_LENGTH             0x00000005

#define _PMUCMODE_CVREG2OCTRL_POSITION           0x00000010
#define _PMUCMODE_CVREG2OCTRL_MASK               0x001F0000
#define _PMUCMODE_CVREG2OCTRL_LENGTH             0x00000005

#define _PMUCMODE_ADCBOR_POSITION                0x00000015
#define _PMUCMODE_ADCBOR_MASK                    0x00200000
#define _PMUCMODE_ADCBOR_LENGTH                  0x00000001

#define _PMUCMODE_BUCKBOR_POSITION               0x00000016
#define _PMUCMODE_BUCKBOR_MASK                   0x00400000
#define _PMUCMODE_BUCKBOR_LENGTH                 0x00000001

#define _PMUCMODE_MLDOEXTBOR_POSITION            0x00000017
#define _PMUCMODE_MLDOEXTBOR_MASK                0x00800000
#define _PMUCMODE_MLDOEXTBOR_LENGTH              0x00000001

#define _PMUCMODE_CVREG1OCTRL_POSITION           0x00000018
#define _PMUCMODE_CVREG1OCTRL_MASK               0x1F000000
#define _PMUCMODE_CVREG1OCTRL_LENGTH             0x00000005

#define _PMUCMODE_CBUCKMODE_POSITION             0x0000001D
#define _PMUCMODE_CBUCKMODE_MASK                 0x20000000
#define _PMUCMODE_CBUCKMODE_LENGTH               0x00000001

#define _PMUCMODE_CMLDOEN_POSITION               0x0000001E
#define _PMUCMODE_CMLDOEN_MASK                   0x40000000
#define _PMUCMODE_CMLDOEN_LENGTH                 0x00000001

#define _PMUCMODE_CBUCKEN_POSITION               0x0000001F
#define _PMUCMODE_CBUCKEN_MASK                   0x80000000
#define _PMUCMODE_CBUCKEN_LENGTH                 0x00000001

#define _PMUSTATUS_STATUS_POSITION               0x00000000
#define _PMUSTATUS_STATUS_MASK                   0x0000001F
#define _PMUSTATUS_STATUS_LENGTH                 0x00000005

#define _PMUSTATUS_WCMRM_POSITION                0x00000005
#define _PMUSTATUS_WCMRM_MASK                    0x00000020
#define _PMUSTATUS_WCMRM_LENGTH                  0x00000001

#define _PMUSTATUS_PMUANABUCKBOR_POSITION        0x00000006
#define _PMUSTATUS_PMUANABUCKBOR_MASK            0x00000040
#define _PMUSTATUS_PMUANABUCKBOR_LENGTH          0x00000001

#define _PMUSTATUS_WLDORDY_POSITION              0x00000007
#define _PMUSTATUS_WLDORDY_MASK                  0x00000080
#define _PMUSTATUS_WLDORDY_LENGTH                0x00000001

#define _PMUSTATUS_BSSEDATA_POSITION             0x00000008
#define _PMUSTATUS_BSSEDATA_MASK                 0x00FFFF00
#define _PMUSTATUS_BSSEDATA_LENGTH               0x00000010

#define _PMUSTATUS_BSSENUM_POSITION              0x00000018
#define _PMUSTATUS_BSSENUM_MASK                  0x7F000000
#define _PMUSTATUS_BSSENUM_LENGTH                0x00000007

#define _PMUSTATUS_BSSERR_POSITION               0x0000001F
#define _PMUSTATUS_BSSERR_MASK                   0x80000000
#define _PMUSTATUS_BSSERR_LENGTH                 0x00000001

#define _PMUSEQ1_DELAY_POSITION                  0x00000000
#define _PMUSEQ1_DELAY_MASK                      0x0000003F
#define _PMUSEQ1_DELAY_LENGTH                    0x00000006

#define _PMUSEQ1_CMPBVAL_POSITION                0x00000006
#define _PMUSEQ1_CMPBVAL_MASK                    0x00000040
#define _PMUSEQ1_CMPBVAL_LENGTH                  0x00000001

#define _PMUSEQ1_CMD_POSITION                    0x00000007
#define _PMUSEQ1_CMD_MASK                        0x00000080
#define _PMUSEQ1_CMD_LENGTH                      0x00000001

#define _PMUSEQ1_SPIADDR_POSITION                0x00000008
#define _PMUSEQ1_SPIADDR_MASK                    0x0000FF00
#define _PMUSEQ1_SPIADDR_LENGTH                  0x00000008

#define _PMUSEQ1_SPIDATA_POSITION                0x00000010
#define _PMUSEQ1_SPIDATA_MASK                    0xFFFF0000
#define _PMUSEQ1_SPIDATA_LENGTH                  0x00000010

#define _PMUSEQ2_DELAY_POSITION                  0x00000000
#define _PMUSEQ2_DELAY_MASK                      0x0000003F
#define _PMUSEQ2_DELAY_LENGTH                    0x00000006

#define _PMUSEQ2_CMPBVAL_POSITION                0x00000006
#define _PMUSEQ2_CMPBVAL_MASK                    0x00000040
#define _PMUSEQ2_CMPBVAL_LENGTH                  0x00000001

#define _PMUSEQ2_CMD_POSITION                    0x00000007
#define _PMUSEQ2_CMD_MASK                        0x00000080
#define _PMUSEQ2_CMD_LENGTH                      0x00000001

#define _PMUSEQ2_SPIADDR_POSITION                0x00000008
#define _PMUSEQ2_SPIADDR_MASK                    0x0000FF00
#define _PMUSEQ2_SPIADDR_LENGTH                  0x00000008

#define _PMUSEQ2_SPIDATA_POSITION                0x00000010
#define _PMUSEQ2_SPIDATA_MASK                    0xFFFF0000
#define _PMUSEQ2_SPIDATA_LENGTH                  0x00000010

#define _PMUSEQ3_DELAY_POSITION                  0x00000000
#define _PMUSEQ3_DELAY_MASK                      0x0000003F
#define _PMUSEQ3_DELAY_LENGTH                    0x00000006

#define _PMUSEQ3_CMPBVAL_POSITION                0x00000006
#define _PMUSEQ3_CMPBVAL_MASK                    0x00000040
#define _PMUSEQ3_CMPBVAL_LENGTH                  0x00000001

