Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _PMUSEQ3_CMD_POSITION                    0x00000007
#define _PMUSEQ3_CMD_MASK                        0x00000080
#define _PMUSEQ3_CMD_LENGTH                      0x00000001

#define _PMUSEQ3_SPIADDR_POSITION                0x00000008
#define _PMUSEQ3_SPIADDR_MASK                    0x0000FF00
#define _PMUSEQ3_SPIADDR_LENGTH                  0x00000008

#define _PMUSEQ3_SPIDATA_POSITION                0x00000010
#define _PMUSEQ3_SPIDATA_MASK                    0xFFFF0000
#define _PMUSEQ3_SPIDATA_LENGTH                  0x00000010

#define _PMUSEQ4_DELAY_POSITION                  0x00000000
#define _PMUSEQ4_DELAY_MASK                      0x0000003F
#define _PMUSEQ4_DELAY_LENGTH                    0x00000006

#define _PMUSEQ4_CMPBVAL_POSITION                0x00000006
#define _PMUSEQ4_CMPBVAL_MASK                    0x00000040
#define _PMUSEQ4_CMPBVAL_LENGTH                  0x00000001

#define _PMUSEQ4_CMD_POSITION                    0x00000007
#define _PMUSEQ4_CMD_MASK                        0x00000080
#define _PMUSEQ4_CMD_LENGTH                      0x00000001

#define _PMUSEQ4_SPIADDR_POSITION                0x00000008
#define _PMUSEQ4_SPIADDR_MASK                    0x0000FF00
#define _PMUSEQ4_SPIADDR_LENGTH                  0x00000008

#define _PMUSEQ4_SPIDATA_POSITION                0x00000010
#define _PMUSEQ4_SPIDATA_MASK                    0xFFFF0000
#define _PMUSEQ4_SPIDATA_LENGTH                  0x00000010

#define _PMUCFG_BUCKSWDELAY_POSITION             0x00000000
#define _PMUCFG_BUCKSWDELAY_MASK                 0x0000007F
#define _PMUCFG_BUCKSWDELAY_LENGTH               0x00000007

#define _PMUCFG_MLDOSWDELAY_POSITION             0x00000007
#define _PMUCFG_MLDOSWDELAY_MASK                 0x00003F80
#define _PMUCFG_MLDOSWDELAY_LENGTH               0x00000007

#define _PMUCFG_MLDOEXTL_POSITION                0x0000000E
#define _PMUCFG_MLDOEXTL_MASK                    0x0000C000
#define _PMUCFG_MLDOEXTL_LENGTH                  0x00000002

#define _PMUCFG_BUCKCPL_POSITION                 0x00000010
#define _PMUCFG_BUCKCPL_MASK                     0x000F0000
#define _PMUCFG_BUCKCPL_LENGTH                   0x00000004

#define _PMUCFG_BUCKCPH_POSITION                 0x00000014
#define _PMUCFG_BUCKCPH_MASK                     0x00F00000
#define _PMUCFG_BUCKCPH_LENGTH                   0x00000004

#define _PMUCFG_ADCCPL_POSITION                  0x00000018
#define _PMUCFG_ADCCPL_MASK                      0x0F000000
#define _PMUCFG_ADCCPL_LENGTH                    0x00000004

#define _PMUCFG_ADCCPH_POSITION                  0x0000001C
#define _PMUCFG_ADCCPH_MASK                      0xF0000000
#define _PMUCFG_ADCCPH_LENGTH                    0x00000004

#define _PMUWCMCMD_WCMADDR_POSITION              0x00000000
#define _PMUWCMCMD_WCMADDR_MASK                  0x000007FF
#define _PMUWCMCMD_WCMADDR_LENGTH                0x0000000B

#define _PMUWCMCMD_WCMCLKDIV_POSITION            0x00000010
#define _PMUWCMCMD_WCMCLKDIV_MASK                0x00070000
#define _PMUWCMCMD_WCMCLKDIV_LENGTH              0x00000003

#define _PMUWCMCMD_WCMRDY_POSITION               0x0000001C
#define _PMUWCMCMD_WCMRDY_MASK                   0x10000000
#define _PMUWCMCMD_WCMRDY_LENGTH                 0x00000001

#define _PMUWCMCMD_CMD_POSITION                  0x0000001E
#define _PMUWCMCMD_CMD_MASK                      0x40000000
#define _PMUWCMCMD_CMD_LENGTH                    0x00000001

#define _PMUWCMCMD_MODE_POSITION                 0x0000001F
#define _PMUWCMCMD_MODE_MASK                     0x80000000
#define _PMUWCMCMD_MODE_LENGTH                   0x00000001

#define _PMUWCMWDATA_WDATA_POSITION              0x00000000
#define _PMUWCMWDATA_WDATA_MASK                  0xFFFFFFFF
#define _PMUWCMWDATA_WDATA_LENGTH                0x00000020

#define _PMUWCMRDATA_RDATA_POSITION              0x00000000
#define _PMUWCMRDATA_RDATA_MASK                  0xFFFFFFFF
#define _PMUWCMRDATA_RDATA_LENGTH                0x00000020

#define _PMUVBCCMD_VBCADDR_POSITION              0x00000000
#define _PMUVBCCMD_VBCADDR_MASK                  0x0000FFFF
#define _PMUVBCCMD_VBCADDR_LENGTH                0x00000010

#define _PMUVBCCMD_VBCRDY_POSITION               0x0000001C
#define _PMUVBCCMD_VBCRDY_MASK                   0x10000000
#define _PMUVBCCMD_VBCRDY_LENGTH                 0x00000001

#define _PMUVBCCMD_CMD_POSITION                  0x0000001E
#define _PMUVBCCMD_CMD_MASK                      0x40000000
#define _PMUVBCCMD_CMD_LENGTH                    0x00000001

#define _PMUVCBWDATA_WDATA_POSITION              0x00000000
#define _PMUVCBWDATA_WDATA_MASK                  0xFFFFFFFF
#define _PMUVCBWDATA_WDATA_LENGTH                0x00000020

#define _PMUVCBRDATA_RDATA_POSITION              0x00000000
#define _PMUVCBRDATA_RDATA_MASK                  0xFFFFFFFF
#define _PMUVCBRDATA_RDATA_LENGTH                0x00000020

#define _WCMCFG_WCM1CFG_POSITION                 0x00000000
#define _WCMCFG_WCM1CFG_MASK                     0x00000007
#define _WCMCFG_WCM1CFG_LENGTH                   0x00000003

#define _WCMCFG_WCM2CFG_POSITION                 0x00000004
#define _WCMCFG_WCM2CFG_MASK                     0x00000070
#define _WCMCFG_WCM2CFG_LENGTH                   0x00000003

#define _WCMCFG_SRAM1CFG_POSITION                0x00000008
#define _WCMCFG_SRAM1CFG_MASK                    0x00000700
#define _WCMCFG_SRAM1CFG_LENGTH                  0x00000003

#define _WCMCFG_SRAM2CFG_POSITION                0x0000000C
#define _WCMCFG_SRAM2CFG_MASK                    0x00007000
#define _WCMCFG_SRAM2CFG_LENGTH                  0x00000003

#define _WCMCFG_SRAM3CFG_POSITION                0x00000010
#define _WCMCFG_SRAM3CFG_MASK                    0x00070000
#define _WCMCFG_SRAM3CFG_LENGTH                  0x00000003

#define _WCMCFG_SRAM4CFG_POSITION                0x00000014
#define _WCMCFG_SRAM4CFG_MASK                    0x00700000
#define _WCMCFG_SRAM4CFG_LENGTH                  0x00000003

#define _WCMCFG_SRAM5CFG_POSITION                0x00000018
#define _WCMCFG_SRAM5CFG_MASK                    0x07000000
#define _WCMCFG_SRAM5CFG_LENGTH                  0x00000003

