Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _WCMCFG_SRAM6CFG_POSITION                0x0000001C
#define _WCMCFG_SRAM6CFG_MASK                    0x70000000
#define _WCMCFG_SRAM6CFG_LENGTH                  0x00000003

#define _PMUIENB_ADCBORIEN_POSITION              0x00000000
#define _PMUIENB_ADCBORIEN_MASK                  0x00000001
#define _PMUIENB_ADCBORIEN_LENGTH                0x00000001

#define _PMUIENB_BUCKBORIEN_POSITION             0x00000001
#define _PMUIENB_BUCKBORIEN_MASK                 0x00000002
#define _PMUIENB_BUCKBORIEN_LENGTH               0x00000001

#define _PMUIENB_SCMPIEN_POSITION                0x00000002
#define _PMUIENB_SCMPIEN_MASK                    0x00000004
#define _PMUIENB_SCMPIEN_LENGTH                  0x00000001

#define _PMUIENB_WCMIAIEN_POSITION               0x00000003
#define _PMUIENB_WCMIAIEN_MASK                   0x00000008
#define _PMUIENB_WCMIAIEN_LENGTH                 0x00000001

#define _PMUIENB_VBCIAIEN_POSITION               0x00000004
#define _PMUIENB_VBCIAIEN_MASK                   0x00000010
#define _PMUIENB_VBCIAIEN_LENGTH                 0x00000001

#define _PMUISTAT_ADCBORINT_POSITION             0x00000000
#define _PMUISTAT_ADCBORINT_MASK                 0x00000001
#define _PMUISTAT_ADCBORINT_LENGTH               0x00000001

#define _PMUISTAT_BUCKBORINT_POSITION            0x00000001
#define _PMUISTAT_BUCKBORINT_MASK                0x00000002
#define _PMUISTAT_BUCKBORINT_LENGTH              0x00000001

#define _PMUISTAT_SCMPINT_POSITION               0x00000002
#define _PMUISTAT_SCMPINT_MASK                   0x00000004
#define _PMUISTAT_SCMPINT_LENGTH                 0x00000001

#define _PMUISTAT_WCMIAINT_POSITION              0x00000003
#define _PMUISTAT_WCMIAINT_MASK                  0x00000008
#define _PMUISTAT_WCMIAINT_LENGTH                0x00000001

#define _PMUISTAT_VBCIAINT_POSITION              0x00000004
#define _PMUISTAT_VBCIAINT_MASK                  0x00000010
#define _PMUISTAT_VBCIAINT_LENGTH                0x00000001

#define _WCMSIZ_WCM1SIZ_POSITION                 0x00000000
#define _WCMSIZ_WCM1SIZ_MASK                     0x00000003
#define _WCMSIZ_WCM1SIZ_LENGTH                   0x00000002

#define _WCMSIZ_WCM2SIZ_POSITION                 0x00000004
#define _WCMSIZ_WCM2SIZ_MASK                     0x00000030
#define _WCMSIZ_WCM2SIZ_LENGTH                   0x00000002

#define _WCMSIZ_SRAM1SIZ_POSITION                0x00000008
#define _WCMSIZ_SRAM1SIZ_MASK                    0x00000300
#define _WCMSIZ_SRAM1SIZ_LENGTH                  0x00000002

#define _WCMSIZ_SRAM2SIZ_POSITION                0x0000000C
#define _WCMSIZ_SRAM2SIZ_MASK                    0x00003000
#define _WCMSIZ_SRAM2SIZ_LENGTH                  0x00000002

#define _WCMSIZ_SRAM3SIZ_POSITION                0x00000010
#define _WCMSIZ_SRAM3SIZ_MASK                    0x00030000
#define _WCMSIZ_SRAM3SIZ_LENGTH                  0x00000002

#define _WCMSIZ_SRAM4SIZ_POSITION                0x00000014
#define _WCMSIZ_SRAM4SIZ_MASK                    0x00300000
#define _WCMSIZ_SRAM4SIZ_LENGTH                  0x00000002

#define _WCMSIZ_SRAM5SIZ_POSITION                0x00000018
#define _WCMSIZ_SRAM5SIZ_MASK                    0x03000000
#define _WCMSIZ_SRAM5SIZ_LENGTH                  0x00000002

#define _WCMSIZ_SRAM6SIZ_POSITION                0x0000001C
#define _WCMSIZ_SRAM6SIZ_MASK                    0x30000000
#define _WCMSIZ_SRAM6SIZ_LENGTH                  0x00000002

#define _PMUWCM_WCMDATA_POSITION                 0x00000000
#define _PMUWCM_WCMDATA_MASK                     0xFFFFFFFF
#define _PMUWCM_WCMDATA_LENGTH                   0x00000020

#define _ANSELA_ANSA10_POSITION                  0x0000000A
#define _ANSELA_ANSA10_MASK                      0x00000400
#define _ANSELA_ANSA10_LENGTH                    0x00000001

#define _ANSELA_ANSA12_POSITION                  0x0000000C
#define _ANSELA_ANSA12_MASK                      0x00001000
#define _ANSELA_ANSA12_LENGTH                    0x00000001

#define _ANSELA_ANSA13_POSITION                  0x0000000D
#define _ANSELA_ANSA13_MASK                      0x00002000
#define _ANSELA_ANSA13_LENGTH                    0x00000001

#define _ANSELA_ANSA14_POSITION                  0x0000000E
#define _ANSELA_ANSA14_MASK                      0x00004000
#define _ANSELA_ANSA14_LENGTH                    0x00000001

#define _ANSELA_ANSA15_POSITION                  0x0000000F
#define _ANSELA_ANSA15_MASK                      0x00008000
#define _ANSELA_ANSA15_LENGTH                    0x00000001

#define _ANSELA_w_POSITION                       0x00000000
#define _ANSELA_w_MASK                           0xFFFFFFFF
#define _ANSELA_w_LENGTH                         0x00000020

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

#define _TRISA_TRISA3_POSITION                   0x00000003
#define _TRISA_TRISA3_MASK                       0x00000008
#define _TRISA_TRISA3_LENGTH                     0x00000001

#define _TRISA_TRISA4_POSITION                   0x00000004
#define _TRISA_TRISA4_MASK                       0x00000010
#define _TRISA_TRISA4_LENGTH                     0x00000001

#define _TRISA_TRISA5_POSITION                   0x00000005
#define _TRISA_TRISA5_MASK                       0x00000020
#define _TRISA_TRISA5_LENGTH                     0x00000001

#define _TRISA_TRISA6_POSITION                   0x00000006
#define _TRISA_TRISA6_MASK                       0x00000040
#define _TRISA_TRISA6_LENGTH                     0x00000001

#define _TRISA_TRISA7_POSITION                   0x00000007
#define _TRISA_TRISA7_MASK                       0x00000080
#define _TRISA_TRISA7_LENGTH                     0x00000001

