Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _TRISK_TRISK7_POSITION                   0x00000007
#define _TRISK_TRISK7_MASK                       0x00000080
#define _TRISK_TRISK7_LENGTH                     0x00000001

#define _TRISK_TRISK8_POSITION                   0x00000008
#define _TRISK_TRISK8_MASK                       0x00000100
#define _TRISK_TRISK8_LENGTH                     0x00000001

#define _TRISK_TRISK9_POSITION                   0x00000009
#define _TRISK_TRISK9_MASK                       0x00000200
#define _TRISK_TRISK9_LENGTH                     0x00000001

#define _TRISK_TRISK10_POSITION                  0x0000000A
#define _TRISK_TRISK10_MASK                      0x00000400
#define _TRISK_TRISK10_LENGTH                    0x00000001

#define _TRISK_TRISK11_POSITION                  0x0000000B
#define _TRISK_TRISK11_MASK                      0x00000800
#define _TRISK_TRISK11_LENGTH                    0x00000001

#define _TRISK_TRISK12_POSITION                  0x0000000C
#define _TRISK_TRISK12_MASK                      0x00001000
#define _TRISK_TRISK12_LENGTH                    0x00000001

#define _TRISK_TRISK13_POSITION                  0x0000000D
#define _TRISK_TRISK13_MASK                      0x00002000
#define _TRISK_TRISK13_LENGTH                    0x00000001

#define _TRISK_TRISK14_POSITION                  0x0000000E
#define _TRISK_TRISK14_MASK                      0x00004000
#define _TRISK_TRISK14_LENGTH                    0x00000001

#define _TRISK_w_POSITION                        0x00000000
#define _TRISK_w_MASK                            0xFFFFFFFF
#define _TRISK_w_LENGTH                          0x00000020

#define _PORTK_RK0_POSITION                      0x00000000
#define _PORTK_RK0_MASK                          0x00000001
#define _PORTK_RK0_LENGTH                        0x00000001

#define _PORTK_RK1_POSITION                      0x00000001
#define _PORTK_RK1_MASK                          0x00000002
#define _PORTK_RK1_LENGTH                        0x00000001

#define _PORTK_RK2_POSITION                      0x00000002
#define _PORTK_RK2_MASK                          0x00000004
#define _PORTK_RK2_LENGTH                        0x00000001

#define _PORTK_RK3_POSITION                      0x00000003
#define _PORTK_RK3_MASK                          0x00000008
#define _PORTK_RK3_LENGTH                        0x00000001

#define _PORTK_RK4_POSITION                      0x00000004
#define _PORTK_RK4_MASK                          0x00000010
#define _PORTK_RK4_LENGTH                        0x00000001

#define _PORTK_RK5_POSITION                      0x00000005
#define _PORTK_RK5_MASK                          0x00000020
#define _PORTK_RK5_LENGTH                        0x00000001

#define _PORTK_RK6_POSITION                      0x00000006
#define _PORTK_RK6_MASK                          0x00000040
#define _PORTK_RK6_LENGTH                        0x00000001

#define _PORTK_RK7_POSITION                      0x00000007
#define _PORTK_RK7_MASK                          0x00000080
#define _PORTK_RK7_LENGTH                        0x00000001

#define _PORTK_RK8_POSITION                      0x00000008
#define _PORTK_RK8_MASK                          0x00000100
#define _PORTK_RK8_LENGTH                        0x00000001

#define _PORTK_RK9_POSITION                      0x00000009
#define _PORTK_RK9_MASK                          0x00000200
#define _PORTK_RK9_LENGTH                        0x00000001

#define _PORTK_RK10_POSITION                     0x0000000A
#define _PORTK_RK10_MASK                         0x00000400
#define _PORTK_RK10_LENGTH                       0x00000001

#define _PORTK_RK11_POSITION                     0x0000000B
#define _PORTK_RK11_MASK                         0x00000800
#define _PORTK_RK11_LENGTH                       0x00000001

#define _PORTK_RK12_POSITION                     0x0000000C
#define _PORTK_RK12_MASK                         0x00001000
#define _PORTK_RK12_LENGTH                       0x00000001

#define _PORTK_RK13_POSITION                     0x0000000D
#define _PORTK_RK13_MASK                         0x00002000
#define _PORTK_RK13_LENGTH                       0x00000001

#define _PORTK_RK14_POSITION                     0x0000000E
#define _PORTK_RK14_MASK                         0x00004000
#define _PORTK_RK14_LENGTH                       0x00000001

#define _PORTK_w_POSITION                        0x00000000
#define _PORTK_w_MASK                            0xFFFFFFFF
#define _PORTK_w_LENGTH                          0x00000020

#define _LATK_LATK0_POSITION                     0x00000000
#define _LATK_LATK0_MASK                         0x00000001
#define _LATK_LATK0_LENGTH                       0x00000001

#define _LATK_LATK1_POSITION                     0x00000001
#define _LATK_LATK1_MASK                         0x00000002
#define _LATK_LATK1_LENGTH                       0x00000001

#define _LATK_LATK2_POSITION                     0x00000002
#define _LATK_LATK2_MASK                         0x00000004
#define _LATK_LATK2_LENGTH                       0x00000001

#define _LATK_LATK3_POSITION                     0x00000003
#define _LATK_LATK3_MASK                         0x00000008
#define _LATK_LATK3_LENGTH                       0x00000001

#define _LATK_LATK4_POSITION                     0x00000004
#define _LATK_LATK4_MASK                         0x00000010
#define _LATK_LATK4_LENGTH                       0x00000001

#define _LATK_LATK5_POSITION                     0x00000005
#define _LATK_LATK5_MASK                         0x00000020
#define _LATK_LATK5_LENGTH                       0x00000001

#define _LATK_LATK6_POSITION                     0x00000006
#define _LATK_LATK6_MASK                         0x00000040
#define _LATK_LATK6_LENGTH                       0x00000001

#define _LATK_LATK7_POSITION                     0x00000007
#define _LATK_LATK7_MASK                         0x00000080
#define _LATK_LATK7_LENGTH                       0x00000001

#define _LATK_LATK8_POSITION                     0x00000008
#define _LATK_LATK8_MASK                         0x00000100
#define _LATK_LATK8_LENGTH                       0x00000001

