Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _CNPUK_w_POSITION                        0x00000000
#define _CNPUK_w_MASK                            0xFFFFFFFF
#define _CNPUK_w_LENGTH                          0x00000020

#define _CNPDK_CNPDK0_POSITION                   0x00000000
#define _CNPDK_CNPDK0_MASK                       0x00000001
#define _CNPDK_CNPDK0_LENGTH                     0x00000001

#define _CNPDK_CNPDK1_POSITION                   0x00000001
#define _CNPDK_CNPDK1_MASK                       0x00000002
#define _CNPDK_CNPDK1_LENGTH                     0x00000001

#define _CNPDK_CNPDK2_POSITION                   0x00000002
#define _CNPDK_CNPDK2_MASK                       0x00000004
#define _CNPDK_CNPDK2_LENGTH                     0x00000001

#define _CNPDK_CNPDK3_POSITION                   0x00000003
#define _CNPDK_CNPDK3_MASK                       0x00000008
#define _CNPDK_CNPDK3_LENGTH                     0x00000001

#define _CNPDK_CNPDK4_POSITION                   0x00000004
#define _CNPDK_CNPDK4_MASK                       0x00000010
#define _CNPDK_CNPDK4_LENGTH                     0x00000001

#define _CNPDK_CNPDK5_POSITION                   0x00000005
#define _CNPDK_CNPDK5_MASK                       0x00000020
#define _CNPDK_CNPDK5_LENGTH                     0x00000001

#define _CNPDK_CNPDK6_POSITION                   0x00000006
#define _CNPDK_CNPDK6_MASK                       0x00000040
#define _CNPDK_CNPDK6_LENGTH                     0x00000001

#define _CNPDK_CNPDK7_POSITION                   0x00000007
#define _CNPDK_CNPDK7_MASK                       0x00000080
#define _CNPDK_CNPDK7_LENGTH                     0x00000001

#define _CNPDK_CNPDK8_POSITION                   0x00000008
#define _CNPDK_CNPDK8_MASK                       0x00000100
#define _CNPDK_CNPDK8_LENGTH                     0x00000001

#define _CNPDK_CNPDK9_POSITION                   0x00000009
#define _CNPDK_CNPDK9_MASK                       0x00000200
#define _CNPDK_CNPDK9_LENGTH                     0x00000001

#define _CNPDK_CNPDK10_POSITION                  0x0000000A
#define _CNPDK_CNPDK10_MASK                      0x00000400
#define _CNPDK_CNPDK10_LENGTH                    0x00000001

#define _CNPDK_CNPDK11_POSITION                  0x0000000B
#define _CNPDK_CNPDK11_MASK                      0x00000800
#define _CNPDK_CNPDK11_LENGTH                    0x00000001

#define _CNPDK_CNPDK12_POSITION                  0x0000000C
#define _CNPDK_CNPDK12_MASK                      0x00001000
#define _CNPDK_CNPDK12_LENGTH                    0x00000001

#define _CNPDK_CNPDK13_POSITION                  0x0000000D
#define _CNPDK_CNPDK13_MASK                      0x00002000
#define _CNPDK_CNPDK13_LENGTH                    0x00000001

#define _CNPDK_CNPDK14_POSITION                  0x0000000E
#define _CNPDK_CNPDK14_MASK                      0x00004000
#define _CNPDK_CNPDK14_LENGTH                    0x00000001

#define _CNPDK_w_POSITION                        0x00000000
#define _CNPDK_w_MASK                            0xFFFFFFFF
#define _CNPDK_w_LENGTH                          0x00000020

#define _CNCONK_EDGEDETECT_POSITION              0x0000000B
#define _CNCONK_EDGEDETECT_MASK                  0x00000800
#define _CNCONK_EDGEDETECT_LENGTH                0x00000001

#define _CNCONK_SIDL_POSITION                    0x0000000D
#define _CNCONK_SIDL_MASK                        0x00002000
#define _CNCONK_SIDL_LENGTH                      0x00000001

#define _CNCONK_ON_POSITION                      0x0000000F
#define _CNCONK_ON_MASK                          0x00008000
#define _CNCONK_ON_LENGTH                        0x00000001

#define _CNCONK_w_POSITION                       0x00000000
#define _CNCONK_w_MASK                           0xFFFFFFFF
#define _CNCONK_w_LENGTH                         0x00000020

#define _CNENK_CNIEK0_POSITION                   0x00000000
#define _CNENK_CNIEK0_MASK                       0x00000001
#define _CNENK_CNIEK0_LENGTH                     0x00000001

#define _CNENK_CNIEK1_POSITION                   0x00000001
#define _CNENK_CNIEK1_MASK                       0x00000002
#define _CNENK_CNIEK1_LENGTH                     0x00000001

#define _CNENK_CNIEK2_POSITION                   0x00000002
#define _CNENK_CNIEK2_MASK                       0x00000004
#define _CNENK_CNIEK2_LENGTH                     0x00000001

#define _CNENK_CNIEK3_POSITION                   0x00000003
#define _CNENK_CNIEK3_MASK                       0x00000008
#define _CNENK_CNIEK3_LENGTH                     0x00000001

#define _CNENK_CNIEK4_POSITION                   0x00000004
#define _CNENK_CNIEK4_MASK                       0x00000010
#define _CNENK_CNIEK4_LENGTH                     0x00000001

#define _CNENK_CNIEK5_POSITION                   0x00000005
#define _CNENK_CNIEK5_MASK                       0x00000020
#define _CNENK_CNIEK5_LENGTH                     0x00000001

#define _CNENK_CNIEK6_POSITION                   0x00000006
#define _CNENK_CNIEK6_MASK                       0x00000040
#define _CNENK_CNIEK6_LENGTH                     0x00000001

#define _CNENK_CNIEK7_POSITION                   0x00000007
#define _CNENK_CNIEK7_MASK                       0x00000080
#define _CNENK_CNIEK7_LENGTH                     0x00000001

#define _CNENK_CNIEK8_POSITION                   0x00000008
#define _CNENK_CNIEK8_MASK                       0x00000100
#define _CNENK_CNIEK8_LENGTH                     0x00000001

#define _CNENK_CNIEK9_POSITION                   0x00000009
#define _CNENK_CNIEK9_MASK                       0x00000200
#define _CNENK_CNIEK9_LENGTH                     0x00000001

#define _CNENK_CNIEK10_POSITION                  0x0000000A
#define _CNENK_CNIEK10_MASK                      0x00000400
#define _CNENK_CNIEK10_LENGTH                    0x00000001

#define _CNENK_CNIEK11_POSITION                  0x0000000B
#define _CNENK_CNIEK11_MASK                      0x00000800
#define _CNENK_CNIEK11_LENGTH                    0x00000001

#define _CNENK_CNIEK12_POSITION                  0x0000000C
#define _CNENK_CNIEK12_MASK                      0x00001000
#define _CNENK_CNIEK12_LENGTH                    0x00000001

#define _CNENK_CNIEK13_POSITION                  0x0000000D
#define _CNENK_CNIEK13_MASK                      0x00002000
#define _CNENK_CNIEK13_LENGTH                    0x00000001

