Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _ADCTRG1_TRGSRC3_POSITION                0x00000018
#define _ADCTRG1_TRGSRC3_MASK                    0x1F000000
#define _ADCTRG1_TRGSRC3_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC4_POSITION                0x00000000
#define _ADCTRG2_TRGSRC4_MASK                    0x0000001F
#define _ADCTRG2_TRGSRC4_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC5_POSITION                0x00000008
#define _ADCTRG2_TRGSRC5_MASK                    0x00001F00
#define _ADCTRG2_TRGSRC5_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC6_POSITION                0x00000010
#define _ADCTRG2_TRGSRC6_MASK                    0x001F0000
#define _ADCTRG2_TRGSRC6_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC7_POSITION                0x00000018
#define _ADCTRG2_TRGSRC7_MASK                    0x1F000000
#define _ADCTRG2_TRGSRC7_LENGTH                  0x00000005

#define _ADCCMPCON1_IELOLO_POSITION              0x00000000
#define _ADCCMPCON1_IELOLO_MASK                  0x00000001
#define _ADCCMPCON1_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON1_IELOHI_POSITION              0x00000001
#define _ADCCMPCON1_IELOHI_MASK                  0x00000002
#define _ADCCMPCON1_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON1_IEHILO_POSITION              0x00000002
#define _ADCCMPCON1_IEHILO_MASK                  0x00000004
#define _ADCCMPCON1_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON1_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON1_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON1_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON1_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON1_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON1_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON1_DCMPED_POSITION              0x00000005
#define _ADCCMPCON1_DCMPED_MASK                  0x00000020
#define _ADCCMPCON1_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON1_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON1_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON1_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON1_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON1_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON1_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON1_AINID_POSITION               0x00000008
#define _ADCCMPCON1_AINID_MASK                   0x00003F00
#define _ADCCMPCON1_AINID_LENGTH                 0x00000006

#define _ADCCMPCON1_CVDDATA_POSITION             0x00000010
#define _ADCCMPCON1_CVDDATA_MASK                 0xFFFF0000
#define _ADCCMPCON1_CVDDATA_LENGTH               0x00000010

#define _ADCCMPCON2_IELOLO_POSITION              0x00000000
#define _ADCCMPCON2_IELOLO_MASK                  0x00000001
#define _ADCCMPCON2_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON2_IELOHI_POSITION              0x00000001
#define _ADCCMPCON2_IELOHI_MASK                  0x00000002
#define _ADCCMPCON2_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON2_IEHILO_POSITION              0x00000002
#define _ADCCMPCON2_IEHILO_MASK                  0x00000004
#define _ADCCMPCON2_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON2_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON2_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON2_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON2_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON2_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON2_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON2_DCMPED_POSITION              0x00000005
#define _ADCCMPCON2_DCMPED_MASK                  0x00000020
#define _ADCCMPCON2_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON2_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON2_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON2_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON2_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON2_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON2_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON2_AINID_POSITION               0x00000008
#define _ADCCMPCON2_AINID_MASK                   0x00001F00
#define _ADCCMPCON2_AINID_LENGTH                 0x00000005

#define _ADCFSTAT_ADCID_POSITION                 0x00000000
#define _ADCFSTAT_ADCID_MASK                     0x00000007
#define _ADCFSTAT_ADCID_LENGTH                   0x00000003

#define _ADCFSTAT_FSIGN_POSITION                 0x00000007
#define _ADCFSTAT_FSIGN_MASK                     0x00000080
#define _ADCFSTAT_FSIGN_LENGTH                   0x00000001

#define _ADCFSTAT_FCNT_POSITION                  0x00000008
#define _ADCFSTAT_FCNT_MASK                      0x0000FF00
#define _ADCFSTAT_FCNT_LENGTH                    0x00000008

#define _ADCFSTAT_FWROVERR_POSITION              0x00000015
#define _ADCFSTAT_FWROVERR_MASK                  0x00200000
#define _ADCFSTAT_FWROVERR_LENGTH                0x00000001

#define _ADCFSTAT_FRDY_POSITION                  0x00000016
#define _ADCFSTAT_FRDY_MASK                      0x00400000
#define _ADCFSTAT_FRDY_LENGTH                    0x00000001

#define _ADCFSTAT_FIEN_POSITION                  0x00000017
#define _ADCFSTAT_FIEN_MASK                      0x00800000
#define _ADCFSTAT_FIEN_LENGTH                    0x00000001

#define _ADCFSTAT_ADC0EN_POSITION                0x00000018
#define _ADCFSTAT_ADC0EN_MASK                    0x01000000
#define _ADCFSTAT_ADC0EN_LENGTH                  0x00000001

#define _ADCFSTAT_FEN_POSITION                   0x0000001F
#define _ADCFSTAT_FEN_MASK                       0x80000000
#define _ADCFSTAT_FEN_LENGTH                     0x00000001

#define _ADCFIFO_DATA_POSITION                   0x00000000
#define _ADCFIFO_DATA_MASK                       0xFFFFFFFF
#define _ADCFIFO_DATA_LENGTH                     0x00000020

#define _ADCBASE_ADCBASE_POSITION                0x00000000
#define _ADCBASE_ADCBASE_MASK                    0x0000FFFF
#define _ADCBASE_ADCBASE_LENGTH                  0x00000010

#define _ADCDMAST_RAF0_POSITION                  0x00000000
#define _ADCDMAST_RAF0_MASK                      0x00000001
#define _ADCDMAST_RAF0_LENGTH                    0x00000001

