Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _ADCDMAST_RAF0IEN_POSITION               0x00000008
#define _ADCDMAST_RAF0IEN_MASK                   0x00000100
#define _ADCDMAST_RAF0IEN_LENGTH                 0x00000001

#define _ADCDMAST_DMACNTEN_POSITION              0x0000000F
#define _ADCDMAST_DMACNTEN_MASK                  0x00008000
#define _ADCDMAST_DMACNTEN_LENGTH                0x00000001

#define _ADCDMAST_RBF0_POSITION                  0x00000010
#define _ADCDMAST_RBF0_MASK                      0x00010000
#define _ADCDMAST_RBF0_LENGTH                    0x00000001

#define _ADCDMAST_WROVRERR_POSITION              0x00000017
#define _ADCDMAST_WROVRERR_MASK                  0x00800000
#define _ADCDMAST_WROVRERR_LENGTH                0x00000001

#define _ADCDMAST_RBF0IEN_POSITION               0x00000018
#define _ADCDMAST_RBF0IEN_MASK                   0x01000000
#define _ADCDMAST_RBF0IEN_LENGTH                 0x00000001

#define _ADCDMAST_DMAEN_POSITION                 0x0000001F
#define _ADCDMAST_DMAEN_MASK                     0x80000000
#define _ADCDMAST_DMAEN_LENGTH                   0x00000001

#define _ADCCNTB_ADCCNTB_POSITION                0x00000000
#define _ADCCNTB_ADCCNTB_MASK                    0xFFFFFFFF
#define _ADCCNTB_ADCCNTB_LENGTH                  0x00000020

#define _ADCDMAB_ADDMAB_POSITION                 0x00000000
#define _ADCDMAB_ADDMAB_MASK                     0xFFFFFFFF
#define _ADCDMAB_ADDMAB_LENGTH                   0x00000020

#define _ADCTRGSNS_LVL0_POSITION                 0x00000000
#define _ADCTRGSNS_LVL0_MASK                     0x00000001
#define _ADCTRGSNS_LVL0_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL1_POSITION                 0x00000001
#define _ADCTRGSNS_LVL1_MASK                     0x00000002
#define _ADCTRGSNS_LVL1_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL2_POSITION                 0x00000002
#define _ADCTRGSNS_LVL2_MASK                     0x00000004
#define _ADCTRGSNS_LVL2_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL3_POSITION                 0x00000003
#define _ADCTRGSNS_LVL3_MASK                     0x00000008
#define _ADCTRGSNS_LVL3_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL4_POSITION                 0x00000004
#define _ADCTRGSNS_LVL4_MASK                     0x00000010
#define _ADCTRGSNS_LVL4_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL5_POSITION                 0x00000005
#define _ADCTRGSNS_LVL5_MASK                     0x00000020
#define _ADCTRGSNS_LVL5_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL6_POSITION                 0x00000006
#define _ADCTRGSNS_LVL6_MASK                     0x00000040
#define _ADCTRGSNS_LVL6_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL7_POSITION                 0x00000007
#define _ADCTRGSNS_LVL7_MASK                     0x00000080
#define _ADCTRGSNS_LVL7_LENGTH                   0x00000001

#define _ADC0TIME_SAMC_POSITION                  0x00000000
#define _ADC0TIME_SAMC_MASK                      0x000003FF
#define _ADC0TIME_SAMC_LENGTH                    0x0000000A

#define _ADC0TIME_ADCDIV_POSITION                0x00000010
#define _ADC0TIME_ADCDIV_MASK                    0x007F0000
#define _ADC0TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC0TIME_BCHEN0_POSITION                0x00000017
#define _ADC0TIME_BCHEN0_MASK                    0x00800000
#define _ADC0TIME_BCHEN0_LENGTH                  0x00000001

#define _ADC0TIME_SELRES_POSITION                0x00000018
#define _ADC0TIME_SELRES_MASK                    0x03000000
#define _ADC0TIME_SELRES_LENGTH                  0x00000002

#define _ADCANCON_ANEN0_POSITION                 0x00000000
#define _ADCANCON_ANEN0_MASK                     0x00000001
#define _ADCANCON_ANEN0_LENGTH                   0x00000001

#define _ADCANCON_ANEN7_POSITION                 0x00000007
#define _ADCANCON_ANEN7_MASK                     0x00000080
#define _ADCANCON_ANEN7_LENGTH                   0x00000001

#define _ADCANCON_WKRDY0_POSITION                0x00000008
#define _ADCANCON_WKRDY0_MASK                    0x00000100
#define _ADCANCON_WKRDY0_LENGTH                  0x00000001

#define _ADCANCON_WKRDY7_POSITION                0x0000000F
#define _ADCANCON_WKRDY7_MASK                    0x00008000
#define _ADCANCON_WKRDY7_LENGTH                  0x00000001

#define _ADCANCON_WKIEN0_POSITION                0x00000010
#define _ADCANCON_WKIEN0_MASK                    0x00010000
#define _ADCANCON_WKIEN0_LENGTH                  0x00000001

#define _ADCANCON_WKIEN7_POSITION                0x00000017
#define _ADCANCON_WKIEN7_MASK                    0x00800000
#define _ADCANCON_WKIEN7_LENGTH                  0x00000001

#define _ADCANCON_WKUPCLKCNT_POSITION            0x00000018
#define _ADCANCON_WKUPCLKCNT_MASK                0x0F000000
#define _ADCANCON_WKUPCLKCNT_LENGTH              0x00000004

#define _ADC0CFG_ADCCFG_POSITION                 0x00000000
#define _ADC0CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC0CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC7CFG_ADCCFG_POSITION                 0x00000000
#define _ADC7CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC7CFG_ADCCFG_LENGTH                   0x00000020

#define _ADCSYSCFG0_AN0_POSITION                 0x00000000
#define _ADCSYSCFG0_AN0_MASK                     0x00000001
#define _ADCSYSCFG0_AN0_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN1_POSITION                 0x00000001
#define _ADCSYSCFG0_AN1_MASK                     0x00000002
#define _ADCSYSCFG0_AN1_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN2_POSITION                 0x00000002
#define _ADCSYSCFG0_AN2_MASK                     0x00000004
#define _ADCSYSCFG0_AN2_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN3_POSITION                 0x00000003
#define _ADCSYSCFG0_AN3_MASK                     0x00000008
#define _ADCSYSCFG0_AN3_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN4_POSITION                 0x00000004
#define _ADCSYSCFG0_AN4_MASK                     0x00000010
#define _ADCSYSCFG0_AN4_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN5_POSITION                 0x00000005
#define _ADCSYSCFG0_AN5_MASK                     0x00000020
#define _ADCSYSCFG0_AN5_LENGTH                   0x00000001

#define _ADCSYSCFG0_AN6_POSITION                 0x00000006
#define _ADCSYSCFG0_AN6_MASK                     0x00000040
#define _ADCSYSCFG0_AN6_LENGTH                   0x00000001

