Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _C1FIFOINT15_RXOVFLIF_POSITION           0x00000003
#define _C1FIFOINT15_RXOVFLIF_MASK               0x00000008
#define _C1FIFOINT15_RXOVFLIF_LENGTH             0x00000001

#define _C1FIFOINT15_TXEMPTYIF_POSITION          0x00000008
#define _C1FIFOINT15_TXEMPTYIF_MASK              0x00000100
#define _C1FIFOINT15_TXEMPTYIF_LENGTH            0x00000001

#define _C1FIFOINT15_TXHALFIF_POSITION           0x00000009
#define _C1FIFOINT15_TXHALFIF_MASK               0x00000200
#define _C1FIFOINT15_TXHALFIF_LENGTH             0x00000001

#define _C1FIFOINT15_TXNFULLIF_POSITION          0x0000000A
#define _C1FIFOINT15_TXNFULLIF_MASK              0x00000400
#define _C1FIFOINT15_TXNFULLIF_LENGTH            0x00000001

#define _C1FIFOINT15_RXNEMPTYIE_POSITION         0x00000010
#define _C1FIFOINT15_RXNEMPTYIE_MASK             0x00010000
#define _C1FIFOINT15_RXNEMPTYIE_LENGTH           0x00000001

#define _C1FIFOINT15_RXHALFIE_POSITION           0x00000011
#define _C1FIFOINT15_RXHALFIE_MASK               0x00020000
#define _C1FIFOINT15_RXHALFIE_LENGTH             0x00000001

#define _C1FIFOINT15_RXFULLIE_POSITION           0x00000012
#define _C1FIFOINT15_RXFULLIE_MASK               0x00040000
#define _C1FIFOINT15_RXFULLIE_LENGTH             0x00000001

#define _C1FIFOINT15_RXOVFLIE_POSITION           0x00000013
#define _C1FIFOINT15_RXOVFLIE_MASK               0x00080000
#define _C1FIFOINT15_RXOVFLIE_LENGTH             0x00000001

#define _C1FIFOINT15_TXEMPTYIE_POSITION          0x00000018
#define _C1FIFOINT15_TXEMPTYIE_MASK              0x01000000
#define _C1FIFOINT15_TXEMPTYIE_LENGTH            0x00000001

#define _C1FIFOINT15_TXHALFIE_POSITION           0x00000019
#define _C1FIFOINT15_TXHALFIE_MASK               0x02000000
#define _C1FIFOINT15_TXHALFIE_LENGTH             0x00000001

#define _C1FIFOINT15_TXNFULLIE_POSITION          0x0000001A
#define _C1FIFOINT15_TXNFULLIE_MASK              0x04000000
#define _C1FIFOINT15_TXNFULLIE_LENGTH            0x00000001

#define _C1FIFOINT15_w_POSITION                  0x00000000
#define _C1FIFOINT15_w_MASK                      0xFFFFFFFF
#define _C1FIFOINT15_w_LENGTH                    0x00000020

#define _C1FIFOCI15_CFIFOCI_POSITION             0x00000000
#define _C1FIFOCI15_CFIFOCI_MASK                 0x0000001F
#define _C1FIFOCI15_CFIFOCI_LENGTH               0x00000005

#define _C1FIFOCI15_w_POSITION                   0x00000000
#define _C1FIFOCI15_w_MASK                       0xFFFFFFFF
#define _C1FIFOCI15_w_LENGTH                     0x00000020

#define _CFD2CON_DNCNT_POSITION                  0x00000000
#define _CFD2CON_DNCNT_MASK                      0x0000001F
#define _CFD2CON_DNCNT_LENGTH                    0x00000005

#define _CFD2CON_ISOCRCEN_POSITION               0x00000005
#define _CFD2CON_ISOCRCEN_MASK                   0x00000020
#define _CFD2CON_ISOCRCEN_LENGTH                 0x00000001

#define _CFD2CON_PXEDIS_POSITION                 0x00000006
#define _CFD2CON_PXEDIS_MASK                     0x00000040
#define _CFD2CON_PXEDIS_LENGTH                   0x00000001

#define _CFD2CON_CLKSEL0_POSITION                0x00000007
#define _CFD2CON_CLKSEL0_MASK                    0x00000080
#define _CFD2CON_CLKSEL0_LENGTH                  0x00000001

#define _CFD2CON_WAKFIL_POSITION                 0x00000008
#define _CFD2CON_WAKFIL_MASK                     0x00000100
#define _CFD2CON_WAKFIL_LENGTH                   0x00000001

#define _CFD2CON_WFT_POSITION                    0x00000009
#define _CFD2CON_WFT_MASK                        0x00000600
#define _CFD2CON_WFT_LENGTH                      0x00000002

#define _CFD2CON_CANBUSY_POSITION                0x0000000B
#define _CFD2CON_CANBUSY_MASK                    0x00000800
#define _CFD2CON_CANBUSY_LENGTH                  0x00000001

#define _CFD2CON_BRSDIS_POSITION                 0x0000000C
#define _CFD2CON_BRSDIS_MASK                     0x00001000
#define _CFD2CON_BRSDIS_LENGTH                   0x00000001

#define _CFD2CON_SIDL_POSITION                   0x0000000D
#define _CFD2CON_SIDL_MASK                       0x00002000
#define _CFD2CON_SIDL_LENGTH                     0x00000001

#define _CFD2CON_ON_POSITION                     0x0000000F
#define _CFD2CON_ON_MASK                         0x00008000
#define _CFD2CON_ON_LENGTH                       0x00000001

#define _CFD2CON_RTXAT_POSITION                  0x00000010
#define _CFD2CON_RTXAT_MASK                      0x00010000
#define _CFD2CON_RTXAT_LENGTH                    0x00000001

#define _CFD2CON_ESIGM_POSITION                  0x00000011
#define _CFD2CON_ESIGM_MASK                      0x00020000
#define _CFD2CON_ESIGM_LENGTH                    0x00000001

#define _CFD2CON_SERR2LOM_POSITION               0x00000012
#define _CFD2CON_SERR2LOM_MASK                   0x00040000
#define _CFD2CON_SERR2LOM_LENGTH                 0x00000001

#define _CFD2CON_STEF_POSITION                   0x00000013
#define _CFD2CON_STEF_MASK                       0x00080000
#define _CFD2CON_STEF_LENGTH                     0x00000001

#define _CFD2CON_TXQEN_POSITION                  0x00000014
#define _CFD2CON_TXQEN_MASK                      0x00100000
#define _CFD2CON_TXQEN_LENGTH                    0x00000001

#define _CFD2CON_OPMOD_POSITION                  0x00000015
#define _CFD2CON_OPMOD_MASK                      0x00E00000
#define _CFD2CON_OPMOD_LENGTH                    0x00000003

#define _CFD2CON_REQOP_POSITION                  0x00000018
#define _CFD2CON_REQOP_MASK                      0x07000000
#define _CFD2CON_REQOP_LENGTH                    0x00000003

#define _CFD2CON_ABAT_POSITION                   0x0000001B
#define _CFD2CON_ABAT_MASK                       0x08000000
#define _CFD2CON_ABAT_LENGTH                     0x00000001

#define _CFD2CON_TXBWS_POSITION                  0x0000001C
#define _CFD2CON_TXBWS_MASK                      0xF0000000
#define _CFD2CON_TXBWS_LENGTH                    0x00000004

#define _CFD2CON_w_POSITION                      0x00000000
#define _CFD2CON_w_MASK                          0xFFFFFFFF
#define _CFD2CON_w_LENGTH                        0x00000020

#define _CFD2NBTCFG_SJW_POSITION                 0x00000000
#define _CFD2NBTCFG_SJW_MASK                     0x0000007F
#define _CFD2NBTCFG_SJW_LENGTH                   0x00000007

#define _CFD2NBTCFG_TSEG2_POSITION               0x00000008
#define _CFD2NBTCFG_TSEG2_MASK                   0x00007F00
#define _CFD2NBTCFG_TSEG2_LENGTH                 0x00000007

#define _CFD2NBTCFG_TSEG1_POSITION               0x00000010
#define _CFD2NBTCFG_TSEG1_MASK                   0x00FF0000
#define _CFD2NBTCFG_TSEG1_LENGTH                 0x00000008

#define _CFD2NBTCFG_BRP_POSITION                 0x00000018
#define _CFD2NBTCFG_BRP_MASK                     0xFF000000
#define _CFD2NBTCFG_BRP_LENGTH                   0x00000008

#define _CFD2DBTCFG_SJW_POSITION                 0x00000000
#define _CFD2DBTCFG_SJW_MASK                     0x0000000F
#define _CFD2DBTCFG_SJW_LENGTH                   0x00000004

#define _CFD2DBTCFG_TSEG2_POSITION               0x00000008
#define _CFD2DBTCFG_TSEG2_MASK                   0x00000F00
#define _CFD2DBTCFG_TSEG2_LENGTH                 0x00000004

#define _CFD2DBTCFG_TSEG1_POSITION               0x00000010
#define _CFD2DBTCFG_TSEG1_MASK                   0x001F0000
#define _CFD2DBTCFG_TSEG1_LENGTH                 0x00000005

#define _CFD2DBTCFG_BRP_POSITION                 0x00000018
#define _CFD2DBTCFG_BRP_MASK                     0xFF000000
#define _CFD2DBTCFG_BRP_LENGTH                   0x00000008

#define _CFD2TDC_TDCV_POSITION                   0x00000000
#define _CFD2TDC_TDCV_MASK                       0x0000003F
#define _CFD2TDC_TDCV_LENGTH                     0x00000006

#define _CFD2TDC_TDCO_POSITION                   0x00000008
#define _CFD2TDC_TDCO_MASK                       0x00007F00
#define _CFD2TDC_TDCO_LENGTH                     0x00000007

#define _CFD2TDC_TDCMOD_POSITION                 0x00000010
#define _CFD2TDC_TDCMOD_MASK                     0x00030000
#define _CFD2TDC_TDCMOD_LENGTH                   0x00000002

#define _CFD2TDC_SID11EN_POSITION                0x00000018
#define _CFD2TDC_SID11EN_MASK                    0x01000000
#define _CFD2TDC_SID11EN_LENGTH                  0x00000001

#define _CFD2TDC_EDGFLTEN_POSITION               0x00000019
#define _CFD2TDC_EDGFLTEN_MASK                   0x02000000
#define _CFD2TDC_EDGFLTEN_LENGTH                 0x00000001

