Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _CFD2FLTOBJ14_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ14_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ14_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ14_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ14_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ14_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ14_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ14_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ14_EXIDE_LENGTH               0x00000001

#define _CFD2MASK14_MSID_POSITION                0x00000000
#define _CFD2MASK14_MSID_MASK                    0x000007FF
#define _CFD2MASK14_MSID_LENGTH                  0x0000000B

#define _CFD2MASK14_MEID_POSITION                0x0000000B
#define _CFD2MASK14_MEID_MASK                    0x1FFFF800
#define _CFD2MASK14_MEID_LENGTH                  0x00000012

#define _CFD2MASK14_MSID11_POSITION              0x0000001D
#define _CFD2MASK14_MSID11_MASK                  0x20000000
#define _CFD2MASK14_MSID11_LENGTH                0x00000001

#define _CFD2MASK14_MIDE_POSITION                0x0000001E
#define _CFD2MASK14_MIDE_MASK                    0x40000000
#define _CFD2MASK14_MIDE_LENGTH                  0x00000001

#define _CFD2FLTOBJ15_SID_POSITION               0x00000000
#define _CFD2FLTOBJ15_SID_MASK                   0x000007FF
#define _CFD2FLTOBJ15_SID_LENGTH                 0x0000000B

#define _CFD2FLTOBJ15_EID_POSITION               0x0000000B
#define _CFD2FLTOBJ15_EID_MASK                   0x1FFFF800
#define _CFD2FLTOBJ15_EID_LENGTH                 0x00000012

#define _CFD2FLTOBJ15_SID11_POSITION             0x0000001D
#define _CFD2FLTOBJ15_SID11_MASK                 0x20000000
#define _CFD2FLTOBJ15_SID11_LENGTH               0x00000001

#define _CFD2FLTOBJ15_EXIDE_POSITION             0x0000001E
#define _CFD2FLTOBJ15_EXIDE_MASK                 0x40000000
#define _CFD2FLTOBJ15_EXIDE_LENGTH               0x00000001

#define _CFD2MASK15_MSID_POSITION                0x00000000
#define _CFD2MASK15_MSID_MASK                    0x000007FF
#define _CFD2MASK15_MSID_LENGTH                  0x0000000B

#define _CFD2MASK15_MEID_POSITION                0x0000000B
#define _CFD2MASK15_MEID_MASK                    0x1FFFF800
#define _CFD2MASK15_MEID_LENGTH                  0x00000012

#define _CFD2MASK15_MSID11_POSITION              0x0000001D
#define _CFD2MASK15_MSID11_MASK                  0x20000000
#define _CFD2MASK15_MSID11_LENGTH                0x00000001

#define _CFD2MASK15_MIDE_POSITION                0x0000001E
#define _CFD2MASK15_MIDE_MASK                    0x40000000
#define _CFD2MASK15_MIDE_LENGTH                  0x00000001

#define _CVDCON_TRIGGER_POSITION                 0x00000000
#define _CVDCON_TRIGGER_MASK                     0x0000000F
#define _CVDCON_TRIGGER_LENGTH                   0x00000004

#define _CVDCON_CLKSEL_POSITION                  0x00000004
#define _CVDCON_CLKSEL_MASK                      0x00000030
#define _CVDCON_CLKSEL_LENGTH                    0x00000002

#define _CVDCON_FIFOTH_POSITION                  0x00000008
#define _CVDCON_FIFOTH_MASK                      0x0003FF00
#define _CVDCON_FIFOTH_LENGTH                    0x0000000A

#define _CVDCON_FIFOIEN_POSITION                 0x00000012
#define _CVDCON_FIFOIEN_MASK                     0x00040000
#define _CVDCON_FIFOIEN_LENGTH                   0x00000001

#define _CVDCON_CVDIEN_POSITION                  0x00000013
#define _CVDCON_CVDIEN_MASK                      0x00080000
#define _CVDCON_CVDIEN_LENGTH                    0x00000001

#define _CVDCON_THSTR_POSITION                   0x00000017
#define _CVDCON_THSTR_MASK                       0x00800000
#define _CVDCON_THSTR_LENGTH                     0x00000001

#define _CVDCON_SWTRIG_POSITION                  0x00000018
#define _CVDCON_SWTRIG_MASK                      0x01000000
#define _CVDCON_SWTRIG_LENGTH                    0x00000001

#define _CVDCON_ABORT_POSITION                   0x00000019
#define _CVDCON_ABORT_MASK                       0x02000000
#define _CVDCON_ABORT_LENGTH                     0x00000001

#define _CVDCON_SDHOLD_POSITION                  0x0000001B
#define _CVDCON_SDHOLD_MASK                      0x08000000
#define _CVDCON_SDHOLD_LENGTH                    0x00000001

#define _CVDCON_ORDER_POSITION                   0x0000001C
#define _CVDCON_ORDER_MASK                       0x10000000
#define _CVDCON_ORDER_LENGTH                     0x00000001

#define _CVDCON_SIDL_POSITION                    0x0000001D
#define _CVDCON_SIDL_MASK                        0x20000000
#define _CVDCON_SIDL_LENGTH                      0x00000001

#define _CVDCON_FRZ_POSITION                     0x0000001E
#define _CVDCON_FRZ_MASK                         0x40000000
#define _CVDCON_FRZ_LENGTH                       0x00000001

#define _CVDCON_ON_POSITION                      0x0000001F
#define _CVDCON_ON_MASK                          0x80000000
#define _CVDCON_ON_LENGTH                        0x00000001

#define _CVDADC_SELRES_POSITION                  0x00000000
#define _CVDADC_SELRES_MASK                      0x00000003
#define _CVDADC_SELRES_LENGTH                    0x00000002

#define _CVDADC_DIFFPEN_POSITION                 0x00000002
#define _CVDADC_DIFFPEN_MASK                     0x00000004
#define _CVDADC_DIFFPEN_LENGTH                   0x00000001

#define _CVDADC_DIGEN7_POSITION                  0x00000003
#define _CVDADC_DIGEN7_MASK                      0x00000008
#define _CVDADC_DIGEN7_LENGTH                    0x00000001

#define _CVDSTAT_SD1BUSY_POSITION                0x00000000
#define _CVDSTAT_SD1BUSY_MASK                    0x00000001
#define _CVDSTAT_SD1BUSY_LENGTH                  0x00000001

#define _CVDSTAT_SD1DONE_POSITION                0x00000001
#define _CVDSTAT_SD1DONE_MASK                    0x00000002
#define _CVDSTAT_SD1DONE_LENGTH                  0x00000001

#define _CVDSTAT_SD1INT_POSITION                 0x00000002
#define _CVDSTAT_SD1INT_MASK                     0x00000004
#define _CVDSTAT_SD1INT_LENGTH                   0x00000001

#define _CVDSTAT_SD2BUSY_POSITION                0x00000004
#define _CVDSTAT_SD2BUSY_MASK                    0x00000010
#define _CVDSTAT_SD2BUSY_LENGTH                  0x00000001

#define _CVDSTAT_SD2DONE_POSITION                0x00000005
#define _CVDSTAT_SD2DONE_MASK                    0x00000020
#define _CVDSTAT_SD2DONE_LENGTH                  0x00000001

#define _CVDSTAT_SD2INT_POSITION                 0x00000006
#define _CVDSTAT_SD2INT_MASK                     0x00000040
#define _CVDSTAT_SD2INT_LENGTH                   0x00000001

#define _CVDSTAT_SD3BUSY_POSITION                0x00000008
#define _CVDSTAT_SD3BUSY_MASK                    0x00000100
#define _CVDSTAT_SD3BUSY_LENGTH                  0x00000001

#define _CVDSTAT_SD3DONE_POSITION                0x00000009
#define _CVDSTAT_SD3DONE_MASK                    0x00000200
#define _CVDSTAT_SD3DONE_LENGTH                  0x00000001

#define _CVDSTAT_SD3INT_POSITION                 0x0000000A
#define _CVDSTAT_SD3INT_MASK                     0x00000400
#define _CVDSTAT_SD3INT_LENGTH                   0x00000001

