Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _CVDSD1C2_SD1RXBEG_POSITION              0x00000000
#define _CVDSD1C2_SD1RXBEG_MASK                  0x0000003F
#define _CVDSD1C2_SD1RXBEG_LENGTH                0x00000006

#define _CVDSD1C2_SD1RXSTRIDE1_POSITION          0x00000006
#define _CVDSD1C2_SD1RXSTRIDE1_MASK              0x000000C0
#define _CVDSD1C2_SD1RXSTRIDE1_LENGTH            0x00000002

#define _CVDSD1C2_SD1RXEND_POSITION              0x00000008
#define _CVDSD1C2_SD1RXEND_MASK                  0x00003F00
#define _CVDSD1C2_SD1RXEND_LENGTH                0x00000006

#define _CVDSD1C2_SD1RXSTRIDE2_POSITION          0x0000000E
#define _CVDSD1C2_SD1RXSTRIDE2_MASK              0x0000C000
#define _CVDSD1C2_SD1RXSTRIDE2_LENGTH            0x00000002

#define _CVDSD1C2_SD1TXBEG_POSITION              0x00000010
#define _CVDSD1C2_SD1TXBEG_MASK                  0x003F0000
#define _CVDSD1C2_SD1TXBEG_LENGTH                0x00000006

#define _CVDSD1C2_SD1TXSTRIDE1_POSITION          0x00000016
#define _CVDSD1C2_SD1TXSTRIDE1_MASK              0x00C00000
#define _CVDSD1C2_SD1TXSTRIDE1_LENGTH            0x00000002

#define _CVDSD1C2_SD1TXEND_POSITION              0x00000018
#define _CVDSD1C2_SD1TXEND_MASK                  0x3F000000
#define _CVDSD1C2_SD1TXEND_LENGTH                0x00000006

#define _CVDSD1C2_SD1TXSTRIDE2_POSITION          0x0000001E
#define _CVDSD1C2_SD1TXSTRIDE2_MASK              0xC0000000
#define _CVDSD1C2_SD1TXSTRIDE2_LENGTH            0x00000002

#define _CVDSD1C3_SD1CHGTIME_POSITION            0x00000000
#define _CVDSD1C3_SD1CHGTIME_MASK                0x0000007F
#define _CVDSD1C3_SD1CHGTIME_LENGTH              0x00000007

#define _CVDSD1C3_SD1ACQTIME_POSITION            0x00000008
#define _CVDSD1C3_SD1ACQTIME_MASK                0x00007F00
#define _CVDSD1C3_SD1ACQTIME_LENGTH              0x00000007

#define _CVDSD1C3_CVDCPL_POSITION                0x00000010
#define _CVDSD1C3_CVDCPL_MASK                    0x00070000
#define _CVDSD1C3_CVDCPL_LENGTH                  0x00000003

#define _CVDSD1C3_CVDEN_POSITION                 0x00000013
#define _CVDSD1C3_CVDEN_MASK                     0x00080000
#define _CVDSD1C3_CVDEN_LENGTH                   0x00000001

#define _CVDSD1C3_SD1MUT_POSITION                0x00000018
#define _CVDSD1C3_SD1MUT_MASK                    0x01000000
#define _CVDSD1C3_SD1MUT_LENGTH                  0x00000001

#define _CVDSD1C3_SD1SELF_POSITION               0x00000019
#define _CVDSD1C3_SD1SELF_MASK                   0x02000000
#define _CVDSD1C3_SD1SELF_LENGTH                 0x00000001

#define _CVDSD1C3_SD1IEN_POSITION                0x0000001A
#define _CVDSD1C3_SD1IEN_MASK                    0x04000000
#define _CVDSD1C3_SD1IEN_LENGTH                  0x00000001

#define _CVDSD1C3_SD1BUF_POSITION                0x0000001B
#define _CVDSD1C3_SD1BUF_MASK                    0x08000000
#define _CVDSD1C3_SD1BUF_LENGTH                  0x00000001

#define _CVDSD1C3_SD1EN_POSITION                 0x0000001E
#define _CVDSD1C3_SD1EN_MASK                     0xC0000000
#define _CVDSD1C3_SD1EN_LENGTH                   0x00000002

#define _CVDSD1T2_SD1CONTIME_POSITION            0x00000000
#define _CVDSD1T2_SD1CONTIME_MASK                0x0000007F
#define _CVDSD1T2_SD1CONTIME_LENGTH              0x00000007

#define _CVDSD1T2_SD1POLTIME_POSITION            0x00000008
#define _CVDSD1T2_SD1POLTIME_MASK                0x00007F00
#define _CVDSD1T2_SD1POLTIME_LENGTH              0x00000007

#define _CVDSD1T2_SD1OVRTIME_POSITION            0x00000010
#define _CVDSD1T2_SD1OVRTIME_MASK                0x007F0000
#define _CVDSD1T2_SD1OVRTIME_LENGTH              0x00000007

#define _CVDSD1T2_SD1CHNTIME_POSITION            0x00000018
#define _CVDSD1T2_SD1CHNTIME_MASK                0x7F000000
#define _CVDSD1T2_SD1CHNTIME_LENGTH              0x00000007

#define _CVDSD2C1_SD2OVRSAMP_POSITION            0x00000000
#define _CVDSD2C1_SD2OVRSAMP_MASK                0x000000FF
#define _CVDSD2C1_SD2OVRSAMP_LENGTH              0x00000008

#define _CVDSD2C1_SD2THRESH_POSITION             0x00000008
#define _CVDSD2C1_SD2THRESH_MASK                 0xFFFFFF00
#define _CVDSD2C1_SD2THRESH_LENGTH               0x00000018

#define _CVDSD2C2_SD2RXBEG_POSITION              0x00000000
#define _CVDSD2C2_SD2RXBEG_MASK                  0x0000003F
#define _CVDSD2C2_SD2RXBEG_LENGTH                0x00000006

#define _CVDSD2C2_SD2RXSTRIDE1_POSITION          0x00000006
#define _CVDSD2C2_SD2RXSTRIDE1_MASK              0x000000C0
#define _CVDSD2C2_SD2RXSTRIDE1_LENGTH            0x00000002

#define _CVDSD2C2_SD2RXEND_POSITION              0x00000008
#define _CVDSD2C2_SD2RXEND_MASK                  0x00003F00
#define _CVDSD2C2_SD2RXEND_LENGTH                0x00000006

#define _CVDSD2C2_SD2RXSTRIDE2_POSITION          0x0000000E
#define _CVDSD2C2_SD2RXSTRIDE2_MASK              0x0000C000
#define _CVDSD2C2_SD2RXSTRIDE2_LENGTH            0x00000002

#define _CVDSD2C2_SD2TXBEG_POSITION              0x00000010
#define _CVDSD2C2_SD2TXBEG_MASK                  0x003F0000
#define _CVDSD2C2_SD2TXBEG_LENGTH                0x00000006

#define _CVDSD2C2_SD2TXSTRIDE1_POSITION          0x00000016
#define _CVDSD2C2_SD2TXSTRIDE1_MASK              0x00C00000
#define _CVDSD2C2_SD2TXSTRIDE1_LENGTH            0x00000002

#define _CVDSD2C2_SD2TXEND_POSITION              0x00000018
#define _CVDSD2C2_SD2TXEND_MASK                  0x3F000000
#define _CVDSD2C2_SD2TXEND_LENGTH                0x00000006

#define _CVDSD2C2_SD2TXSTRIDE2_POSITION          0x0000001E
#define _CVDSD2C2_SD2TXSTRIDE2_MASK              0xC0000000
#define _CVDSD2C2_SD2TXSTRIDE2_LENGTH            0x00000002

#define _CVDSD2C3_SD2CHGTIME_POSITION            0x00000000
#define _CVDSD2C3_SD2CHGTIME_MASK                0x0000007F
#define _CVDSD2C3_SD2CHGTIME_LENGTH              0x00000007

#define _CVDSD2C3_SD2ACQTIME_POSITION            0x00000008
#define _CVDSD2C3_SD2ACQTIME_MASK                0x00007F00
#define _CVDSD2C3_SD2ACQTIME_LENGTH              0x00000007

#define _CVDSD2C3_CVDCPL_POSITION                0x00000010
#define _CVDSD2C3_CVDCPL_MASK                    0x00070000
#define _CVDSD2C3_CVDCPL_LENGTH                  0x00000003

#define _CVDSD2C3_CVDEN_POSITION                 0x00000013
#define _CVDSD2C3_CVDEN_MASK                     0x00080000
#define _CVDSD2C3_CVDEN_LENGTH                   0x00000001

#define _CVDSD2C3_SD2MUT_POSITION                0x00000018
#define _CVDSD2C3_SD2MUT_MASK                    0x01000000
#define _CVDSD2C3_SD2MUT_LENGTH                  0x00000001

