Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _CVDSD2C3_SD2SELF_POSITION               0x00000019
#define _CVDSD2C3_SD2SELF_MASK                   0x02000000
#define _CVDSD2C3_SD2SELF_LENGTH                 0x00000001

#define _CVDSD2C3_SD2IEN_POSITION                0x0000001A
#define _CVDSD2C3_SD2IEN_MASK                    0x04000000
#define _CVDSD2C3_SD2IEN_LENGTH                  0x00000001

#define _CVDSD2C3_SD2BUF_POSITION                0x0000001B
#define _CVDSD2C3_SD2BUF_MASK                    0x08000000
#define _CVDSD2C3_SD2BUF_LENGTH                  0x00000001

#define _CVDSD2C3_SD2EN_POSITION                 0x0000001E
#define _CVDSD2C3_SD2EN_MASK                     0xC0000000
#define _CVDSD2C3_SD2EN_LENGTH                   0x00000002

#define _CVDSD2T2_SD2CONTIME_POSITION            0x00000000
#define _CVDSD2T2_SD2CONTIME_MASK                0x0000007F
#define _CVDSD2T2_SD2CONTIME_LENGTH              0x00000007

#define _CVDSD2T2_SD2POLTIME_POSITION            0x00000008
#define _CVDSD2T2_SD2POLTIME_MASK                0x00007F00
#define _CVDSD2T2_SD2POLTIME_LENGTH              0x00000007

#define _CVDSD2T2_SD2OVRTIME_POSITION            0x00000010
#define _CVDSD2T2_SD2OVRTIME_MASK                0x007F0000
#define _CVDSD2T2_SD2OVRTIME_LENGTH              0x00000007

#define _CVDSD2T2_SD2CHNTIME_POSITION            0x00000018
#define _CVDSD2T2_SD2CHNTIME_MASK                0x7F000000
#define _CVDSD2T2_SD2CHNTIME_LENGTH              0x00000007

#define _CVDSD3C1_SD3OVRSAMP_POSITION            0x00000000
#define _CVDSD3C1_SD3OVRSAMP_MASK                0x000000FF
#define _CVDSD3C1_SD3OVRSAMP_LENGTH              0x00000008

#define _CVDSD3C1_SD3THRESH_POSITION             0x00000008
#define _CVDSD3C1_SD3THRESH_MASK                 0xFFFFFF00
#define _CVDSD3C1_SD3THRESH_LENGTH               0x00000018

#define _CVDSD3C2_SD3RXBEG_POSITION              0x00000000
#define _CVDSD3C2_SD3RXBEG_MASK                  0x0000003F
#define _CVDSD3C2_SD3RXBEG_LENGTH                0x00000006

#define _CVDSD3C2_SD3RXSTRIDE1_POSITION          0x00000006
#define _CVDSD3C2_SD3RXSTRIDE1_MASK              0x000000C0
#define _CVDSD3C2_SD3RXSTRIDE1_LENGTH            0x00000002

#define _CVDSD3C2_SD3RXEND_POSITION              0x00000008
#define _CVDSD3C2_SD3RXEND_MASK                  0x00003F00
#define _CVDSD3C2_SD3RXEND_LENGTH                0x00000006

#define _CVDSD3C2_SD3RXSTRIDE2_POSITION          0x0000000E
#define _CVDSD3C2_SD3RXSTRIDE2_MASK              0x0000C000
#define _CVDSD3C2_SD3RXSTRIDE2_LENGTH            0x00000002

#define _CVDSD3C2_SD3TXBEG_POSITION              0x00000010
#define _CVDSD3C2_SD3TXBEG_MASK                  0x003F0000
#define _CVDSD3C2_SD3TXBEG_LENGTH                0x00000006

#define _CVDSD3C2_SD3TXSTRIDE1_POSITION          0x00000016
#define _CVDSD3C2_SD3TXSTRIDE1_MASK              0x00C00000
#define _CVDSD3C2_SD3TXSTRIDE1_LENGTH            0x00000002

#define _CVDSD3C2_SD3TXEND_POSITION              0x00000018
#define _CVDSD3C2_SD3TXEND_MASK                  0x3F000000
#define _CVDSD3C2_SD3TXEND_LENGTH                0x00000006

#define _CVDSD3C2_SD3TXSTRIDE2_POSITION          0x0000001E
#define _CVDSD3C2_SD3TXSTRIDE2_MASK              0xC0000000
#define _CVDSD3C2_SD3TXSTRIDE2_LENGTH            0x00000002

#define _CVDSD3C3_SD3CHGTIME_POSITION            0x00000000
#define _CVDSD3C3_SD3CHGTIME_MASK                0x0000007F
#define _CVDSD3C3_SD3CHGTIME_LENGTH              0x00000007

#define _CVDSD3C3_SD3ACQTIME_POSITION            0x00000008
#define _CVDSD3C3_SD3ACQTIME_MASK                0x00007F00
#define _CVDSD3C3_SD3ACQTIME_LENGTH              0x00000007

#define _CVDSD3C3_CVDCPL_POSITION                0x00000010
#define _CVDSD3C3_CVDCPL_MASK                    0x00070000
#define _CVDSD3C3_CVDCPL_LENGTH                  0x00000003

#define _CVDSD3C3_CVDEN_POSITION                 0x00000013
#define _CVDSD3C3_CVDEN_MASK                     0x00080000
#define _CVDSD3C3_CVDEN_LENGTH                   0x00000001

#define _CVDSD3C3_SD3MUT_POSITION                0x00000018
#define _CVDSD3C3_SD3MUT_MASK                    0x01000000
#define _CVDSD3C3_SD3MUT_LENGTH                  0x00000001

#define _CVDSD3C3_SD3SELF_POSITION               0x00000019
#define _CVDSD3C3_SD3SELF_MASK                   0x02000000
#define _CVDSD3C3_SD3SELF_LENGTH                 0x00000001

#define _CVDSD3C3_SD3IEN_POSITION                0x0000001A
#define _CVDSD3C3_SD3IEN_MASK                    0x04000000
#define _CVDSD3C3_SD3IEN_LENGTH                  0x00000001

#define _CVDSD3C3_SD3BUF_POSITION                0x0000001B
#define _CVDSD3C3_SD3BUF_MASK                    0x08000000
#define _CVDSD3C3_SD3BUF_LENGTH                  0x00000001

#define _CVDSD3C3_SD3EN_POSITION                 0x0000001E
#define _CVDSD3C3_SD3EN_MASK                     0xC0000000
#define _CVDSD3C3_SD3EN_LENGTH                   0x00000002

#define _CVDSD3T2_SD3CONTIME_POSITION            0x00000000
#define _CVDSD3T2_SD3CONTIME_MASK                0x0000007F
#define _CVDSD3T2_SD3CONTIME_LENGTH              0x00000007

#define _CVDSD3T2_SD3POLTIME_POSITION            0x00000008
#define _CVDSD3T2_SD3POLTIME_MASK                0x00007F00
#define _CVDSD3T2_SD3POLTIME_LENGTH              0x00000007

#define _CVDSD3T2_SD3OVRTIME_POSITION            0x00000010
#define _CVDSD3T2_SD3OVRTIME_MASK                0x007F0000
#define _CVDSD3T2_SD3OVRTIME_LENGTH              0x00000007

#define _CVDSD3T2_SD3CHNTIME_POSITION            0x00000018
#define _CVDSD3T2_SD3CHNTIME_MASK                0x7F000000
#define _CVDSD3T2_SD3CHNTIME_LENGTH              0x00000007

#define _I2C2CON_SEN_POSITION                    0x00000000
#define _I2C2CON_SEN_MASK                        0x00000001
#define _I2C2CON_SEN_LENGTH                      0x00000001

#define _I2C2CON_RSEN_POSITION                   0x00000001
#define _I2C2CON_RSEN_MASK                       0x00000002
#define _I2C2CON_RSEN_LENGTH                     0x00000001

#define _I2C2CON_PEN_POSITION                    0x00000002
#define _I2C2CON_PEN_MASK                        0x00000004
#define _I2C2CON_PEN_LENGTH                      0x00000001

