Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _SQI1BDCON_START_POSITION                0x00000002
#define _SQI1BDCON_START_MASK                    0x00000004
#define _SQI1BDCON_START_LENGTH                  0x00000001

#define _SQI1BDCURADD_BDCURRADDR_POSITION        0x00000000
#define _SQI1BDCURADD_BDCURRADDR_MASK            0xFFFFFFFF
#define _SQI1BDCURADD_BDCURRADDR_LENGTH          0x00000020

#define _SQI1BDBASEADD_BDADDR_POSITION           0x00000000
#define _SQI1BDBASEADD_BDADDR_MASK               0xFFFFFFFF
#define _SQI1BDBASEADD_BDADDR_LENGTH             0x00000020

#define _SQI1BDSTAT_BDCON_POSITION               0x00000000
#define _SQI1BDSTAT_BDCON_MASK                   0x0000FFFF
#define _SQI1BDSTAT_BDCON_LENGTH                 0x00000010

#define _SQI1BDSTAT_DMAACTV_POSITION             0x00000010
#define _SQI1BDSTAT_DMAACTV_MASK                 0x00010000
#define _SQI1BDSTAT_DMAACTV_LENGTH               0x00000001

#define _SQI1BDSTAT_DMASTART_POSITION            0x00000011
#define _SQI1BDSTAT_DMASTART_MASK                0x00020000
#define _SQI1BDSTAT_DMASTART_LENGTH              0x00000001

#define _SQI1BDSTAT_BDSTATE_POSITION             0x00000012
#define _SQI1BDSTAT_BDSTATE_MASK                 0x003C0000
#define _SQI1BDSTAT_BDSTATE_LENGTH               0x00000004

#define _SQI1BDPOLLCON_POLLCON_POSITION          0x00000000
#define _SQI1BDPOLLCON_POLLCON_MASK              0x0000FFFF
#define _SQI1BDPOLLCON_POLLCON_LENGTH            0x00000010

#define _SQI1BDTXDSTAT_TXCURBUFLEN_POSITION      0x00000000
#define _SQI1BDTXDSTAT_TXCURBUFLEN_MASK          0x000001FF
#define _SQI1BDTXDSTAT_TXCURBUFLEN_LENGTH        0x00000009

#define _SQI1BDTXDSTAT_TXBUFCNT_POSITION         0x00000010
#define _SQI1BDTXDSTAT_TXBUFCNT_MASK             0x001F0000
#define _SQI1BDTXDSTAT_TXBUFCNT_LENGTH           0x00000005

#define _SQI1BDTXDSTAT_TXSTATE_POSITION          0x00000019
#define _SQI1BDTXDSTAT_TXSTATE_MASK              0x1E000000
#define _SQI1BDTXDSTAT_TXSTATE_LENGTH            0x00000004

#define _SQI1BDRXDSTAT_RXCURBUFLEN_POSITION      0x00000000
#define _SQI1BDRXDSTAT_RXCURBUFLEN_MASK          0x000001FF
#define _SQI1BDRXDSTAT_RXCURBUFLEN_LENGTH        0x00000009

#define _SQI1BDRXDSTAT_RXBUFCNT_POSITION         0x00000010
#define _SQI1BDRXDSTAT_RXBUFCNT_MASK             0x001F0000
#define _SQI1BDRXDSTAT_RXBUFCNT_LENGTH           0x00000005

#define _SQI1BDRXDSTAT_RXSTATE_POSITION          0x00000019
#define _SQI1BDRXDSTAT_RXSTATE_MASK              0x1E000000
#define _SQI1BDRXDSTAT_RXSTATE_LENGTH            0x00000004

#define _SQI1THR_THRES_POSITION                  0x00000000
#define _SQI1THR_THRES_MASK                      0x0000000F
#define _SQI1THR_THRES_LENGTH                    0x00000004

#define _SQI1INTSIGEN_TXEMPTYISE_POSITION        0x00000000
#define _SQI1INTSIGEN_TXEMPTYISE_MASK            0x00000001
#define _SQI1INTSIGEN_TXEMPTYISE_LENGTH          0x00000001

#define _SQI1INTSIGEN_TXFULLISE_POSITION         0x00000001
#define _SQI1INTSIGEN_TXFULLISE_MASK             0x00000002
#define _SQI1INTSIGEN_TXFULLISE_LENGTH           0x00000001

#define _SQI1INTSIGEN_TXTHRISE_POSITION          0x00000002
#define _SQI1INTSIGEN_TXTHRISE_MASK              0x00000004
#define _SQI1INTSIGEN_TXTHRISE_LENGTH            0x00000001

#define _SQI1INTSIGEN_RXEMPTYISE_POSITION        0x00000003
#define _SQI1INTSIGEN_RXEMPTYISE_MASK            0x00000008
#define _SQI1INTSIGEN_RXEMPTYISE_LENGTH          0x00000001

#define _SQI1INTSIGEN_RXFULLISE_POSITION         0x00000004
#define _SQI1INTSIGEN_RXFULLISE_MASK             0x00000010
#define _SQI1INTSIGEN_RXFULLISE_LENGTH           0x00000001

#define _SQI1INTSIGEN_RXTHRISE_POSITION          0x00000005
#define _SQI1INTSIGEN_RXTHRISE_MASK              0x00000020
#define _SQI1INTSIGEN_RXTHRISE_LENGTH            0x00000001

#define _SQI1INTSIGEN_CONFULLISE_POSITION        0x00000006
#define _SQI1INTSIGEN_CONFULLISE_MASK            0x00000040
#define _SQI1INTSIGEN_CONFULLISE_LENGTH          0x00000001

#define _SQI1INTSIGEN_CONEMPTYISE_POSITION       0x00000007
#define _SQI1INTSIGEN_CONEMPTYISE_MASK           0x00000080
#define _SQI1INTSIGEN_CONEMPTYISE_LENGTH         0x00000001

#define _SQI1INTSIGEN_CONTHRISE_POSITION         0x00000008
#define _SQI1INTSIGEN_CONTHRISE_MASK             0x00000100
#define _SQI1INTSIGEN_CONTHRISE_LENGTH           0x00000001

#define _SQI1INTSIGEN_BDDONEISE_POSITION         0x00000009
#define _SQI1INTSIGEN_BDDONEISE_MASK             0x00000200
#define _SQI1INTSIGEN_BDDONEISE_LENGTH           0x00000001

#define _SQI1INTSIGEN_PKTCOMPISE_POSITION        0x0000000A
#define _SQI1INTSIGEN_PKTCOMPISE_MASK            0x00000400
#define _SQI1INTSIGEN_PKTCOMPISE_LENGTH          0x00000001

#define _SQI1INTSIGEN_DMAEISE_POSITION           0x0000000B
#define _SQI1INTSIGEN_DMAEISE_MASK               0x00000800
#define _SQI1INTSIGEN_DMAEISE_LENGTH             0x00000001

#define _SQI1TAPCON_CLKOUTDLY_POSITION           0x00000000
#define _SQI1TAPCON_CLKOUTDLY_MASK               0x0000000F
#define _SQI1TAPCON_CLKOUTDLY_LENGTH             0x00000004

#define _SQI1TAPCON_DATAOUTDLY_POSITION          0x00000004
#define _SQI1TAPCON_DATAOUTDLY_MASK              0x000000F0
#define _SQI1TAPCON_DATAOUTDLY_LENGTH            0x00000004

#define _SQI1TAPCON_SDRCLKINDLY_POSITION         0x00000008
#define _SQI1TAPCON_SDRCLKINDLY_MASK             0x00003F00
#define _SQI1TAPCON_SDRCLKINDLY_LENGTH           0x00000006

#define _SQI1TAPCON_DDRDATINDLY_POSITION         0x00000010
#define _SQI1TAPCON_DDRDATINDLY_MASK             0x000F0000
#define _SQI1TAPCON_DDRDATINDLY_LENGTH           0x00000004

#define _SQI1TAPCON_SDRDATINDLY_POSITION         0x00000014
#define _SQI1TAPCON_SDRDATINDLY_MASK             0x00F00000
#define _SQI1TAPCON_SDRDATINDLY_LENGTH           0x00000004

#define _SQI1TAPCON_DDRCLKINDLY_POSITION         0x00000018
#define _SQI1TAPCON_DDRCLKINDLY_MASK             0x3F000000
#define _SQI1TAPCON_DDRCLKINDLY_LENGTH           0x00000006

#define _SQI1MEMSTAT_STATCMD_POSITION            0x00000000
#define _SQI1MEMSTAT_STATCMD_MASK                0x0000FFFF
#define _SQI1MEMSTAT_STATCMD_LENGTH              0x00000010

#define _SQI1MEMSTAT_STATBYTES_POSITION          0x00000010
#define _SQI1MEMSTAT_STATBYTES_MASK              0x00030000
#define _SQI1MEMSTAT_STATBYTES_LENGTH            0x00000002

#define _SQI1MEMSTAT_STATTYPE_POSITION           0x00000012
#define _SQI1MEMSTAT_STATTYPE_MASK               0x000C0000
#define _SQI1MEMSTAT_STATTYPE_LENGTH             0x00000002

