Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _SQI1MEMSTAT_STATPOS_POSITION            0x00000014
#define _SQI1MEMSTAT_STATPOS_MASK                0x00100000
#define _SQI1MEMSTAT_STATPOS_LENGTH              0x00000001

#define _SQI1XCON3_INIT1CMD1_POSITION            0x00000000
#define _SQI1XCON3_INIT1CMD1_MASK                0x000000FF
#define _SQI1XCON3_INIT1CMD1_LENGTH              0x00000008

#define _SQI1XCON3_INIT1CMD2_POSITION            0x00000008
#define _SQI1XCON3_INIT1CMD2_MASK                0x0000FF00
#define _SQI1XCON3_INIT1CMD2_LENGTH              0x00000008

#define _SQI1XCON3_INIT1CMD3_POSITION            0x00000010
#define _SQI1XCON3_INIT1CMD3_MASK                0x00FF0000
#define _SQI1XCON3_INIT1CMD3_LENGTH              0x00000008

#define _SQI1XCON3_INIT1TYPE_POSITION            0x00000018
#define _SQI1XCON3_INIT1TYPE_MASK                0x03000000
#define _SQI1XCON3_INIT1TYPE_LENGTH              0x00000002

#define _SQI1XCON3_INIT1COUNT_POSITION           0x0000001A
#define _SQI1XCON3_INIT1COUNT_MASK               0x0C000000
#define _SQI1XCON3_INIT1COUNT_LENGTH             0x00000002

#define _SQI1XCON3_INIT1SCHECK_POSITION          0x0000001C
#define _SQI1XCON3_INIT1SCHECK_MASK              0x10000000
#define _SQI1XCON3_INIT1SCHECK_LENGTH            0x00000001

#define _SQI1XCON4_INIT2CMD1_POSITION            0x00000000
#define _SQI1XCON4_INIT2CMD1_MASK                0x000000FF
#define _SQI1XCON4_INIT2CMD1_LENGTH              0x00000008

#define _SQI1XCON4_INIT2CMD2_POSITION            0x00000008
#define _SQI1XCON4_INIT2CMD2_MASK                0x0000FF00
#define _SQI1XCON4_INIT2CMD2_LENGTH              0x00000008

#define _SQI1XCON4_INIT2CMD3_POSITION            0x00000010
#define _SQI1XCON4_INIT2CMD3_MASK                0x00FF0000
#define _SQI1XCON4_INIT2CMD3_LENGTH              0x00000008

#define _SQI1XCON4_INIT2TYPE_POSITION            0x00000018
#define _SQI1XCON4_INIT2TYPE_MASK                0x03000000
#define _SQI1XCON4_INIT2TYPE_LENGTH              0x00000002

#define _SQI1XCON4_INIT2COUNT_POSITION           0x0000001A
#define _SQI1XCON4_INIT2COUNT_MASK               0x0C000000
#define _SQI1XCON4_INIT2COUNT_LENGTH             0x00000002

#define _SQI1XCON4_INIT2SCHECK_POSITION          0x0000001C
#define _SQI1XCON4_INIT2SCHECK_MASK              0x10000000
#define _SQI1XCON4_INIT2SCHECK_LENGTH            0x00000001

#define _CEVER_ID_POSITION                       0x00000000
#define _CEVER_ID_MASK                           0x0000FFFF
#define _CEVER_ID_LENGTH                         0x00000010

#define _CEVER_VERSION_POSITION                  0x00000010
#define _CEVER_VERSION_MASK                      0x00FF0000
#define _CEVER_VERSION_LENGTH                    0x00000008

#define _CEVER_REVISION_POSITION                 0x00000018
#define _CEVER_REVISION_MASK                     0xFF000000
#define _CEVER_REVISION_LENGTH                   0x00000008

#define _CECON_DMAEN_POSITION                    0x00000000
#define _CECON_DMAEN_MASK                        0x00000001
#define _CECON_DMAEN_LENGTH                      0x00000001

#define _CECON_BDPPLEN_POSITION                  0x00000001
#define _CECON_BDPPLEN_MASK                      0x00000002
#define _CECON_BDPPLEN_LENGTH                    0x00000001

#define _CECON_BDPCHST_POSITION                  0x00000002
#define _CECON_BDPCHST_MASK                      0x00000004
#define _CECON_BDPCHST_LENGTH                    0x00000001

#define _CECON_SWAPEN_POSITION                   0x00000005
#define _CECON_SWAPEN_MASK                       0x00000020
#define _CECON_SWAPEN_LENGTH                     0x00000001

#define _CECON_SWRST_POSITION                    0x00000006
#define _CECON_SWRST_MASK                        0x00000040
#define _CECON_SWRST_LENGTH                      0x00000001

#define _CECON_SWAPOEN_POSITION                  0x00000007
#define _CECON_SWAPOEN_MASK                      0x00000080
#define _CECON_SWAPOEN_LENGTH                    0x00000001

#define _CEBDADDR_BDPADDR_POSITION               0x00000000
#define _CEBDADDR_BDPADDR_MASK                   0xFFFFFFFF
#define _CEBDADDR_BDPADDR_LENGTH                 0x00000020

#define _CEBDPADDR_BASEADDR_POSITION             0x00000000
#define _CEBDPADDR_BASEADDR_MASK                 0xFFFFFFFF
#define _CEBDPADDR_BASEADDR_LENGTH               0x00000020

#define _CESTAT_BDCTRL_POSITION                  0x00000000
#define _CESTAT_BDCTRL_MASK                      0x0000FFFF
#define _CESTAT_BDCTRL_LENGTH                    0x00000010

#define _CESTAT_ACTIVE_POSITION                  0x00000010
#define _CESTAT_ACTIVE_MASK                      0x00010000
#define _CESTAT_ACTIVE_LENGTH                    0x00000001

#define _CESTAT_START_POSITION                   0x00000011
#define _CESTAT_START_MASK                       0x00020000
#define _CESTAT_START_LENGTH                     0x00000001

#define _CESTAT_BDSTATE_POSITION                 0x00000012
#define _CESTAT_BDSTATE_MASK                     0x003C0000
#define _CESTAT_BDSTATE_LENGTH                   0x00000004

#define _CESTAT_ERRPHASE_POSITION                0x00000018
#define _CESTAT_ERRPHASE_MASK                    0x03000000
#define _CESTAT_ERRPHASE_LENGTH                  0x00000002

#define _CESTAT_ERROP_POSITION                   0x0000001A
#define _CESTAT_ERROP_MASK                       0x1C000000
#define _CESTAT_ERROP_LENGTH                     0x00000003

#define _CESTAT_ERRMODE_POSITION                 0x0000001D
#define _CESTAT_ERRMODE_MASK                     0xE0000000
#define _CESTAT_ERRMODE_LENGTH                   0x00000003

#define _CEINTSRC_PENDIF_POSITION                0x00000000
#define _CEINTSRC_PENDIF_MASK                    0x00000001
#define _CEINTSRC_PENDIF_LENGTH                  0x00000001

#define _CEINTSRC_CBDIF_POSITION                 0x00000001
#define _CEINTSRC_CBDIF_MASK                     0x00000002
#define _CEINTSRC_CBDIF_LENGTH                   0x00000001

#define _CEINTSRC_PKTIF_POSITION                 0x00000002
#define _CEINTSRC_PKTIF_MASK                     0x00000004
#define _CEINTSRC_PKTIF_LENGTH                   0x00000001

#define _CEINTSRC_AREIF_POSITION                 0x00000003
#define _CEINTSRC_AREIF_MASK                     0x00000008
#define _CEINTSRC_AREIF_LENGTH                   0x00000001

