Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _RNGNUMGEN1_RNG_POSITION                 0x00000000
#define _RNGNUMGEN1_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN1_RNG_LENGTH                   0x00000020

#define _RNGNUMGEN2_RNG_POSITION                 0x00000000
#define _RNGNUMGEN2_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN2_RNG_LENGTH                   0x00000020

#define _RNGSEED1_SEED_POSITION                  0x00000000
#define _RNGSEED1_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED1_SEED_LENGTH                    0x00000020

#define _RNGSEED2_SEED_POSITION                  0x00000000
#define _RNGSEED2_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED2_SEED_LENGTH                    0x00000020

#define _RNGCNT_RCNT_POSITION                    0x00000000
#define _RNGCNT_RCNT_MASK                        0x0000007F
#define _RNGCNT_RCNT_LENGTH                      0x00000007

#define _PKCONFIG_OPPTRA_POSITION                0x00000000
#define _PKCONFIG_OPPTRA_MASK                    0x0000001F
#define _PKCONFIG_OPPTRA_LENGTH                  0x00000005

#define _PKCONFIG_OPPTRB_POSITION                0x00000008
#define _PKCONFIG_OPPTRB_MASK                    0x00001F00
#define _PKCONFIG_OPPTRB_LENGTH                  0x00000005

#define _PKCONFIG_OPPTRC_POSITION                0x00000010
#define _PKCONFIG_OPPTRC_MASK                    0x001F0000
#define _PKCONFIG_OPPTRC_LENGTH                  0x00000005

#define _PKCOMMAND_OPERATION_POSITION            0x00000000
#define _PKCOMMAND_OPERATION_MASK                0x0000007F
#define _PKCOMMAND_OPERATION_LENGTH              0x00000007

#define _PKCOMMAND_FIELD_POSITION                0x00000007
#define _PKCOMMAND_FIELD_MASK                    0x00000080
#define _PKCOMMAND_FIELD_LENGTH                  0x00000001

#define _PKCOMMAND_OPSIZE_POSITION               0x00000008
#define _PKCOMMAND_OPSIZE_MASK                   0x0000FF00
#define _PKCOMMAND_OPSIZE_LENGTH                 0x00000008

#define _PKCOMMAND_SIGNA_POSITION                0x0000001D
#define _PKCOMMAND_SIGNA_MASK                    0x20000000
#define _PKCOMMAND_SIGNA_LENGTH                  0x00000001

#define _PKCOMMAND_SIGNB_POSITION                0x0000001E
#define _PKCOMMAND_SIGNB_MASK                    0x40000000
#define _PKCOMMAND_SIGNB_LENGTH                  0x00000001

#define _PKCOMMAND_CALCR2_POSITION               0x0000001F
#define _PKCOMMAND_CALCR2_MASK                   0x80000000
#define _PKCOMMAND_CALCR2_LENGTH                 0x00000001

#define _PKCONTROL_START_POSITION                0x00000000
#define _PKCONTROL_START_MASK                    0x00000001
#define _PKCONTROL_START_LENGTH                  0x00000001

#define _PKSTATUS_EADDR_POSITION                 0x00000000
#define _PKSTATUS_EADDR_MASK                     0x0000000F
#define _PKSTATUS_EADDR_LENGTH                   0x00000004

#define _PKSTATUS_PXNOC_POSITION                 0x00000004
#define _PKSTATUS_PXNOC_MASK                     0x00000010
#define _PKSTATUS_PXNOC_LENGTH                   0x00000001

#define _PKSTATUS_PXINF_POSITION                 0x00000005
#define _PKSTATUS_PXINF_MASK                     0x00000020
#define _PKSTATUS_PXINF_LENGTH                   0x00000001

#define _PKSTATUS_CPLINVAL_POSITION              0x00000006
#define _PKSTATUS_CPLINVAL_MASK                  0x00000040
#define _PKSTATUS_CPLINVAL_LENGTH                0x00000001

#define _PKSTATUS_PNINVAL_POSITION               0x00000007
#define _PKSTATUS_PNINVAL_MASK                   0x00000080
#define _PKSTATUS_PNINVAL_LENGTH                 0x00000001

#define _PKSTATUS_SIGINVAL_POSITION              0x00000009
#define _PKSTATUS_SIGINVAL_MASK                  0x00000200
#define _PKSTATUS_SIGINVAL_LENGTH                0x00000001

#define _PKSTATUS_PABINVAL_POSITION              0x0000000A
#define _PKSTATUS_PABINVAL_MASK                  0x00000400
#define _PKSTATUS_PABINVAL_LENGTH                0x00000001

#define _PKSTATUS_NONINV_POSITION                0x0000000B
#define _PKSTATUS_NONINV_MASK                    0x00000800
#define _PKSTATUS_NONINV_LENGTH                  0x00000001

#define _PKSTATUS_PRIME_POSITION                 0x0000000C
#define _PKSTATUS_PRIME_MASK                     0x00001000
#define _PKSTATUS_PRIME_LENGTH                   0x00000001

#define _PKSTATUS_BUSY_POSITION                  0x00000010
#define _PKSTATUS_BUSY_MASK                      0x00010000
#define _PKSTATUS_BUSY_LENGTH                    0x00000001

#define _PKVERSION_SWVER_POSITION                0x00000000
#define _PKVERSION_SWVER_MASK                    0x000000FF
#define _PKVERSION_SWVER_LENGTH                  0x00000008

#define _PKVERSION_HWVER_POSITION                0x00000008
#define _PKVERSION_HWVER_MASK                    0x0000FF00
#define _PKVERSION_HWVER_LENGTH                  0x00000008

#define _FUSERID_USERID_POSITION                 0x00000000
#define _FUSERID_USERID_MASK                     0x0000FFFF
#define _FUSERID_USERID_LENGTH                   0x00000010

#define _FUSERID_w_POSITION                      0x00000000
#define _FUSERID_w_MASK                          0xFFFFFFFF
#define _FUSERID_w_LENGTH                        0x00000020

#define _DEVCFG4_SOSCCFG_POSITION                0x00000000
#define _DEVCFG4_SOSCCFG_MASK                    0x000000FF
#define _DEVCFG4_SOSCCFG_LENGTH                  0x00000008

#define _DEVCFG4_VBZPBOREN_POSITION              0x00000013
#define _DEVCFG4_VBZPBOREN_MASK                  0x00080000
#define _DEVCFG4_VBZPBOREN_LENGTH                0x00000001

#define _DEVCFG4_DSZPBOREN_POSITION              0x00000014
#define _DEVCFG4_DSZPBOREN_MASK                  0x00100000
#define _DEVCFG4_DSZPBOREN_LENGTH                0x00000001

#define _DEVCFG4_DSWDTPS_POSITION                0x00000015
#define _DEVCFG4_DSWDTPS_MASK                    0x03E00000
#define _DEVCFG4_DSWDTPS_LENGTH                  0x00000005

#define _DEVCFG4_DSWDTOSC_POSITION               0x0000001A
#define _DEVCFG4_DSWDTOSC_MASK                   0x04000000
#define _DEVCFG4_DSWDTOSC_LENGTH                 0x00000001

#define _DEVCFG4_DSWDTEN_POSITION                0x0000001B
#define _DEVCFG4_DSWDTEN_MASK                    0x08000000
#define _DEVCFG4_DSWDTEN_LENGTH                  0x00000001

#define _DEVCFG4_DSEN_POSITION                   0x0000001C
#define _DEVCFG4_DSEN_MASK                       0x10000000
#define _DEVCFG4_DSEN_LENGTH                     0x00000001

#define _DEVCFG4_SOSCEN_POSITION                 0x0000001E
#define _DEVCFG4_SOSCEN_MASK                     0x40000000
#define _DEVCFG4_SOSCEN_LENGTH                   0x00000001

#define _DEVCFG4_w_POSITION                      0x00000000
#define _DEVCFG4_w_MASK                          0xFFFFFFFF
#define _DEVCFG4_w_LENGTH                        0x00000020

#define _DEVCFG2_DMTINTV_POSITION                0x00000003
#define _DEVCFG2_DMTINTV_MASK                    0x00000038
#define _DEVCFG2_DMTINTV_LENGTH                  0x00000003

#define _DEVCFG2_POSCMOD_POSITION                0x00000008
#define _DEVCFG2_POSCMOD_MASK                    0x00000300
#define _DEVCFG2_POSCMOD_LENGTH                  0x00000002

#define _DEVCFG2_WDTRMCS_POSITION                0x0000000A
#define _DEVCFG2_WDTRMCS_MASK                    0x00000C00
#define _DEVCFG2_WDTRMCS_LENGTH                  0x00000002

