Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
#define _DEVCFG2_SOSCSEL_POSITION                0x0000000C
#define _DEVCFG2_SOSCSEL_MASK                    0x00001000
#define _DEVCFG2_SOSCSEL_LENGTH                  0x00000001

#define _DEVCFG2_WAKE2SPD_POSITION               0x0000000D
#define _DEVCFG2_WAKE2SPD_MASK                   0x00002000
#define _DEVCFG2_WAKE2SPD_LENGTH                 0x00000001

#define _DEVCFG2_CKSWEN_POSITION                 0x0000000E
#define _DEVCFG2_CKSWEN_MASK                     0x00004000
#define _DEVCFG2_CKSWEN_LENGTH                   0x00000001

#define _DEVCFG2_FSCMEN_POSITION                 0x0000000F
#define _DEVCFG2_FSCMEN_MASK                     0x00008000
#define _DEVCFG2_FSCMEN_LENGTH                   0x00000001

#define _DEVCFG2_WDTPS_POSITION                  0x00000010
#define _DEVCFG2_WDTPS_MASK                      0x001F0000
#define _DEVCFG2_WDTPS_LENGTH                    0x00000005

#define _DEVCFG2_WDTSPGM_POSITION                0x00000015
#define _DEVCFG2_WDTSPGM_MASK                    0x00200000
#define _DEVCFG2_WDTSPGM_LENGTH                  0x00000001

#define _DEVCFG2_WINDIS_POSITION                 0x00000016
#define _DEVCFG2_WINDIS_MASK                     0x00400000
#define _DEVCFG2_WINDIS_LENGTH                   0x00000001

#define _DEVCFG2_WDTEN_POSITION                  0x00000017
#define _DEVCFG2_WDTEN_MASK                      0x00800000
#define _DEVCFG2_WDTEN_LENGTH                    0x00000001

#define _DEVCFG2_WDTWINSZ_POSITION               0x00000018
#define _DEVCFG2_WDTWINSZ_MASK                   0x03000000
#define _DEVCFG2_WDTWINSZ_LENGTH                 0x00000002

#define _DEVCFG2_DMTCNT_POSITION                 0x0000001A
#define _DEVCFG2_DMTCNT_MASK                     0x7C000000
#define _DEVCFG2_DMTCNT_LENGTH                   0x00000005

#define _DEVCFG2_DMTEN_POSITION                  0x0000001F
#define _DEVCFG2_DMTEN_MASK                      0x80000000
#define _DEVCFG2_DMTEN_LENGTH                    0x00000001

#define _DEVCFG2_w_POSITION                      0x00000000
#define _DEVCFG2_w_MASK                          0xFFFFFFFF
#define _DEVCFG2_w_LENGTH                        0x00000020

#define _DEVCFG1_DEBUG_POSITION                  0x00000000
#define _DEVCFG1_DEBUG_MASK                      0x00000003
#define _DEVCFG1_DEBUG_LENGTH                    0x00000002

#define _DEVCFG1_ICESEL_POSITION                 0x00000003
#define _DEVCFG1_ICESEL_MASK                     0x00000018
#define _DEVCFG1_ICESEL_LENGTH                   0x00000002

#define _DEVCFG1_TRCEN_POSITION                  0x00000005
#define _DEVCFG1_TRCEN_MASK                      0x00000020
#define _DEVCFG1_TRCEN_LENGTH                    0x00000001

#define _DEVCFG1_FMIIEN_POSITION                 0x00000008
#define _DEVCFG1_FMIIEN_MASK                     0x00000100
#define _DEVCFG1_FMIIEN_LENGTH                   0x00000001

#define _DEVCFG1_ETHEXEREF_POSITION              0x00000009
#define _DEVCFG1_ETHEXEREF_MASK                  0x00000200
#define _DEVCFG1_ETHEXEREF_LENGTH                0x00000001

#define _DEVCFG1_CLASSBDIS_POSITION              0x0000000A
#define _DEVCFG1_CLASSBDIS_MASK                  0x00000400
#define _DEVCFG1_CLASSBDIS_LENGTH                0x00000001

#define _DEVCFG1_USBIDIO_POSITION                0x0000000B
#define _DEVCFG1_USBIDIO_MASK                    0x00000800
#define _DEVCFG1_USBIDIO_LENGTH                  0x00000001

#define _DEVCFG1_VBUSIO_POSITION                 0x0000000C
#define _DEVCFG1_VBUSIO_MASK                     0x00001000
#define _DEVCFG1_VBUSIO_LENGTH                   0x00000001

#define _DEVCFG1_HSSPIEN_POSITION                0x0000000D
#define _DEVCFG1_HSSPIEN_MASK                    0x00002000
#define _DEVCFG1_HSSPIEN_LENGTH                  0x00000001

#define _DEVCFG1_SMCLR_POSITION                  0x0000000E
#define _DEVCFG1_SMCLR_MASK                      0x00004000
#define _DEVCFG1_SMCLR_LENGTH                    0x00000001

#define _DEVCFG1_HSUARTEN_POSITION               0x0000000F
#define _DEVCFG1_HSUARTEN_MASK                   0x00008000
#define _DEVCFG1_HSUARTEN_LENGTH                 0x00000001

#define _DEVCFG1_USBDMTRIM_POSITION              0x00000010
#define _DEVCFG1_USBDMTRIM_MASK                  0x000F0000
#define _DEVCFG1_USBDMTRIM_LENGTH                0x00000004

#define _DEVCFG1_USBDPTRIM_POSITION              0x00000014
#define _DEVCFG1_USBDPTRIM_MASK                  0x00F00000
#define _DEVCFG1_USBDPTRIM_LENGTH                0x00000004

#define _DEVCFG1_WDTPSS_POSITION                 0x00000018
#define _DEVCFG1_WDTPSS_MASK                     0x1F000000
#define _DEVCFG1_WDTPSS_LENGTH                   0x00000005

#define _DEVCFG1_FDEBUG_POSITION                 0x00000000
#define _DEVCFG1_FDEBUG_MASK                     0x00000003
#define _DEVCFG1_FDEBUG_LENGTH                   0x00000002

#define _DEVCFG1_w_POSITION                      0x00000000
#define _DEVCFG1_w_MASK                          0xFFFFFFFF
#define _DEVCFG1_w_LENGTH                        0x00000020

#define _DEVCFG0_TDOEN_POSITION                  0x00000000
#define _DEVCFG0_TDOEN_MASK                      0x00000001
#define _DEVCFG0_TDOEN_LENGTH                    0x00000001

#define _DEVCFG0_TROEN_POSITION                  0x00000002
#define _DEVCFG0_TROEN_MASK                      0x00000004
#define _DEVCFG0_TROEN_LENGTH                    0x00000001

#define _DEVCFG0_JTAGEN_POSITION                 0x00000003
#define _DEVCFG0_JTAGEN_MASK                     0x00000008
#define _DEVCFG0_JTAGEN_LENGTH                   0x00000001

#define _DEVCFG0_FCPRI_POSITION                  0x00000005
#define _DEVCFG0_FCPRI_MASK                      0x00000020
#define _DEVCFG0_FCPRI_LENGTH                    0x00000001

#define _DEVCFG0_DMAPRI_POSITION                 0x00000006
#define _DEVCFG0_DMAPRI_MASK                     0x00000040
#define _DEVCFG0_DMAPRI_LENGTH                   0x00000001

#define _DEVCFG0_EXLPRI_POSITION                 0x00000007
#define _DEVCFG0_EXLPRI_MASK                     0x00000080
#define _DEVCFG0_EXLPRI_LENGTH                   0x00000001

