Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.8.326/include/proc/p32mz2051w104132.h
/* Base Addresses for Peripherals */
#define _ADCHS1_BASE_ADDRESS                     0xBF821000
#define _CAN1_BASE_ADDRESS                       0xBF822000
#define _CANFD2_BASE_ADDRESS                     0xBF823000
#define _CRU_BASE_ADDRESS                        0xBF801380
#define _CRYPTO_BASE_ADDRESS                     0xBF8E4000
#define _CVD_BASE_ADDRESS                        0xBF824000
#define _DMAC_BASE_ADDRESS                       0xBF811000
#define _DMT_BASE_ADDRESS                        0xBF800A00
#define _ETH_BASE_ADDRESS                        0xBF843000
#define _I2C1_BASE_ADDRESS                       0xBF820400
#define _I2C2_BASE_ADDRESS                       0xBF840400
#define _ICAP1_BASE_ADDRESS                      0xBF841000
#define _ICAP2_BASE_ADDRESS                      0xBF841200
#define _ICAP3_BASE_ADDRESS                      0xBF841400
#define _ICAP4_BASE_ADDRESS                      0xBF841600
#define _INT_BASE_ADDRESS                        0xBF810000
#define _NVM_BASE_ADDRESS                        0xBF800600
#define _OCMP1_BASE_ADDRESS                      0xBF842000
#define _OCMP2_BASE_ADDRESS                      0xBF842200
#define _OCMP3_BASE_ADDRESS                      0xBF842400
#define _OCMP4_BASE_ADDRESS                      0xBF842600
#define _PCACHE_BASE_ADDRESS                     0xBF812400
#define _PORTA_BASE_ADDRESS                      0xBF820020
#define _PORTB_BASE_ADDRESS                      0xBF820120
#define _PORTC_BASE_ADDRESS                      0xBF820220
#define _PORTK_BASE_ADDRESS                      0xBF820320
#define _PTG_BASE_ADDRESS                        0xBF801C00
#define _RNG_BASE_ADDRESS                        0xBF8E5000
#define _RTCC_BASE_ADDRESS                       0xBF870000
#define _SPI1_BASE_ADDRESS                       0xBF840C00
#define _SPI2_BASE_ADDRESS                       0xBF840E00
#define _SQI1_BASE_ADDRESS                       0xBF8E1000
#define _TMR1_BASE_ADDRESS                       0xBF802000
#define _TMR2_BASE_ADDRESS                       0xBF802200
#define _TMR3_BASE_ADDRESS                       0xBF802400
#define _TMR4_BASE_ADDRESS                       0xBF802600
#define _TMR5_BASE_ADDRESS                       0xBF802800
#define _TMR6_BASE_ADDRESS                       0xBF802A00
#define _TMR7_BASE_ADDRESS                       0xBF802C00
#define _UART1_BASE_ADDRESS                      0xBF840600
#define _UART2_BASE_ADDRESS                      0xBF840800
#define _UART3_BASE_ADDRESS                      0xBF801600
#define _USB1_BASE_ADDRESS                       0xBF844040
#define _USB_BASE_ADDRESS                        0xBF844040
#define _WDT_BASE_ADDRESS                        0xBF800800
#define __DDPSTAT_BASE_ADDRESS                   0xBF812010

/* Default Memory-region macros */
#define __KSEG1_BOOT_MEM_BASE                    0xBFC00000
#define __KSEG1_BOOT_MEM_LENGTH                  0x480
#define __KSEG1_BOOT_MEM_4B0_BASE                0xBFC004B0
#define __KSEG1_BOOT_MEM_4B0_LENGTH              0xFB50
#define __KSEG0_PROGRAM_MEM_BASE                 0x90000000
#define __KSEG0_PROGRAM_MEM_LENGTH               0x200000
#define __KSEG0_DATA_MEM_BASE                    0x80000000
#define __KSEG0_DATA_MEM_LENGTH                  0x80000
#define __CRYPTO1SCM_BASE                        0xBF900000
#define __CRYPTO1SCM_LENGTH                      0x2000
#define __CONFIGSFRS_BFC55F88_BASE               0xBFC55F88
#define __CONFIGSFRS_BFC55F88_LENGTH             0x18
#define __CRYPTO1UCM_BASE                        0x9F902000
#define __CRYPTO1UCM_LENGTH                      0x2000
#define __WCMDATAMEM_BASE                        0xBF803000
#define __WCMDATAMEM_LENGTH                      0x2000
#define __CONFIGSFRS_BFC55E88_BASE               0xBFC55E88
#define __CONFIGSFRS_BFC55E88_LENGTH             0x18
#define __SFRS_BASE                              0xBF800000
#define __SFRS_LENGTH                            0x100000

/*  The following device macros are predefined by the MPLAB XC32
 *  compiler when compiling with the -mprocessor=<device> option.
 *  We also define them here to help the MPLAB X editor evaluate
 *  them correctly.
 */
#ifndef __32MZ2051W104132
#  define __32MZ2051W104132 1
#endif
#ifndef __32MZ2051W104132__
#  define __32MZ2051W104132__ 1
#endif
#ifndef __XC__
#  define __XC__ 1
#endif
#ifndef __XC
#  define __XC 1
#endif
#ifndef __XC32__
#  define __XC32__ 1
#endif
#ifndef __XC32
#  define __XC32 1
#endif
#ifndef __PIC32MZ
#  define __PIC32MZ 1
#endif
#ifndef __PIC32MZ__
#  define __PIC32MZ__ 1
#endif
#ifndef __PIC32_FLASH_SIZE
#  define __PIC32_FLASH_SIZE 2051
#endif
#ifndef __PIC32_FEATURE_SET
#  define __PIC32_FEATURE_SET "W"
#endif
#ifndef __PIC32_FEATURE_SET__
#  define __PIC32_FEATURE_SET__ "W"
#endif
#ifndef __PIC32_FEATURE_SET0
#  define __PIC32_FEATURE_SET0 'W'
#endif
/*  The following device macros indicate which core features are
 *  available on this device.
 */
#ifndef __PIC32_HAS_L1CACHE
# define __PIC32_HAS_L1CACHE 1
#endif
#ifndef __PIC32_HAS_MIPS32R2
# define __PIC32_HAS_MIPS32R2 1
#endif
#ifndef __PIC32_HAS_MICROMIPS
# define __PIC32_HAS_MICROMIPS 1
#endif
#ifndef __PIC32_HAS_DSPR2
# define __PIC32_HAS_DSPR2 1
#endif
#ifndef __PIC32_HAS_SSX
# define __PIC32_HAS_SSX 1
#endif
#ifndef __PIC32_HAS_MMU_MZ_FIXED
# define __PIC32_HAS_MMU_MZ_FIXED 1
#endif
#ifndef __PIC32_HAS_INIT_DATA
# define __PIC32_HAS_INIT_DATA 1
#endif
#ifndef __PIC32_SRS_SET_COUNT
# define __PIC32_SRS_SET_COUNT 8
#endif

#endif
